<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"/><meta content="yes" name="apple-mobile-web-app-capable"/><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"/><meta content="telephone=no" name="format-detection"/><meta name="description"/><title>Não bộ xử lý thế giới như thế nào? | Lương Quốc An</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"/><link rel="stylesheet" type="text/css" href="/css/highlight.css"/><link rel="stylesheet" type="text/css" href="/css/font.css"/><link rel="stylesheet" type="text/css" href="/css/noise.css"/><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"/><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"/></head><body><article class="wrapper"><div class="post-main"><div class="nav"><nav class="container"><a class="sidebar-nav-item active" href="/">Home</a><a class="sidebar-nav-item" href="/archives">Archives</a></nav><div class="container post-meta"><div class="post-time">2018-07-24</div></div></div><div class="container post-header"><h1>Não bộ xử lý thế giới như thế nào?</h1></div><div class="container post-content"><a id="more"></a>
<h2 id="b&#x1ED9;-n&#xE3;o---trung-t&#xE2;m-x&#x1EED;-l&#xFD;-c&#x1EE7;a-nh&#x1EAD;n-th&#x1EE9;c">B&#x1ED9; n&#xE3;o - Trung t&#xE2;m x&#x1EED; l&#xFD; c&#x1EE7;a nh&#x1EAD;n th&#x1EE9;c</h2>
<h3 id="m&#x1EA1;ng-l&#x1B0;&#x1EDB;i-c&#xE1;c-t&#x1EBF;-b&#xE0;o-th&#x1EA7;n-kinh">M&#x1EA1;ng l&#x1B0;&#x1EDB;i c&#xE1;c t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh</h3>
Trong c&#x1A1; th&#x1EC3; con ng&#x1B0;&#x1EDD;i, n&#xE3;o b&#x1ED9; ch&#xED;nh l&#xE0; trung t&#xE2;m c&#x1EE7;a h&#x1EC7; th&#x1EA7;n kinh v&#xE0; c&#x169;ng l&#xE0; n&#x1A1;i x&#x1EED; l&#xFD; qu&#xE1; tr&#xEC;nh nh&#x1EAD;n th&#x1EE9;c. C&#xE1;c t&#xED;n hi&#x1EC7;u k&#xED;ch th&#xED;ch truy&#x1EC1;n t&#x1EEB; c&#xE1;c gi&#xE1;c quan &#x111;&#x1EBF;n n&#xE3;o &#x111;&#x1EC3; x&#x1EED; l&#xFD; v&#xE0; n&#xE3;o b&#x1ED9; g&#x1EED;i c&#xE1;c t&#xED;n hi&#x1EC7;u ph&#x1EA3;n h&#x1ED3;i &#x111;&#x1EC3; &#x111;i&#x1EC1;u khi&#x1EC3;n c&#xE1;c c&#x1A1; quan. N&#xE3;o &#x111;&#x1B0;&#x1EE3;c h&#xEC;nh th&#xE0;nh t&#x1EEB; c&#xE1;c t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh hay c&#xF2;n g&#x1ECD;i l&#xE0; c&#xE1;c t&#x1EBF; b&#xE0;o n&#x1A1;-ron (neuron cell). M&#x1ED9;t t&#x1EBF; b&#xE0;o n&#x1A1;-ron bao g&#x1ED3;m m&#x1ED9;t th&#xE2;n t&#x1EBF; b&#xE0;o ch&#x1EE9;a nh&#xE2;n l&#xE0; trung t&#xE2;m &#x111;i&#x1EC1;u khi&#x1EC3;n c&#x1EE7;a t&#x1EBF; b&#xE0;o. T&#x1EEB; th&#xE2;n t&#x1EBF; b&#xE0;o m&#x1ECD;c ra c&#xE1;c s&#x1EE3;i nh&#xE1;nh(dendrite) v&#xE0; m&#x1ED9;t s&#x1EE3;i tr&#x1EE5;c d&#xE0;i(axon).
<p align="center">
<img src="http://nhiethuyettre.net/wp-content/uploads/2017/08/neuron-cell.png" width="600" height="340" alt="Neuron cell"> <em>T&#x1EBF; b&#xE0;o th&#x1EA7;n kinh (neuron cell)</em>
</p>
S&#x1EE3;i nh&#xE1;nh nh&#x1EAD;n c&#xE1;c t&#xED;n hi&#x1EC7;u &#x111;&#x1B0;&#x1EE3;c truy&#x1EC1;n t&#x1EEB; c&#xE1;c n&#x1A1;-ron kh&#xE1;c v&#xE0; truy&#x1EC1;n v&#x1EC1; th&#xE2;n t&#x1EBF; b&#xE0;o. Th&#xE2;n t&#x1EBF; b&#xE0;o s&#x1EBD; nh&#x1EAD;n c&#xE1;c t&#xED;n hi&#x1EC7;u k&#xED;ch th&#xED;ch v&#xE0; ph&#xE1;t sinh ra m&#x1ED9;t xung truy&#x1EC1;n ra s&#x1EE3;i tr&#x1EE5;c &#x111;&#x1EC3; truy&#x1EC1;n &#x111;&#x1EBF;n c&#xE1;c t&#x1EBF; b&#xE0;o ti&#x1EBF;p theo. C&#x1EE9; nh&#x1B0; th&#x1EBF;, c&#xE1;c t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh li&#xEA;n k&#x1EBF;t d&#xE0;y &#x111;&#x1EB7;c v&#x1EDB;i nhau h&#xEC;nh th&#xE0;nh m&#x1ED9;t m&#x1EA1;ng l&#x1B0;&#x1EDB;i th&#x1EA7;n kinh cho ph&#xE9;p t&#xED;n hi&#x1EC7;u k&#xED;ch th&#xED;ch &#x111;i t&#x1EEB; c&#xE1;c gi&#xE1;c quan truy&#x1EC1;n v&#xE0;o s&#xE2;u trong n&#xE3;o v&#xE0; h&#xEC;nh th&#xE0;nh nh&#x1EAD;n th&#x1EE9;c c&#x1EE7;a ch&#xFA;ng ta. N&#x1A1;i n&#x1ED1;i ti&#x1EBF;p gi&#x1EEF;a t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh n&#xE0;y v&#xE0; t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh kh&#xE1;c &#x111;&#x1B0;&#x1EE3;c g&#x1ECD;i l&#xE0; synapse. Synapse &#x111;&#xF3;ng vai tr&#xF2; nh&#x1B0; m&#x1ED9;t c&#x1ED5;ng ti&#x1EBF;p nh&#x1EAD;n t&#xED;n hi&#x1EC7;u th&#x1EA7;n kinh truy&#x1EC1;n t&#x1EEB; t&#x1EBF; b&#xE0;o n&#xE0;y sang t&#x1EBF; b&#xE0;o kh&#xE1;c. C&#xE1;c t&#xED;n hi&#x1EC7;u th&#x1EA7;n kinh (d&#x1B0;&#x1EDB;i d&#x1EA1;ng h&#x1EE3;p ch&#x1EA5;t h&#xF3;a h&#x1ECD;c hay t&#xED;n hi&#x1EC7;u &#x111;i&#x1EC7;n) &#x111;i ra t&#x1EEB; s&#x1EE3;i tr&#x1EE5;c v&#xE0; s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c ti&#x1EBF;p nh&#x1EAD;n b&#x1EDF;i c&#xE1;c c&#x1A1; quan th&#x1EE5; c&#x1EA3;m hay c&#xE1;c c&#x1ED5;ng &#x111;i&#x1EC7;n h&#xF3;a &#x1EDF; t&#x1EBF; b&#xE0;o ti&#x1EBF;p theo. Tuy nhi&#xEA;n, c&#x1EA5;u tr&#xFA;c c&#x1EE7;a c&#xE1;c c&#x1A1; quan th&#x1EE5; c&#x1EA3;m c&#x1EE7;a t&#x1EBF; b&#xE0;o nh&#x1EAD;n c&#xE1;c n&#x1A1;-ron th&#x1EA7;n kinh c&#xF3; th&#x1EC3; cho ph&#xE9;p t&#xED;n hi&#x1EC7;u truy&#x1EC1;n v&#xE0;o ho&#x1EB7;c &#x1EE9;c ch&#x1EBF; t&#xED;n hi&#x1EC7;u. N&#xF3;i c&#xE1;ch kh&#xE1;c n&#xF3; gi&#x1ED1;ng v&#x1EDB;i qu&#xE1; tr&#xEC;nh ch&#x1ECD;n l&#x1ECD;c hay s&#x1EF1; &#x111;i&#x1EC1;u ch&#x1EC9;nh t&#xED;n hi&#x1EC7;u. S&#x1EF1; kh&#xE1;c bi&#x1EC7;t trong vi&#x1EC7;c th&#x1EE5; c&#x1EA3;m c&#xE1;c t&#xED;n hi&#x1EC7;u th&#x1EA7;n kinh d&#x1EAB;n &#x111;&#x1EBF;n s&#x1EF1; kh&#xE1;c bi&#x1EC7;t trong ch&#x1EE9;c n&#x103;ng c&#x1EE7;a c&#xE1;c t&#x1EBF; b&#xE0;o n&#x1A1;-ron, cho ph&#xE9;p ch&#xFA;ng x&#x1EED; l&#xFD; c&#xE1;c t&#xED;n hi&#x1EC7;u kh&#xE1;c nhau t&#x1EEB; th&#x1EBF; gi&#x1EDB;i b&#xEA;n ngo&#xE0;i. ### S&#x1EF1; chuy&#xEA;n bi&#x1EC7;t h&#xF3;a c&#x1EE7;a n&#xE3;o b&#x1ED9; Do s&#x1EF1; kh&#xE1;c bi&#x1EC7;t trong kh&#x1EA3; n&#x103;ng b&#x1ECB; k&#xED;ch th&#xED;ch b&#x1EDF;i c&#xE1;c t&#xED;n hi&#x1EC7;u th&#x1EA7;n kinh, c&#xE1;c n&#x1A1;-ron kh&#xE1;c nhau c&#xF3; th&#x1EC3; x&#x1EED; l&#xFD; c&#xE1;c t&#xED;n hi&#x1EC7;u kh&#xE1;c nhau. V&#xED; d&#x1EE5; trong c&#xE1;c n&#x1A1;-ron truy&#x1EC1;n t&#xED;n hi&#x1EC7;u t&#x1EEB; th&#x1ECB; gi&#xE1;c &#x111;i v&#xE0;o trong n&#xE3;o, c&#xF3; c&#xE1;c t&#x1EBF; b&#xE0;o s&#x1EBD; b&#x1ECB; k&#xED;ch ho&#x1EA1;t khi ta nh&#xEC;n th&#x1EA5;y &#x111;&#x1B0;&#x1EDD;ng ch&#xE9;o hay c&#xF3; t&#x1EBF; b&#xE0;o s&#x1EBD; k&#xED;ch ho&#x1EA1;t khi ta nh&#xEC;n th&#x1EA5;y h&#xEC;nh tr&#xF2;n, .... &#x110;i&#x1EC1;u n&#xE0;y c&#x169;ng t&#x1B0;&#x1A1;ng t&#x1EF1; cho c&#xE1;c gi&#xE1;c quan kh&#xE1;c, ch&#xFA;ng t&#x1EA1;o cho ch&#xFA;ng ta c&#x1EA3;m nh&#x1EAD;n nh&#x1EEF;ng c&#x1EA3;m gi&#xE1;c kh&#xE1;c nhau v&#xE0; t&#x1EEB; &#x111;&#xF3; n&#xE3;o b&#x1ED9; s&#x1EBD; c&#xF3; nh&#x1EEF;ng ph&#x1EA3;n h&#x1ED3;i kh&#xE1;c nhau. C&#xE1;c n&#x1A1;-ron th&#x1EA7;n kinh kh&#xE1;c nhau t&#x1EAD;p h&#x1EE3;p l&#x1EA1;i th&#xE0;nh m&#x1ED9;t v&#xF9;ng chuy&#xEA;n bi&#x1EC7;t trong b&#x1ED9; n&#xE3;o. C&#xE1;c n&#x1A1;-ron trong v&#xF9;ng chuy&#xEA;n bi&#x1EC7;t n&#xE0;y c&#xF9;ng nhau x&#x1EED; l&#xFD; m&#x1ED9;t lo&#x1EA1;i t&#xED;n hi&#x1EC7;u ph&#x1EE9;c t&#x1EA1;p h&#x1A1;n so v&#x1EDB;i m&#x1ED9;t n&#x1A1;-ron &#x111;&#x1A1;n l&#x1EBB; c&#xF3; th&#x1EC3; &#x111;&#x1EA3;m tr&#xE1;ch. V&#xED; d&#x1EE5; nh&#x1B0; t&#x1EAD;p h&#x1EE3;p c&#xE1;c n&#x1A1;-ron n&#x1EB1;m &#x1EDF; v&#xF9;ng sau &#x111;&#x1EA7;u h&#xEC;nh th&#xE0;nh th&#xF9;y ch&#x1EA9;m c&#xF3; tr&#xE1;ch nhi&#x1EC7;m x&#x1EE9; l&#xFD; t&#xED;n hi&#x1EC7;u th&#x1ECB; gi&#xE1;c truy&#x1EC1;n t&#x1EEB; m&#x1EAF;t v&#xE0;o. N&#xE3;o b&#x1ED9; v&#x1EC1; c&#x1A1; b&#x1EA3;n &#x111;&#x1B0;&#x1EE3;c chia l&#xE0;m c&#xE1;c v&#xF9;ng nh&#x1B0; sau:
<p align="center">
<img src="http://nhiethuyettre.net/wp-content/uploads/2017/08/brain-operation.jpg" alt="" width="500" height="350" class="alignnone size-medium wp-image-807"> <em>S&#x1EF1; ph&#xE2;n v&#xF9;ng c&#x1EE7;a n&#xE3;o b&#x1ED9;</em>
</p>
Trong t&#x1EEB;ng v&#xF9;ng c&#x1EE7;a b&#x1ED9; n&#xE3;o l&#x1EA1;i c&#x169;ng c&#xF3; s&#x1EF1; chuy&#xEA;n bi&#x1EC7;t h&#xF3;a. Theo m&#x1ED9;t <a href="https://www.ted.com/talks/nancy_kanwisher_the_brain_is_a_swiss_army_knife?language=vi#t-389930" target="_blank">nghi&#xEA;n c&#x1EE9;u c&#x1EE7;a gi&#xE1;o s&#x1EF1; Nancy Kanwisher</a>, b&#x1ED9; n&#xE3;o kh&#xF4;ng ch&#x1EC9; chia th&#xE0;nh t&#x1EEB;ng v&#xF9;ng x&#x1EED; l&#xFD; t&#xED;n hi&#x1EC7;u chung nh&#x1B0; th&#x1ECB; gi&#xE1;c, th&#xED;nh gi&#xE1;c m&#xE0; c&#xF2;n chuy&#xEA;n bi&#x1EC7;t &#x111;&#x1EBF;n m&#x1EE9;c c&#xF3; nh&#x1EEF;ng v&#xF9;ng ch&#x1EC9; chuy&#xEA;n ph&#x1EA3;n &#x1EE9;ng khi nh&#xEC;n th&#x1EA5;y khu&#xF4;n m&#x1EB7;t, hay khi th&#x1EA5;y m&#x1ED9;t lo&#x1EA1;i m&#xE0;u s&#x1EAF;c hay khi nghe m&#x1ED9;t &#xE2;m thanh c&#xF3; t&#x1EA7;n s&#x1ED1; cao, .... B&#x1ED9; n&#xE3;o c&#x1EE7;a ch&#xFA;ng ta v&#x1EEB;a l&#xE0; m&#x1ED9;t ch&#x1EC9;nh th&#x1EC3; th&#x1ED1;ng nh&#x1EA5;t ph&#x1EE5;c v&#x1EE5; cho m&#x1ED9;t m&#x1EE5;c &#x111;&#xED;ch chung l&#xE0; x&#x1EED; l&#xFD; t&#xED;n hi&#x1EC7;u nh&#x1B0;ng &#x111;&#x1ED3;ng th&#x1EDD;i c&#x169;ng l&#xE0; t&#x1ED5; h&#x1EE3;p c&#x1EE7;a nhi&#x1EC1;u th&#xE0;nh ph&#x1EA7;n kh&#xE1;c nhau, chuy&#xEA;n bi&#x1EC7;t cho c&#xE1;c t&#xED;nh n&#x103;ng kh&#xE1;c nhau. &#x110;i&#x1EC1;u k&#x1EF3; di&#x1EC7;u h&#x1A1;n n&#x1EEF;a l&#xE0; n&#xE3;o b&#x1ED9; c&#xF3; th&#x1EC3; giao ti&#x1EBF;p gi&#x1EEF;a c&#xE1;c v&#xF9;ng v&#x1EDB;i nhau nh&#x1B0; gi&#x1EEF;a th&#x1ECB; gi&#xE1;c v&#xE0; ng&#xF4;n ng&#x1EEF;, khi ta th&#x1EA5;y m&#x1ED9;t b&#x1EE9;c tranh ta c&#xF3; th&#x1EC3; m&#xF4; t&#x1EA3; n&#xF3; hay khi ta th&#x1EA5;y m&#x1ED9;t ai &#x111;&#xF3; ta c&#xF3; th&#x1EC3; g&#x1ECD;i t&#xEA;n h&#x1ECD; (n&#x1EBF;u ta &#x111;&#xE3; t&#x1EEB;ng bi&#x1EBF;t qua). Nh&#x1EDD; v&#xE0;o s&#x1EF1; chuy&#xEA;n bi&#x1EC7;t h&#xF3;a n&#xE0;y, n&#xE3;o b&#x1ED9; c&#xF3; th&#x1EC3; d&#x1EC5; d&#xE0;ng x&#x1EED; l&#xFD; c&#xE1;c lo&#x1EA1;i th&#xF4;ng tin &#x111;a d&#x1EA1;ng kh&#xE1;c nhau, khai th&#xE1;c t&#x1ED1;i &#x111;a s&#x1EF1; &#x111;&#x1EB7;c th&#xF9; c&#x1EE7;a t&#xED;n hi&#x1EC7;u &#x111;&#xF3; v&#xE0; k&#x1EBF;t n&#x1ED1;i ch&#xFA;ng l&#x1EA1;i v&#x1EDB;i nhau th&#xE0;nh nh&#x1EEF;ng kh&#xE1;i ni&#x1EC7;m c&#xF3; ngh&#x129;a v&#xE0; h&#xEC;nh th&#xE0;nh n&#xEA;n nh&#x1EAD;n th&#x1EE9;c, hi&#x1EC3;u bi&#x1EBF;t c&#x1EE7;a ch&#xFA;ng ta. Gi&#x1ED1;ng nh&#x1B0; s&#x1EF1; k&#x1EBF;t n&#x1ED1;i gi&#x1EEF;a h&#xEC;nh &#x1EA3;nh con b&#xF2; v&#xE0; &#xE2;m thanh &quot;b&#xF2;&quot; s&#x1EBD; cho ta bi&#x1EBF;t r&#x1EB1;ng con v&#x1EAD;t &#x111;&#xF3; g&#x1EAF;n li&#x1EC1;n v&#x1EDB;i t&#x1EEB; &quot;b&#xF2;&quot; v&#xE0; l&#x1EA7;n sau g&#x1EB7;p ch&#xFA;ng ta c&#xF3; th&#x1EC3; g&#x1ECD;i t&#xEA;n n&#xF3;. ## Th&#x1ECB; gi&#xE1;c - ngu&#x1ED3;n d&#x1EEF; li&#x1EC7;u quan tr&#x1ECD;ng ### S&#x1EE9;c m&#x1EA1;nh c&#x1EE7;a th&#x1ECB; gi&#xE1;c C&#xF3; c&#xE2;u: &quot;Tr&#x103;m nghe kh&#xF4;ng b&#x1EB1;ng m&#x1ED9;t th&#x1EA5;y&quot;. C&#xE2;u n&#xF3;i n&#xE0;y cho th&#x1EA5;y &#x111;&#x1B0;&#x1EE3;c s&#x1EF1; quan tr&#x1ECD;ng c&#x1EE7;a t&#xED;n hi&#x1EC7;u th&#x1ECB; gi&#xE1;c &#x111;&#x1ED1;i v&#x1EDB;i nh&#x1EAD;n th&#x1EE9;c c&#x1EE7;a con ng&#x1B0;&#x1EDD;i. Gi&#x1EA3; s&#x1EED; r&#x1EB1;ng b&#x1EA1;n ch&#x1B0;a t&#x1EEB;ng th&#x1EA5;y con voi bao gi&#x1EDD; v&#xE0; b&#x1EA1;n v&#x1EEB;a m&#x1EDB;i nghe b&#x1EA1;n m&#xEC;nh &#x111;ang n&#xF3;i v&#x1EC1; con voi. B&#x1EA1;n t&#xF2; m&#xF2; mu&#x1ED1;n bi&#x1EBF;t n&#xF3; nh&#x1B0; th&#x1EBF; n&#xE0;o v&#xE0; h&#x1ECF;i b&#x1EA1;n c&#x1EE7;a b&#x1EA1;n m&#xF4; t&#x1EA3; v&#x1EC1; n&#xF3;. B&#x1EA1;n c&#x1EE7;a b&#x1EA1;n n&#xF3;i r&#x1EB1;ng n&#xF3; c&#xF3; 4 ch&#xE2;n, m&#x169;i d&#xE0;i, tai to, th&#xE2;n m&#xEC;nh to l&#x1EDB;n, ... nh&#x1B0;ng th&#x1EAD;t kh&#xF3; &#x111;&#x1EC3; t&#x1B0;&#x1EDF;ng t&#x1B0;&#x1EE3;ng ra &#x111;&#x1B0;&#x1EE3;c con voi tr&#xF4;ng nh&#x1B0; th&#x1EBF; n&#xE0;o ch&#x1EC9; v&#x1EDB;i v&#xE0;i c&#xE2;u m&#xF4; t&#x1EA3; v&#xE0; c&#xF3; khi c&#x1EA7;n &#x111;&#x1EBF;n c&#x1EA3; &#x111;o&#x1EA1;n v&#x103;n d&#xE0;i &#x111;&#x1EC3; c&#xF3; th&#x1EC3; t&#x1EA3; chi ti&#x1EBF;t &#x111;&#x1EBF;n m&#xE0;u s&#x1EAF;c v&#xE0; h&#xEC;nh d&#xE1;ng c&#x1EE7;a con voi. Tuy nhi&#xEA;n t&#x1EA5;t c&#x1EA3; s&#x1EBD; &#x111;&#x1A1;n gi&#x1EA3;n h&#x1A1;n n&#x1EBF;u b&#x1EA1;n &#x111;&#x1B0;&#x1EE3;c &#x111;&#x1B0;a cho m&#x1ED9;t t&#x1EA5;m h&#xEC;nh c&#x1EE7;a con voi v&#xE0; &quot;oh! th&#xEC; ra con voi l&#xE0; nh&#x1B0; th&#x1EBF; n&#xE0;y&quot;.
<p>
<img src="http://nhiethuyettre.net/wp-content/uploads/2017/08/kiki-bouba.gif" alt="" width="450" height="232" class="alignnone size-medium wp-image-814"> <em>C&#xE1;i n&#xE0;o l&#xE0; kiki v&#xE0; c&#xE1;i n&#xE0;o l&#xE0; bouba</em>
</p>
Th&#x1ECB; gi&#xE1;c kh&#xF4;ng ch&#x1EC9; &#x111;&#x1A1;n thu&#x1EA7;n x&#x1EED; l&#xFD; h&#xEC;nh d&#x1EA1;ng b&#xEA;n ngo&#xE0;i c&#x1EE7;a v&#x1EAD;t th&#x1EC3; m&#xE0; n&#xF3; c&#xF2;n c&#xF3; th&#x1EC3; cung c&#x1EA5;p nhi&#x1EC1;u th&#xF4;ng tin h&#x1A1;n th&#x1EBF; n&#x1EEF;a. C&#x169;ng gi&#x1ED1;ng nh&#x1B0; vi&#x1EC7;c b&#x1EA1;n nh&#xEC;n v&#xE0;o m&#x1ED9;t d&#x129;a &#x111;&#x1ED3; &#x103;n, ch&#x1B0;a c&#x1EA7;n n&#x1EBF;m hay ng&#x1B0;&#x1EDF;i m&#xF9;i b&#x1EA1;n c&#x169;ng &#x111;&#xE3; c&#xF3; th&#x1EC3; c&#xF3; &#x111;&#xE1;nh gi&#xE1; v&#x1EC1; n&#xF3;, &quot;tr&#xF4;ng&quot; n&#xF3; c&#xF3; ngon hay kh&#xF4;ng. Hay nh&#x1B0; hi&#x1EC7;u &#x1EE9;ng <a href="https://en.wikipedia.org/wiki/Bouba/kiki_effect" target="_blank">kiki-bouba</a> th&#x1B0;&#x1EDD;ng &#x111;&#x1B0;&#x1EE3;c d&#xF9;ng trong l&#xE0;m phim ho&#x1EA1;t h&#xEC;nh, ta th&#x1B0;&#x1EDD;ng c&#xF3; &#xE1;c c&#x1EA3;m v&#x1EDB;i c&#xE1;c v&#x1EAD;t nh&#x1ECD;n v&#xE0; thi&#x1EC7;n c&#x1EA3;m v&#x1EDB;i h&#xEC;nh tr&#xF2;n. N&#xF3;i c&#xE1;ch kh&#xE1;c, ph&#x1EA7;n l&#x1EDB;n nh&#x1EAD;n &#x111;&#x1ECB;nh c&#x1EE7;a ch&#xFA;ng ta l&#xE0; d&#x1EF1;a tr&#xEA;n th&#x1ECB; gi&#xE1;c. Vi&#x1EC7;c ch&#xFA;ng ta ph&#x1EE5; thu&#x1ED9;c nhi&#x1EC1;u v&#xE0;o th&#x1ECB; gi&#xE1;c l&#xE0; ho&#xE0;n to&#xE0;n b&#xEC;nh th&#x1B0;&#x1EDD;ng v&#xEC; th&#x1ECB; gi&#xE1;c cung c&#x1EA5;p cho ch&#xFA;ng ta th&#xF4;ng tin nhanh h&#x1A1;n c&#xE1;c gi&#xE1;c quan kh&#xE1;c. Trong cu&#x1ED9;c chi&#x1EBF;n sinh t&#x1ED3;n th&#xEC; vi&#x1EC7;c t&#xEC;m ki&#x1EBF;m th&#x1EE9;c &#x103;n v&#xE0; tr&#x1ED1;n tr&#xE1;nh k&#x1EBB; th&#xF9; l&#xE0; c&#x1EF1;c k&#x1EF3; quan tr&#x1ECD;ng. C&#xE1;c gi&#xE1;c quan nh&#x1B0; x&#xFA;c gi&#xE1;c v&#xE0; v&#x1ECB; gi&#xE1;c &#x111;&#xF2;i h&#x1ECF;i s&#x1EF1; ti&#x1EBF;p x&#xFA;c c&#x169;ng nh&#x1B0; kh&#x1EE9;u gi&#xE1;c c&#x1EA7;n kho&#x1EA3;ng c&#xE1;ch g&#x1EA7;n, ho&#xE0;n to&#xE0;n kh&#xF4;ng t&#x1ED1;t cho vi&#x1EC7;c tr&#x1ED1;n tr&#xE1;nh k&#x1EBB; th&#xF9;. Th&#x1EED; t&#x1B0;&#x1EDF;ng t&#x1B0;&#x1EE3;ng ta ph&#x1EA3;i m&#xF2; m&#x1EAB;m m&#x1ED9;t h&#x1ED3;i &#x111;&#x1EC3; nh&#x1EAD;n ra &#x111;&#xF3; l&#xE0; m&#x1ED9;t con s&#x1B0; t&#x1EED; &#x111;ang &#x111;&#xF3;i &#x111;&#x1EE9;ng ngay c&#x1EA1;nh ta. Th&#xED;nh gi&#xE1;c c&#x169;ng c&#xF3; th&#x1EC3; ho&#x1EA1;t &#x111;&#x1ED9;ng &#x1EDF; kho&#x1EA3;ng c&#xE1;ch xa nh&#x1B0;ng kh&#xF4;ng c&#xF3; nhi&#x1EC1;u th&#xF4;ng tin nh&#x1B0; th&#x1ECB; gi&#xE1;c v&#xE0; &#x111;&#x1EB7;c bi&#x1EC7;t k&#xE9;m h&#x1EEF;u &#xED;ch khi t&#xEC;m ki&#x1EBF;m th&#x1EE9;c &#x103;n, ch&#x1EB3;ng ai l&#x1EA1;i &#x111;i nghe xem d&#x129;a th&#x1EE9;c &#x103;n &#x111;ang &#x1EDF; &#x111;&#xE2;u, h&#x1ECD; &quot;nh&#xEC;n&quot; xung quanh v&#xE0; t&#xEC;m ki&#x1EBF;m. Th&#x1ECB; gi&#xE1;c &#x111;&#xF3;ng vai tr&#xF2; quan tr&#x1ECD;ng cho n&#xEA;n h&#x1EA7;u h&#x1EBF;t c&#xE1;c kh&#xE1;i ni&#x1EC7;m v&#xE0; nh&#x1EAD;n th&#x1EE9;c c&#x1EE7;a ta c&#xF3; &#x111;&#x1B0;&#x1EE3;c l&#xE0; nh&#x1EDD; v&#xE0;o th&#x1ECB; gi&#xE1;c, ch&#xFA;ng ta hi&#x1EC3;u &#x111;&#x1B0;&#x1EE3;c con voi l&#xE0; nh&#x1EDD; &#x111;&#xE3; t&#x1EEB;ng nh&#xEC;n th&#x1EA5;y con voi, ch&#xFA;ng ta h&#x1ECD;c h&#x1ECF;i th&#xF4;ng qua quan s&#xE1;t ng&#x1B0;&#x1EDD;i kh&#xE1;c v&#xE0; h&#x1ECD;c b&#x1EB1;ng h&#xEC;nh &#x1EA3;nh gi&#xFA;p ch&#xFA;ng ta d&#x1EC5; h&#x1ECD;c h&#x1A1;n. Th&#x1EED; t&#x1B0;&#x1EDF;ng t&#x1B0;&#x1EE3;ng th&#x1EBF; gi&#x1EDB;i n&#xE0;y ai sinh ra c&#x169;ng &#x111;&#xE3; khi&#x1EBF;m khuy&#x1EBF;t v&#x1EC1; th&#x1ECB; gi&#xE1;c th&#xEC; li&#x1EC7;u con ng&#x1B0;&#x1EDD;i c&#xF3; th&#x1EC3; &#x111;&#x1EA1;t &#x111;&#x1EBF;n n&#x1EC1;n v&#x103;n minh nh&#x1B0; ng&#xE0;y nay hay s&#x1EBD; tr&#x1EDF; n&#xEA;n gi&#x1ED1;ng v&#x1EDB;i lo&#xE0;i d&#x1A1;i ch&#x1EC9; ki&#x1EBF;m &#x103;n v&#x1EC1; &#x111;&#xEA;m. Th&#x1ECB; gi&#xE1;c &#x111;&#xF3;ng g&#xF3;p ph&#x1EA7;n nhi&#x1EC1;u cho ng&#x1EEF; ngh&#x129;a v&#xE0; kh&#xE1;i ni&#x1EC7;m trong &#x111;&#x1EA7;u ch&#xFA;ng ta v&#xE0; t&#x1EEB; &#x111;&#xF3; cho ch&#xFA;ng ta nh&#x1EAD;n th&#x1EE9;c cao v&#x1EC1; th&#x1EBF; gi&#x1EDB;i. N&#x1EBF;u m&#xE1;y t&#xED;nh mu&#x1ED1;n &#x111;&#x1B0;&#x1EE3;c nh&#x1B0; con ng&#x1B0;&#x1EDD;i th&#xEC; nh&#x1EA5;t &#x111;&#x1ECB;nh ph&#x1EA3;i &#x111;&#x1EA1;t &#x111;&#x1B0;&#x1EE3;c kh&#x1EA3; n&#x103;ng nh&#xEC;n v&#xE0; hi&#x1EC3;u nh&#x1B0; con ng&#x1B0;&#x1EDD;i. ### Ph&#xE2;n bi&#x1EC7;t v&#xE0; gom nh&#xF3;m c&#xE1;c v&#x1EAD;t th&#x1EC3; Trong ng&#xE0;nh th&#x1ECB; gi&#xE1;c m&#xE1;y t&#xED;nh, c&#xF3; m&#x1ED9;t b&#xE0;i to&#xE1;n &#x111;&#x1B0;&#x1EE3;c nhi&#x1EC1;u ng&#x1B0;&#x1EDD;i quan t&#xE2;m l&#xE0; b&#xE0;i to&#xE1;n ph&#xE1;t hi&#x1EC7;n v&#x1EAD;t th&#x1EC3; (detection and segmentation). B&#xE0;i to&#xE1;n &#x111;&#x1EB7;t ra c&#xE2;u h&#x1ECF;i l&#xE0;m th&#x1EBF; n&#xE0;o &#x111;&#x1EC3; t&#x1EEB; m&#x1ED9;t b&#x1EE9;c &#x1EA3;nh cho tr&#x1B0;&#x1EDB;c c&#xF3; th&#x1EC3; ch&#x1EC9; ra &#x111;&#x1B0;&#x1EE3;c c&#xE1;i c&#xE2;y n&#x1EB1;m &#x1EDF; &#x111;&#xE2;u trong b&#x1EE9;c &#x1EA3;nh, con ch&#xF3; n&#x1EB1;m &#x1EDF; &#x111;&#xE2;u v&#xE0; th&#x1EAD;m ch&#xED; c&#xF3; th&#x1EC3; &quot;x&#xE9;&quot; ch&#xED;nh x&#xE1;c con ch&#xF3; ra kh&#x1ECF;i b&#x1EE9;c &#x1EA3;nh v&#xE0; d&#xE1;n l&#xEA;n b&#x1EE9;c &#x1EA3;nh kh&#xE1;c ch&#x1EB3;ng h&#x1EA1;n. B&#xE0;i to&#xE1;n n&#xE0;y &#x111;&#x1ED1;i v&#x1EDB;i con ng&#x1B0;&#x1EDD;i l&#xE0; m&#xF4;t &#x111;i&#x1EC1;u v&#xF4; c&#xF9;ng d&#x1EC5; d&#xE0;ng v&#x1EAD;y t&#x1EA1;i sao l&#x1EA1;i l&#xE0; m&#x1ED9;t b&#xE0;i to&#xE1;n kh&#xF3; &#x111;&#x1ED1;i v&#x1EDB;i m&#xE1;y t&#xED;nh? H&#xEC;nh &#x1EA3;nh trong m&#xE1;y t&#xED;nh &#x111;&#x1B0;&#x1EE3;c bi&#x1EC3;u th&#x1ECB; b&#x1EDF;i c&#xE1;c &#x111;i&#x1EC3;m &#x1EA3;nh v&#xE0; c&#xE1;c &#x111;i&#x1EC3;m &#x1EA3;nh n&#xE0;y &#x111;&#x1B0;&#x1EE3;c th&#x1EC3; hi&#x1EC7;n d&#x1B0;&#x1EDB;i d&#x1EA1;ng con s&#x1ED1;. &#x110;&#x1ED1;i v&#x1EDB;i con ng&#x1B0;&#x1EDD;i th&#xEC; h&#xEC;nh &#x1EA3;nh v&#xE0;o m&#x1EAF;t ng&#x1B0;&#x1EDD;i c&#x169;ng t&#x1B0;&#x1EE3;ng t&#x1EF1;. M&#x1EAF;t ch&#xFA;ng ta ho&#x1EA1;t &#x111;&#x1ED9;ng nh&#x1B0; m&#x1ED9;t th&#x1EA5;u k&#xED;nh thu th&#x1EAD;p c&#xE1;c tia s&#xE1;ng &#x111;i t&#x1EEB; v&#x1EAD;t th&#x1EC3; &#x111;&#x1EBF;n ta, c&#xE1;c tia s&#xE1;ng n&#xE0;y s&#x1EBD; k&#xED;ch th&#xED;ch c&#xE1;c t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh &#x1EDF; m&#x1EAF;t v&#xE0; truy&#x1EC1;n t&#xED;n hi&#x1EC7;u &#x111;i v&#xE0;o n&#xE3;o. C&#xE1;c tia s&#xE1;ng c&#xF3; m&#xE0;u s&#x1EAF;c kh&#xE1;c nhau l&#xE0; do c&#xF3; n&#x103;ng l&#x1B0;&#x1EE3;ng kh&#xE1;c nhau, b&#x1B0;&#x1EDB;c s&#xF3;ng kh&#xE1;c nhau t&#x1B0;&#x1A1;ng t&#x1EF1; nh&#x1B0; nh&#x1EEF;ng con s&#x1ED1; kh&#xE1;c nhau bi&#x1EC3;u th&#x1ECB; m&#xE0;u s&#x1EAF;c trong m&#xE1;y t&#xED;nh v&#xE0; h&#xEC;nh &#x1EA3;nh ta c&#xF3; &#x111;&#x1B0;&#x1EE3;c c&#x169;ng l&#xE0; t&#x1EAD;p h&#x1EE3;p c&#xE1;c &#x111;i&#x1EC3;m s&#xE1;ng, gi&#x1ED1;ng v&#x1EDB;i c&#xE1;c pixel t&#x1EA1;o n&#xEA;n h&#xEC;nh &#x1EA3;nh trong m&#xE1;y t&#xED;nh. C&#xE2;u h&#x1ECF;i &#x111;&#x1EB7;t ra l&#xE0; con ng&#x1B0;&#x1EDD;i l&#xE0;m th&#x1EBF; n&#xE0;o c&#xF3; th&#x1EC3; gom c&#xE1;c &#x111;i&#x1EC3;m &#x1EA3;nh n&#xE0;y th&#xE0;nh m&#x1ED9;t &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng c&#x1EE5; th&#x1EC3;?
<p align="center">
<img src="http://nhiethuyettre.net/wp-content/uploads/2017/08/vision.jpg" alt="" width="450" height="163" class="alignnone size-medium wp-image-816"> <em>m&#x1EAF;t thu th&#x1EAD;p &#xE1;nh s&#xE1;ng t&#x1EEB; v&#x1EAD;t th&#x1EC3; v&#xE0; truy&#x1EC1;n v&#xE0;o n&#xE3;o.</em>
</p>
Con ng&#x1B0;&#x1EDD;i c&#xF3; th&#x1EC3; d&#x1EF1;a v&#xE0;o m&#xE0;u s&#x1EAF;c &#x111;&#x1EC3; ph&#xE2;n t&#xE1;ch c&#xE1;c v&#x1EAD;t th&#x1EC3; v&#x1EDB;i nhau. Con ng&#x1B0;&#x1EDD;i c&#xF3; kh&#x1EA3; n&#x103;ng ph&#xE2;n bi&#x1EC7;t h&#x1A1;n 1 tri&#x1EC7;u m&#xE0;u s&#x1EAF;c kh&#xE1;c nhau. T&#x1EA1;i v&#x1ECB; tr&#xED; chuy&#x1EC3;n ti&#x1EBF;p t&#x1EEB; m&#xE0;u n&#xE0;y sang m&#xE0;u kh&#xE1;c h&#xEC;nh th&#xE0;nh s&#x1EF1; kh&#xE1;c bi&#x1EC7;t v&#xE0; con ng&#x1B0;&#x1EDD;i nhanh ch&#xF3;ng nh&#x1EAD;n ra bi&#xEA;n gi&#x1EDB;i &#x111;&#xF3; v&#xE0; nh&#x1EAD;n ra r&#x1EB1;ng &#x111;&#xE3; c&#xF3; s&#x1EF1; thay &#x111;&#x1ED5;i t&#x1EEB; &#x111;&#xF3; t&#xE1;ch bi&#x1EC7;t c&#xE1;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng d&#x1EF1;a tr&#xEA;n m&#xE0;u s&#x1EAF;c. Gi&#x1ED1;ng nh&#x1B0; vi&#x1EC7;c ta d&#x1EC5; nh&#x1EAD;n ra m&#x1ED9;t h&#xEC;nh tr&#xF2;n &#x111;en gi&#x1EEF;a n&#x1EC1;n tr&#x1EAF;ng v&#xEC; s&#x1EF1; kh&#xE1;c bi&#x1EC7;t r&#xF5; r&#xE0;ng nh&#x1B0;ng s&#x1EBD; kh&#xF3; ph&#xE1;t hi&#x1EC7;n ra h&#x1A1;n n&#x1EBF;u m&#xE0;u s&#x1EAF;c ch&#xFA;ng gi&#x1ED1;ng nhau. Nhi&#x1EC1;u lo&#xE0;i &#x111;&#x1ED9;ng v&#x1EAD;t &#x111;&#xE3; d&#x1EF1;a tr&#xEA;n &#x111;i&#x1EC1;u n&#xE0;y &#x111;&#x1EC3; ng&#x1EE5;y trang b&#x1EB1;ng c&#xE1;ch thay &#x111;&#x1ED5;i m&#xE0;u cho gi&#x1ED1;ng v&#x1EDB;i m&#xF4;i tr&#x1B0;&#x1EDD;ng khi&#x1EBF;n k&#x1EBB; th&#xF9; kh&#xF3; ph&#xE1;t hi&#x1EC7;n ra &#x111;&#x1B0;&#x1EE3;c.
<center>
<img src="http://nhiethuyettre.net/wp-content/uploads/2017/08/selective-s.png" alt="" width="600" height="204" class="alignnone size-medium wp-image-819"> <em>&#x110;&#xF4;i khi m&#xE0;u s&#x1EAF;c gi&#xFA;p ph&#xE2;n bi&#x1EC7;t c&#xE1;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng (m&#xE8;o) nh&#x1B0;ng &#x111;&#xF4;i khi l&#x1EA1;i kh&#xF4;ng (t&#x1EAF;c k&#xE8;).</em>
</center>
Tuy nhi&#xEA;n, m&#xE0;u s&#x1EAF;c kh&#xF4;ng ph&#x1EA3;i l&#xE0; y&#x1EBF;u t&#x1ED1; duy nh&#x1EA5;t. Ch&#x1EB3;ng h&#x1EA1;n nh&#x1B0; b&#x1EE9;c &#x1EA3;nh chi&#x1EBF;c xe hay con b&#xF2; s&#x1EEF;a - nh&#x1EEF;ng v&#x1EAD;t th&#x1EC3; mang nhi&#x1EC1;u m&#xE0;u s&#x1EAF;c - th&#xEC; con ng&#x1B0;&#x1EDD;i v&#x1EAB;n nh&#x1EAD;n ra &#x111;&#x1B0;&#x1EE3;c trong khi n&#x1EBF;u ch&#x1EC9; d&#xF9;ng m&#xE0;u s&#x1EAF;c th&#xEC; b&#xE1;nh xe v&#xE0; chi&#x1EBF;c xe ph&#x1EA3;i t&#xE1;ch r&#x1EDD;i v&#xE0; nh&#x1EEF;ng &#x111;&#x1ED1;m tr&#xEA;n con b&#xF2; s&#x1EEF;a c&#x169;ng t&#xE1;ch r&#x1EDD;i kh&#x1ECF;i con b&#xF2;. Con ng&#x1B0;&#x1EDD;i c&#xF2;n c&#xF3; kh&#x1EA3; n&#x103;ng gom nh&#xF3;m c&#xE1;c v&#xF9;ng m&#xE0;u kh&#xE1;c nhau &#x111;&#x1EC3; t&#x1ED5;ng h&#x1EE3;p n&#xEA;n h&#xEC;nh &#x1EA3;nh c&#x1EE7;a &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng. V&#x1EAD;y t&#x1EA1;i sao l&#x1EA1;i gom &#x111;&#x1ED1;m &#x111;en ch&#x1EE9; kh&#xF4;ng ph&#x1EA3;i c&#x1ECF; v&#xE0;o h&#xEC;nh &#x1EA3;nh con b&#xF2;. M&#x1ED9;t trong nh&#x1EEF;ng y&#x1EBF;u t&#x1ED1; quy&#x1EBF;t &#x111;&#x1ECB;nh &#x111;i&#x1EC1;u &#x111;&#xF3; ch&#xED;nh l&#xE0; chuy&#x1EC3;n &#x111;&#x1ED9;ng. M&#x1ED9;t <a href="https://www.ted.com/talks/pawan_sinha_on_how_brains_learn_to_see?language=vi" target="_blank">nghi&#xEA;n c&#x1EE9;u c&#x1EE7;a Pawan Sinha</a> ch&#x1EC9; ra r&#x1EB1;ng chuy&#x1EC3;n &#x111;&#x1ED9;ng g&#xF3;p ph&#x1EA7;n gi&#xFA;p con ng&#x1B0;&#x1EDD;i ph&#xE2;n bi&#x1EC7;t &#x111;&#x1B0;&#x1EE3;c c&#xE1;c v&#x1EAD;t th&#x1EC3;, hay n&#xF3;i c&#xE1;ch kh&#xE1;c l&#xE0; c&#xE1;c v&#x1EAD;t chuy&#x1EC3;n &#x111;&#x1ED9;ng c&#xF9;ng nhau th&#xEC; s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c gom v&#x1EC1; m&#x1ED9;t v&#x1EAD;t th&#x1EC3;. Th&#xED; nghi&#x1EC7;m c&#x1EE7;a Pawan Sinha cho nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i m&#x1EDB;i &#x111;&#x1B0;&#x1EE3;c ph&#x1EAB;u thu&#x1EAD;t m&#x1EAF;t quan s&#xE1;t v&#xE0; g&#x1ECD;i t&#xEA;n h&#xEC;nh d&#x1EA1;ng v&#x1EAD;t th&#x1EC3; c&#xF3; trong h&#xEC;nh. Ban &#x111;&#x1EA7;u nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i tham gia kh&#xF4;ng th&#x1EC3; nh&#x1EAD;n ra h&#xEC;nh tam gi&#xE1;c gi&#x1EEF;a nhi&#x1EC1;u v&#x1EA1;ch th&#x1EB3;ng, h&#x1ECD; c&#x1EE9; v&#x1EAB;n cho r&#x1EB1;ng &#x111;&#xF3; l&#xE0; c&#xE1;c v&#x1EA1;ch th&#x1EB3;ng &#x111;&#x1EB7;t g&#x1EA7;n nhau. Cho &#x111;&#x1EBF;n khi v&#x1EAD;t th&#x1EC3; &#x111;&#x1B0;&#x1EE3;c cho chuy&#x1EC3;n &#x111;&#x1ED9;ng, h&#x1ECD; nh&#x1EAD;n ra ngay &#x111;&#xF3; l&#xE0; h&#xEC;nh tam gi&#xE1;c.
<center>
<img src="http://nhiethuyettre.net/wp-content/uploads/2017/08/movement-segmentation.png" alt="" width="600" height="210" class="alignnone size-medium wp-image-822"> <em>h&#xEC;nh &#x1EA3;nh minh h&#x1ECD;a cho th&#xED; nghi&#x1EC7;m c&#x1EE7;a Pawan Sinha.</em>
</center>
<p>C&#xF3; th&#x1EC3; th&#x1EA5;y, nh&#x1EDD; v&#xE0;o kh&#x1EA3; n&#x103;ng ph&#xE2;n bi&#x1EC7;t m&#xE0;u s&#x1EAF;c v&#xE0; ph&#xE1;t hi&#x1EC7;n chuy&#x1EC3;n &#x111;&#x1ED9;ng, con ng&#x1B0;&#x1EDD;i c&#xF3; th&#x1EC3; t&#xE1;ch bi&#x1EC7;t c&#xE1;c v&#x1EAD;t th&#x1EC3; kh&#xE1;c nhau (segmentation) &#x111;&#x1ED3;ng th&#x1EDD;i c&#x169;ng c&#xF3; th&#x1EC3; d&#xF2; t&#xEC;m &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng (tracking) d&#x1EF1;a tr&#xEA;n kh&#x1EA3; n&#x103;ng ph&#xE1;t hi&#x1EC7;n h&#x1B0;&#x1EDB;ng chuy&#x1EC3;n &#x111;&#x1ED9;ng c&#x1EE7;a &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng v&#xE0; &#x111;&#x1B0;a m&#x1EAF;t nh&#xEC;n theo h&#x1B0;&#x1EDB;ng &#x111;&#xF3;. Ngo&#xE0;i kh&#x1EA3; n&#x103;ng ph&#xE1;t hi&#x1EC7;n &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng (detection and segmentation), con ng&#x1B0;&#x1EDD;i c&#xF2;n c&#xF3; kh&#x1EA3; n&#x103;ng nh&#x1EAD;n d&#x1EA1;ng &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng v&#xE0; g&#x1ECD;i t&#xEA;n &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng &#x111;&#xF3; (recognition and classification). Con ng&#x1B0;&#x1EDD;i l&#xE0;m &#x111;&#x1B0;&#x1EE3;c &#x111;i&#x1EC1;u n&#xE0;y l&#xE0; nh&#x1EDD; kh&#x1EA3; n&#x103;ng &#x111;&#x1ED1;i s&#xE1;nh c&#xE1;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng v&#x1EDB;i nhau. Nh&#x1EDD; kh&#x1EA3; n&#x103;ng so s&#xE1;nh n&#xE0;y m&#xE0; con ng&#x1B0;&#x1EDD;i bi&#x1EBF;t &#x111;&#x1B0;&#x1EE3;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng A gi&#x1ED1;ng v&#x1EDB;i &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng B h&#x1A1;n hay gi&#x1ED1;ng v&#x1EDB;i &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng C h&#x1A1;n v&#xE0; th&#x1EAD;m ch&#xED; c&#xF2;n bi&#x1EBF;t v&#x1EAD;t n&#xE0;y d&#xE0;i h&#x1A1;n v&#x1EAD;t kia, v&#x1EAD;t n&#xE0;y to h&#x1A1;n v&#x1EAD;t kia m&#xE0; kh&#xF4;ng c&#x1EA7;n &#x111;&#x1EBF;n m&#x1ED9;t s&#x1ED1; &#x111;o c&#x1EE5; th&#x1EC3;. Vi&#x1EC7;c &#x111;&#x1ED1;i s&#xE1;nh nh&#x1B0; v&#x1EAD;y gi&#xFA;p con ng&#x1B0;&#x1EDD;i gom nh&#xF3;m c&#xE1;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng m&#xE0; h&#x1ECD; nh&#xEC;n th&#x1EA5;y, ph&#xE2;n lo&#x1EA1;i ch&#xFA;ng v&#xE0; r&#xFA;t ra m&#x1ED9;t kh&#xE1;i ni&#x1EC7;m chung. Gi&#x1ED1;ng nh&#x1B0; c&#xE1;ch ho&#x1EA1;t &#x111;&#x1ED9;ng c&#x1EE7;a c&#x1EB7;p ph&#x1EA1;m tr&#xF9; chung-ri&#xEA;ng trong tri&#x1EBF;t h&#x1ECD;c m&#xE1;c-l&#xEA;nin, con ng&#x1B0;&#x1EDD;i l&#x1EA5;y c&#xE1;c c&#xE1; th&#x1EC3; m&#xE0; h&#x1ECD; g&#x1EB7;p l&#xE0;m nh&#x1EEF;ng c&#xE1;i ri&#xEA;ng, gom nh&#xF3;m, &#x111;&#x1ED1;i s&#xE1;nh v&#xE0; r&#xFA;t ra &#x111;&#x1B0;&#x1EE3;c kh&#xE1;i ni&#x1EC7;m chung v&#xE0; g&#x1ECD;i t&#xEA;n kh&#xE1;i ni&#x1EC7;m &#x111;&#xF3;. V&#xED; d&#x1EE5; nh&#x1B0; khi &#x111;&#x1B0;&#x1EE3;c h&#x1ECF;i l&#xE0;m sao m&#x1ED9;t ng&#x1B0;&#x1EDD;i bi&#x1EBF;t &#x111;&#xF3; l&#xE0; con voi, h&#x1ECD; th&#x1B0;&#x1EDD;ng tr&#x1EA3; l&#x1EDD;i v&#xEC; n&#xF3; c&#xF3; c&#xE1;i v&#xF2;i, th&#xE2;n m&#xEC;nh to l&#x1EDB;n, ... Nh&#x1EEF;ng l&#xFD; do h&#x1ECD; &#x111;&#x1B0;a ra th&#x1B0;&#x1EDD;ng l&#xE0; nh&#x1EEF;ng &#x111;&#x1EB7;c tr&#x1B0;ng chung c&#x1EE7;a lo&#xE0;i voi &#x111;&#x1B0;&#x1EE3;c r&#xFA;t ra t&#x1EEB; nh&#x1EEF;ng l&#x1EA7;n nh&#xEC;n th&#x1EA5;y con voi trong qu&#xE1; kh&#x1EE9; v&#xE0; t&#x1ED5;ng h&#x1EE3;p th&#xE0;nh m&#x1ED9;t kh&#xE1;i ni&#x1EC7;m tr&#x1EEB;u t&#x1B0;&#x1EE3;ng c&#x1EE7;a con voi. Tuy nhi&#xEA;n, c&#xE1;ch con ng&#x1B0;&#x1EDD;i so s&#xE1;nh v&#xE0; gom nh&#xF3;m v&#x1EAB;n l&#xE0; b&#xED; &#x1EA9;n v&#xE0; th&#x1EAD;m ch&#xED; n&#xF3; c&#xF2;n kh&#xF4;ng nh&#x1EA5;t &#x1EDF; lo&#xE0;i ng&#x1B0;&#x1EDD;i. Nh&#x1EEF;ng ng&#x1B0;&#x1EDD;i kh&#xE1;c nhau c&#xF3; th&#x1EC3; c&#xF3; c&#xE1;ch ph&#xE2;n lo&#x1EA1;i kh&#xE1;c nhau. V&#xED; d&#x1EE5; nh&#x1B0; c&#x1EA7;n gom nh&#xF3;m 3 &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng g&#x1EA5;u tr&#xFA;c, qu&#x1EA3; chu&#x1ED1;i v&#xE0; con kh&#x1EC9;. N&#x1EBF;u x&#xE9;t v&#x1EC1; quan h&#x1EC7; th&#x1EE9;c &#x103;n th&#xEC; con kh&#x1EC9; v&#xE0; qu&#x1EA3; chu&#x1ED1;i s&#x1EBD; th&#xE0;nh m&#x1ED9;t nh&#xF3;m nh&#x1B0;ng n&#x1EBF;u x&#xE9;t v&#x1EC1; ch&#x1EE7;ng lo&#x1EA1;i th&#xEC; kh&#x1EC9; v&#xE0; g&#x1EA5;u tr&#xFA;c s&#x1EBD; th&#xE0;nh m&#xF4;t nh&#xF3;m l&#xE0; &#x111;&#x1ED9;ng v&#x1EAD;t. D&#xF9; v&#x1EAD;y c&#x1ED9;ng &#x111;&#x1ED3;ng ng&#x1B0;&#x1EDD;i v&#x1EAB;n &#x111;&#x1EA1;t &#x111;&#x1B0;&#x1EE3;c s&#x1EF1; th&#x1ED1;ng nh&#x1EA5;t n&#xE0;o &#x111;&#xF3; &#x111;&#x1EC3; h&#xEC;nh th&#xE0;nh n&#xEA;n cac nh&#xF3;m kh&#xE1;i ni&#x1EC7;m nh&#x1B0; ng&#xE0;y nay. ## Tr&#xED; nh&#x1EDB; ### Ch&#xFA;ng ta h&#x1ECD;c b&#x1EB1;ng c&#xE1;ch nh&#x1EDB; Kh&#x1EA3; n&#x103;ng nh&#x1EAD;n d&#x1EA1;ng v&#x1EAD;t th&#x1EC3; kh&#xF4;ng ch&#x1EC9; d&#x1EF1;a v&#xE0;o kh&#x1EA3; n&#x103;ng ph&#xE2;n bi&#x1EC7;t v&#xE0; so s&#xE1;nh c&#xE1;c v&#x1EAD;t th&#x1EC3; v&#x1EDB;i nhau m&#xE0; c&#xF2;n d&#x1EF1;a v&#xE0;o tr&#xED; nh&#x1EDB;, so s&#xE1;nh v&#x1EDB;i c&#xE1;c v&#x1EAD;t th&#x1EC3;, s&#x1EF1; ki&#x1EC7;n &#x111;&#x1B0;&#x1EE3;c l&#x1B0;u v&#xE0;o trong n&#xE3;o. Tr&#xED; nh&#x1EDB; &#x111;&#xF3;ng vai tr&#xF2; c&#x1ED1;t l&#xF5;i cho vi&#x1EC7;c h&#x1ECD;c m&#x1ED9;t kh&#xE1;i ni&#x1EC7;m m&#x1EDB;i v&#xE0; g&#xF3;p ph&#x1EA7;n &#x111;&#x1EA3;m b&#x1EA3;o cho s&#x1EF1; sinh t&#x1ED3;n. V&#xED; d&#x1EE5; nh&#x1B0; ch&#xFA;ng ta nghe th&#x1EA5;y m&#x1ED9;t ti&#x1EBF;ng g&#x1EA7;m v&#xE0; m&#x1ED9;t con h&#x1ED5; xu&#x1EA5;t hi&#x1EC7;n t&#x1EA5;n c&#xF4;ng ta; n&#x1EBF;u ta may m&#x1EAF;n ch&#x1EA1;y tho&#xE1;t th&#xEC; l&#x1EA7;n sau ngay khi nghe th&#x1EA5;y ti&#x1EBF;ng g&#x1EA7;m m&#x1ED9;t l&#x1EA7;n n&#x1EEF;a ta s&#x1EBD; b&#x1ECF; ch&#x1EA1;y ngay m&#xE0; kh&#xF4;ng c&#x1EA7;n ch&#x1EDD; con h&#x1ED5; xu&#x1EA5;t hi&#x1EC7;n. &#x110;&#xF3; ch&#xED;nh l&#xE0; ta &#x111;&#xE3; h&#x1ECD;c &#x111;&#x1EC3; sinh t&#x1ED3;n. Vi&#x1EC7;c ghi nh&#x1EDB; ch&#xED;nh l&#xE0; s&#x1EF1; l&#x1B0;u l&#x1EA1;i nh&#x1EEF;ng &#x1EA5;n t&#x1B0;&#x1EE3;ng c&#x1EE7;a ta v&#x1EC1; s&#x1EF1; v&#x1EAD;t, s&#x1EF1; vi&#x1EC7;c trong nh&#x1EEF;ng l&#x1EA7;n &#x111;&#x1EA7;u ti&#x1EBF;p x&#xFA;c v&#xE0; d&#xF9;ng n&#xF3; &#x111;&#x1EC3; &#x111;o&#xE1;n &#x111;&#x1ECB;nh c&#xE1;c s&#x1EF1; v&#x1EAD;t, hi&#x1EC7;n t&#x1B0;&#x1EE3;ng m&#x1EDB;i. Gi&#x1ED1;ng nh&#x1B0; m&#x1ED9;t &#x111;&#x1EE9;a b&#xE9; b&#x1ECB; ch&#xF3; c&#x1EAF;n t&#x1EEB; nh&#x1ECF; s&#x1EBD; c&#xF3; xu h&#x1B0;&#x1EDB;ng s&#x1EE3; ch&#xF3; khi l&#x1EDB;n l&#xEA;n. Tr&#xED; nh&#x1EDB; c&#x1EE7;a ch&#xFA;ng ta ho&#x1EA1;t &#x111;&#x1ED9;ng b&#x1EB1;ng c&#xE1;ch li&#xEA;n k&#x1EBF;t c&#xE1;c s&#x1EF1; v&#x1EAD;t hi&#x1EC7;n t&#x1B0;&#x1EE3;ng <a href="https://www.youtube.com/watch?v=yOgAbKJGrTA" target="_blank">(video)</a>. <a href="https://www.youtube.com/watch?v=yOgAbKJGrTA" target="_blank" rel="noopener"><img src="https://www.youtube.com/watch?v=yOgAbKJGrTA/0.jpg" alt="Memory"></a> C&#x1EE5; th&#x1EC3; h&#x1A1;n, c&#xE1;c t&#xED;n hi&#x1EC7;u t&#x1EEB; s&#x1EF1; v&#x1EAD;t hi&#x1EC7;n t&#x1B0;&#x1EE3;ng s&#x1EBD; k&#xED;ch ho&#x1EA1;t m&#x1ED9;t s&#x1ED1; n&#x1A1;-ron nh&#x1EA5;t &#x111;&#x1ECB;nh. C&#xE1;c n&#x1A1;-ron &quot;giao ti&#x1EBF;p&quot; v&#x1EDB;i nhau b&#x1EB1;ng c&#xE1;ch truy&#x1EC1;n t&#x1EA3;i c&#xE1;c xung th&#x1EA7;n kinh. Khi hai n&#x1A1;-ron c&#xF3; s&#x1EF1; &quot;giao ti&#x1EBF;p&quot; l&#x1EB7;p &#x111;i l&#x1EB7;p l&#x1EA1;i nhi&#x1EC1;u l&#x1EA7;n th&#xEC; li&#xEA;n k&#x1EBF;t gi&#x1EEF;a hai n&#x1A1;-ron &#x111;&#xF3; tr&#x1EDF; n&#xEA;n m&#x1EA1;nh h&#x1A1;n v&#xE0; khi m&#x1ED9;t n&#x1A1;-ron k&#xED;ch ho&#x1EA1;t th&#xEC; ngay l&#x1EAD;p t&#x1EE9;c c&#xF3; th&#x1EC3; k&#xED;ch ho&#x1EA1;t n&#x1A1;-ron c&#xF2;n l&#x1EA1;i. Khi &#x111;&#xF3; ch&#x1EC9; c&#x1EA7;n 1 hi&#x1EC7;n t&#x1B0;&#x1EE3;ng x&#x1EA3;y ra v&#xE0; ta c&#xF3; th&#x1EC3; ngay l&#x1EAD;p t&#x1EE9;c nh&#x1EDB; l&#x1EA1;i (recall) s&#x1EF1; v&#x1EAD;t hi&#x1EC7;n t&#x1B0;&#x1EE3;ng g&#x1EAF;n li&#x1EC1;n v&#x1EDB;i n&#xF3;. &#x110;&#xE2;y c&#x169;ng ch&#xED;nh l&#xE0; c&#xE1;ch ch&#xFA;ng ta h&#x1ECD;c. Ch&#xFA;ng ta h&#x1ECD;c c&#xE1;ch ch&#x1EA1;y kh&#x1ECF;i con h&#x1ED5; khi nghe ti&#x1EBF;ng g&#x1EA7;m l&#xE0; v&#xEC; ta &#x111;&#xE3; h&#xEC;nh th&#xE0;nh m&#x1ED9;t li&#xEA;n k&#x1EBF;t m&#x1EA1;nh m&#x1EBD; trong h&#x1EC7; th&#x1EA7;n kinh t&#x1EEB; nh&#x1EEF;ng l&#x1EA7;n nghe ti&#x1EBF;ng g&#x1EA7;m v&#xE0; con h&#x1ED5; trong qu&#xE1; kh&#x1EE9;. Ta c&#x169;ng h&#x1ECD;c c&#xE1;ch g&#x1ECD;i t&#xEA;n v&#x1EAD;t th&#x1EC3; d&#x1EF1;a tr&#xEA;n li&#xEA;n k&#x1EBF;t gi&#x1EEF;a t&#xED;n hi&#x1EC7;u &#xE2;m thanh (t&#xEA;n v&#x1EAD;t th&#x1EC3;) v&#xE0; t&#xED;n hi&#x1EC7;u h&#xEC;nh &#x1EA3;nh c&#x1EE7;a v&#x1EAD;t th&#x1EC3;. V&#xED; d&#x1EE5; nh&#x1B0; khi nghe t&#x1EEB; &quot;con voi&quot; c&#xE1;c t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh th&#xED;nh gi&#xE1;c k&#xED;ch ho&#x1EA1;t v&#xE0; &#x111;&#x1ED3;ng th&#x1EDD;i c&#x169;ng k&#xED;ch ho&#x1EA1;t c&#xE1;c t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh th&#x1ECB; gi&#xE1;c li&#xEA;n k&#x1EBF;t m&#x1EA1;nh m&#x1EBD; v&#x1EDB;i t&#x1EEB; &quot;con voi&quot; v&#xE0; cho ta g&#x1EE3;i nh&#x1EDB; v&#x1EC1; h&#xEC;nh &#x1EA3;nh con voi. Hay ng&#x1B0;&#x1EE3;c l&#x1EA1;i khi th&#x1EA5;y con voi, s&#x1EF1; k&#xED;ch ho&#x1EA1;t trong c&#xE1;c t&#x1EBF; b&#xE0;o th&#x1ECB; gi&#xE1;c c&#x169;ng l&#xE0;m cho c&#xE1;c t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh x&#x1EED; l&#xFD; ng&#xF4;n ng&#x1EEF; c&#x169;ng &#x111;&#x1B0;&#x1EE3;c k&#xED;ch ho&#x1EA1;t v&#xE0; cho ta kh&#x1EA3; n&#x103;ng n&#xF3;i t&#x1EEB; &quot;con voi&quot;. S&#x1EF1; k&#x1EBF;t h&#x1EE3;p gi&#x1EEF;a tr&#xED; nh&#x1EDB; v&#xE0; kh&#x1EA3; n&#x103;ng ph&#xE2;n bi&#x1EC7;t-gom nh&#xF3;m gi&#xFA;p ch&#xFA;ng ta nh&#x1EAD;n d&#x1EA1;ng v&#xE0; giao ti&#x1EBF;p. Ch&#xFA;ng ta c&#xF3; th&#x1EC3; nh&#x1EAD;n ra s&#x1EF1; kh&#xE1;c bi&#x1EC7;t v&#xE0; gi&#x1ED1;ng nhau gi&#x1EEF;a c&#xE1;c s&#x1EF1; v&#x1EAD;t hi&#x1EC7;n t&#x1B0;&#x1EE3;ng, gom nh&#xF3;m ch&#xFA;ng l&#x1EA1;i theo t&#x1EEB;ng c&#x1EA5;p &#x111;&#x1ED9; v&#xE0; &#x111;&#x1EB7;t cho ch&#xFA;ng m&#x1ED9;t t&#xEA;n g&#x1ECD;i. Qua giao ti&#x1EBF;p h&#xE0;ng ng&#xE0;y, ch&#xFA;ng ta d&#x1EA1;y cho nhau m&#x1ED1;i li&#xEA;n k&#x1EBF;t gi&#x1EEF;a t&#xEA;n g&#x1ECD;i v&#xE0; kh&#xE1;i ni&#x1EC7;m n&#xF3; nh&#x1B0; khi ta d&#x1EA1;y m&#x1ED9;t &#x111;&#x1EE9;a tr&#x1EBB; g&#x1ECD;i ba khi nh&#xEC; th&#x1EA5;y ba n&#xF3;. Trong su&#x1ED1;t qu&#xE3;ng &#x111;&#x1EDD;i ph&#xE1;t tri&#x1EC3;n, n&#xE3;o b&#x1ED9; kh&#xF4;ng ng&#x1EEB;ng ti&#x1EBF;p thu nh&#x1EEF;ng t&#xED;n hi&#x1EC7;u t&#x1EEB; c&#xE1;c gi&#xE1;c quan m&#x1ED9;t c&#xE1;ch li&#xEA;n t&#x1EE5;c v&#xE0; k&#x1EBF;t n&#x1ED1;i ch&#xFA;ng l&#x1EA1;i v&#x1EDB;i nhau. Nh&#x1EDD; &#x111;&#xF3; ch&#xFA;ng ta nh&#x1EAD;n th&#x1EE9;c &#x111;&#x1B0;&#x1EE3;c m&#x1ED1;i quan h&#x1EC7; gi&#x1EEF;a c&#xE1;c v&#x1EAD;t th&#x1EC3; v&#xE0; t&#xED;ch l&#x169;y kinh nghi&#x1EC7;m. T&#x1EEB; nh&#x1EEF;ng th&#x1EE9;c t&#xED;ch l&#x169;y &#x111;&#x1B0;&#x1EE3;c &#x111;&#xF3;, ta d&#x1EC5; d&#xE0;ng t&#xE1;i x&#xE2;y d&#x1EF1;ng l&#x1EA1;i m&#x1ED1;i quan h&#x1EC7; gi&#x1EEF;a c&#xE1;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng (vd nh&#x1B0; t&#xEA;n g&#x1ECD;i v&#xE0; v&#x1EAD;t th&#x1EC3;, s&#x1EF1; xu&#x1EA5;t hi&#x1EC7;n &#x111;i k&#xE8;m nh&#x1B0; con h&#x1ED5; v&#xE0; ti&#x1EBF;ng g&#x1EA7;m) v&#xE0; &#x111;&#x1B0;a ra nh&#x1EEF;ng ph&#x1EA3;n h&#x1ED3;i ph&#xF9; h&#x1EE3;p. ### S&#x1EF1; t&#x1EAD;p trung N&#x1EBF;u c&#xE1;c b&#x1EA1;n &#x111;&#xE3; xem qua video &#x1EDF; tr&#xEA;n th&#xEC; s&#x1EBD; th&#x1EA5;y m&#x1ED9;t chi ti&#x1EBF;t r&#x1EB1;ng s&#x1EF1; t&#x1EAD;p trung &#x1EA3;nh h&#x1B0;&#x1EDF;ng &#x111;&#x1EBF;n t&#xED;nh hi&#x1EC7;u qu&#x1EA3; c&#x1EE7;a vi&#x1EC7;c ghi nh&#x1EDB;. Ch&#xFA;ng ta s&#x1EBD; nh&#x1EDB; r&#xF5; h&#x1A1;n v&#xE0; l&#xE2;u h&#x1A1;n khi ch&#xFA; ta t&#x1EAD;p trung v&#xE0;o s&#x1EF1; v&#x1EAD;t hi&#x1EC7;n t&#x1B0;&#x1EE3;ng. S&#x1EF1; t&#x1EAD;p trung gi&#x1ED1;ng nh&#x1B0; m&#x1ED9;t s&#x1EF1; s&#xE0;ng l&#x1ECD;c th&#xF4;ng tin, l&#x1EA5;y nh&#x1EEF;ng th&#xF4;ng tin ta quan t&#xE2;m v&#xE0; l&#x1B0;&#x1EE3;t b&#x1ECF; nh&#x1EEF;ng th&#xF4;ng tin ta &#xED;t quan t&#xE2;m. M&#x1ED9;t <a href="https://www.ted.com/talks/mehdi_ordikhani_seyedlar_what_happens_in_your_brain_when_you_pay_attention" target="_blank">nghi&#xEA;n c&#x1EE9;u c&#x1EE7;a Mehdi Ordikhani-Seyedlar</a> v&#x1EC1; s&#x1EF1; t&#x1EAD;p trung cho th&#x1EA5;y r&#x1EB1;ng khi ch&#xFA;ng ta t&#x1EAD;p trung v&#xE0;o m&#x1ED9;t s&#x1EF1; v&#x1EAD;t hi&#x1EC7;n t&#x1B0;&#x1EE3;ng th&#xEC; th&#xF4;ng tin t&#x1EEB; s&#x1EF1; v&#x1EAD;t hi&#x1EC7;n t&#x1B0;&#x1EE3;ng k&#xED;ch ho&#x1EA1;t c&#xE1;c t&#xED;n hi&#x1EC7;u th&#x1EA7;n kinh m&#x1EA1;nh h&#x1A1;n khi ta kh&#xF4;ng t&#x1EAD;p trung. Nh&#x1B0; khi ta t&#x1EAD;p trung v&#xE0;o h&#xEC;nh &#x1EA3;nh con voi th&#xEC; nh&#x1EEF;ng th&#xF4;ng tin t&#x1EEB; con voi s&#x1EBD; d&#x1EC5; d&#xE0;ng k&#xED;ch ho&#x1EA1;t c&#xE1;c t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh m&#x1ED9;t c&#xE1;ch m&#x1EA1;nh m&#x1EBD; v&#xE0; t&#xED;n hi&#x1EC7;u c&#xF3; th&#x1EC3; truy&#x1EC1;n s&#xE2;u v&#xE0;o trong n&#xE3;o. Nh&#x1B0;ng khi ta kh&#xF4;ng t&#x1EAD;p trung, t&#xED;n hi&#x1EC7;u s&#x1EBD; tr&#x1EDF; n&#xEA;n y&#x1EBF;u &#x1EDB;t v&#xE0; c&#xF3; th&#x1EC3; b&#x1ECB; m&#x1EA5;t trong qu&#xE1; tr&#xEC;nh lan truy&#x1EC1;n. &#x110;i&#x1EC1;u n&#xE0;y khi&#x1EBF;n ta kh&#xF4;ng th&#x1EC3; nh&#x1EDB; &#x111;&#x1B0;&#x1EE3;c nh&#x1EEF;ng chi ti&#x1EBF;t n&#x1EBF;u ch&#xFA;ng ta kh&#xF4;ng t&#x1EAD;p trung v&#xE0;o &#x111;&#xF3;. V&#xED; d&#x1EE5; nh&#x1B0; khi ta &#x111;ang h&#x103;ng say theo d&#xF5;i m&#x1ED9;t tr&#x1EAD;n &#x111;&#x1EA5;u b&#xF3;ng &#x111;&#xE1; th&#xEC; ta c&#xF3; th&#x1EC3; s&#x1EBD; kh&#xF4;ng &#x111;&#x1EC3; &#xFD; th&#x1EA5;y c&#xF3; ng&#x1B0;&#x1EDD;i &#x111;&#x1EBF;n ng&#x1ED3;i b&#xEA;n c&#x1EA1;nh. N&#xE3;o trong m&#x1ED9;t th&#x1EDD;i &#x111;i&#x1EC3;m nh&#x1EAD;n v&#x1EC1; r&#x1EA5;t nhi&#x1EC1;u t&#xED;n hi&#x1EC7;u t&#x1EEB; c&#xE1;c gi&#xE1;c quan (th&#x1ECB; gi&#xE1;c, th&#xED;nh gi&#xE1;c, x&#xFA;c gi&#xE1;c,... v&#xE0; c&#x1EA3; c&#xE1;c t&#xED;n hi&#x1EC7;u &#x111;i&#x1EC1;u khi&#x1EC3;n t&#x1EEB; c&#xE1;c c&#x1A1; quan n&#x1ED9;i t&#x1EA1;ng) n&#xEA;n r&#x1EA5;t kh&#xF3; &#x111;&#x1EC3; x&#x1EED; l&#xFD; &#x111;&#x1ED3;ng th&#x1EDD;i m&#x1ED9;t l&#x1B0;&#x1EE3;ng l&#x1EDB;n t&#xED;n hi&#x1EC7;u nh&#x1B0; v&#x1EAD;y. S&#x1EF1; t&#x1EAD;p trung s&#x1EBD; ch&#x1EAF;c l&#x1ECD;c t&#xED;n hi&#x1EC7;u quan tr&#x1ECD;ng &#x111;&#x1EC3; n&#xE3;o &#x1B0;u ti&#xEA;n x&#x1EED; l&#xFD;. Do v&#x1EAD;y m&#xE0; khi ta b&#x1ECB; &#x111;au ch&#xE2;n th&#xEC; ta th&#x1B0;&#x1EDD;ng c&#xF3; xu h&#x1B0;&#x1EDB;ng ch&#x1EC9; t&#x1EAD;p trung v&#xE0;o c&#x1A1;n &#x111;au v&#xE0; kh&#xF3; t&#x1EAD;p trung v&#xE0;o vi&#x1EC7;c kh&#xE1;c v&#xEC; t&#xED;n hi&#x1EC7;u c&#x1A1;n &#x111;au t&#x1EEB; ch&#xE2;n &#x111;&#x1EE7; m&#x1EA1;nh &#x111;&#x1EC3; tranh gi&#xE0;nh s&#x1EF1; t&#x1EAD;p trung c&#x1EE7;a n&#xE3;o b&#x1ED9;. Nh&#x1B0;ng n&#x1EBF;u b&#x1EB1;ng c&#xE1;ch n&#xE0;o &#x111;&#xF3; ta t&#x1EAD;p trung v&#xE0;o m&#x1ED9;t vi&#x1EC7;c kh&#xE1;c, ta c&#xF3; th&#x1EC3; qu&#xEA;n &#x111;i c&#x1A1; &#x111;au. ## Tr&#xED; tu&#x1EC7; nh&#x1EAD;n t&#x1EA1;o &#x111;&#xE3; ti&#x1EBF;n g&#x1EA7;n &#x111;&#x1EBF;n m&#x1EE9;c n&#xE0;o Trong nhi&#x1EC1;u n&#x103;m qua, c&#xF3; r&#x1EA5;t nhi&#x1EC1;u ph&#x1B0;&#x1A1;ng ph&#xE1;p ti&#x1EBF;p c&#x1EAD;n c&#xE1;c b&#xE0;i to&#xE1;n kh&#xE1;c nhau trong l&#x129;nh v&#x1EF1;c Tr&#xED; Tu&#x1EC7; Nh&#xE2;n t&#x1EA1;o &#x111;&#x1EC3; c&#x1ED1; g&#x1EAF;ng d&#x1EA1;y cho m&#xE1;y t&#xED;nh c&#xF3; th&#x1EC3; l&#xE0;m &#x111;&#x1B0;&#x1EE3;c nh&#x1EEF;ng &#x111;i&#x1EC1;u nh&#x1B0; con ng&#x1B0;&#x1EDD;i l&#xE0;m. Trong nh&#x1EEF;ng n&#x103;m g&#x1EA7;n &#x111;&#xE2;y, c&#xE1;c ph&#x1B0;&#x1A1;ng ph&#xE1;p v&#x1EC1; Deep Learning &#x111;&#x1B0;&#x1EE3;c &#xE1;p d&#x1EE5;ng r&#x1ED9;ng r&#xE3;i do kh&#x1EA3; n&#x103;ng h&#x1ECD;c s&#xE2;u t&#x1EEB; d&#x1EEF; li&#x1EC7;u trong c&#xE1;c b&#xE0;i to&#xE1;n kh&#xE1;c nhau. C&#xF3; th&#x1EC3; n&#xF3;i Deep Learning gi&#x1ED1;ng nh&#x1B0; m&#x1ED9;t ph&#x1B0;&#x1A1;ng ph&#xE1;p m&#xF4; ph&#x1ECF;ng l&#x1EA1;i c&#xE1;ch con ng&#x1B0;&#x1EDD;i nh&#x1EAD;n th&#x1EE9;c th&#x1EBF; gi&#x1EDB;i. V&#x1EAD;y ch&#xFA;ng ta &#x111;&#xE3; ti&#x1EBF;n g&#x1EA7;n &#x111;&#x1EBF;n m&#x1EE9;c n&#xE0;o? T&#x1EEB; nh&#x1EEF;ng giai &#x111;o&#x1EA1;n &#x111;&#x1EA7;u ti&#xEA;n khi con ng&#x1B0;&#x1EDD;i b&#x1EAF;t &#x111;&#x1EA7;u m&#xF4; ph&#x1ECF;ng l&#x1EA1;i t&#x1EBF; b&#xE0;o th&#x1EA7;n kinh cho b&#xE0;i to&#xE1;n ph&#xE2;n l&#x1EDB;p nh&#x1ECB; ph&#xE2;n. M&#x1ED9;t m&#xF4; h&#xEC;nh &#x111;&#x1A1;n gi&#x1EA3;n &#x111;&#x1B0;&#x1EE3;c cho ra &#x111;&#x1EDD;i v&#x1EDB;i nhi&#x1EC1;u &#x111;&#x1EA7;u v&#xE0;o t&#x1B0;&#x1A1;ng t&#x1EF1; nh&#x1B0; c&#xE1;c s&#x1EE3;i nh&#xE1;nh v&#xE0; m&#x1ED9;t &#x111;&#x1EA7;u ra t&#x1B0;&#x1A1;ng t&#x1EF1; nh&#x1B0; s&#x1EE3;i tr&#x1EE5;c. C&#xE1;c gi&#xE1; tr&#x1ECB; &#x111;i v&#xE0;o m&#xF4; h&#xEC;nh v&#xE0; s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c k&#xED;ch ho&#x1EA1;t th&#xF4;ng qua m&#x1ED9;t h&#xE0;m k&#xED;ch ho&#x1EA1;t v&#xE0; cho ra m&#x1ED9;t gi&#xE1; tr&#x1ECB; &#x111;&#x1EA7;u ra. M&#xF4; h&#xEC;nh n&#xE0;y ban &#x111;&#x1EA7;u ho&#x1EA1;t &#x111;&#x1ED9;ng kh&#xE1; t&#x1ED1;t nh&#x1B0;ng b&#x1EAF;t &#x111;&#x1EA7;u th&#x1EC3; hi&#x1EC7;n s&#x1EF1; k&#xE9;m hi&#x1EC7;u qu&#x1EA3; trong c&#xE1;c b&#xE0;i to&#xE1;n ph&#x1EE9;c t&#x1EA1;p h&#x1A1;n khi m&#xE0; d&#x1EEF; li&#x1EC7;u kh&#xF4;ng kh&#x1EA3; t&#xE1;ch tuy&#x1EBF;n t&#xED;nh. L&#xFA;c n&#xE0;y ch&#xFA;ng ta nh&#x1EAD;n ra r&#x1EB1;ng n&#xE3;o b&#x1ED9; kh&#xF4;ng ch&#x1EC9; l&#xE0; m&#x1ED9;t t&#x1EBF; b&#xE0;o &#x111;&#x1A1;n l&#x1EBB; m&#xE0; c&#xF2;n l&#xE0; m&#x1ED9;t m&#x1EA1;ng l&#x1B0;&#x1EDB;i c&#xE1;c t&#x1EBF; b&#xE0;o. V&#xEC; v&#x1EAD;y c&#xE1;c m&#xF4; h&#xEC;nh &#x111;&#x1B0;&#x1EE3;c n&#x1ED1;i v&#xE0;o nhau v&#xE0; h&#xEC;nh th&#xE0;nh n&#xEA;n m&#x1ED9;t m&#xF4; h&#xEC;nh g&#x1ECD;i l&#xE0; <a href="http://nhiethuyettre.net/mang-no-ron-nhan-tao-truyen-thang-feedforward-neural-network/" target="_blank">M&#x1EA1;ng truy&#x1EC1;n th&#x1EB3;ng &#x111;a l&#x1EDB;p</a>. Ch&#xFA;ng ta ti&#x1EBF;p t&#x1EE5;c sao ch&#xE9;p c&#xE1;c th&#x1EE9;c m&#xE0; h&#x1EC7; th&#x1EA7;n kinh th&#x1ECB; gi&#xE1;c ho&#x1EA1;t &#x111;&#x1ED9;ng. C&#xE1;c n&#x1A1;-ron kh&#xF4;ng li&#xEA;n k&#x1EBF;t &#x111;&#x1EA7;y &#x111;&#x1EE7; v&#x1EDB;i nhau v&#xE0; c&#xF3; th&#x1EC3; chia th&#xE0;nh v&#xF9;ng c&#x1EE5;c b&#x1ED9;, x&#x1EED; l&#xFD; m&#x1ED9;t ph&#x1EA7;n t&#xED;n hi&#x1EC7;u t&#x1EEB; h&#xEC;nh &#x1EA3;nh &#x111;i t&#x1EEB; m&#x1EAF;t v&#xE0;o. T&#x1EEB; &#x111;&#xF3; <a href="http://nhiethuyettre.net/mang-no-ron-tich-chap-convolutional-neural-network/" target="_blank">m&#x1EA1;ng N&#x1A1;-ron T&#xED;ch Ch&#x1EAD;p</a> ra &#x111;&#x1EDD;i v&#x1EDB;i ki&#x1EBF;n tr&#xFA;c ph&#xF9; h&#x1EE3;p cho x&#x1EED; l&#xFD; d&#x1EEF; li&#x1EC7;u h&#xEC;nh &#x1EA3;nh v&#xE0; th&#x1EF1;c s&#x1EF1; n&#xF3; &#x111;&#xE3; th&#x1EC3; hi&#x1EC7;n &#x111;&#x1B0;&#x1EE3;c t&#xED;nh hi&#x1EC7;u qu&#x1EA3; c&#x1EE7;a n&#xF3; v&#x1EDB;i nh&#x1EEF;ng ki&#x1EBF;n tr&#xFA;c &#x111;i&#x1EC3;n h&#xEC;nh nh&#x1B0; VGG16, VGG19, .... Tuy nhi&#xEA;n, ki&#x1EBF;n tr&#xFA;c n&#xE0;y l&#x1EA1;i g&#x1EB7;p v&#x1EA5;n &#x111;&#x1EC1; v&#x1EDB;i c&#xE1;c d&#x1EEF; li&#x1EC7;u d&#x1EA1;ng chu&#x1ED7;i, hay n&#xF3;i c&#xE1;ch kh&#xE1;c l&#xE0; c&#xF3; t&#xED;nh th&#x1EE9; t&#x1EF1; theo th&#x1EDD;i gian nh&#x1B0; c&#xE2;u v&#x103;n v&#xE0; video. Ch&#xFA;ng ta s&#x1ED1; trong m&#x1ED9;t th&#x1EBF; gi&#x1EDB;i c&#xF3; kh&#xE1;i ni&#x1EC7;m th&#x1EDD;i gian v&#xE0; m&#x1ED7;i kho&#x1EA3;nh kh&#x1EAF;c ch&#xFA;ng ta thu &#x111;&#x1B0;&#x1EE3;c kh&#xF4;ng &#x111;&#x1ED9;c l&#x1EAD;p nhau m&#xE0; ph&#x1EE5; thu&#x1ED9;c v&#xE0;o qu&#xE1; kh&#x1EE9; v&#xE0; c&#xF3; th&#x1EC3; d&#xF9;ng &#x111;&#x1EC3; d&#x1EF1; &#x111;o&#xE1;n t&#x1B0;&#x1A1;ng lai. T&#x1EEB; &#x111;&#xF3; ta x&#xE2;y d&#x1EF1;ng n&#xEA;n m&#xF4; h&#xEC;nh <a href="http://nhiethuyettre.net/mang-no-ron-tai-phat-recurrent-neural-network/" target="_blank">M&#x1EA1;ng n&#x1A1;-ron T&#xE1;i Ph&#xE1;t</a>. Sau s&#x1EF1; ph&#xE1;t tri&#x1EC3;n c&#x1EE7;a M&#x1EA1;ng n&#x1A1;-ron T&#xE1;i Ph&#xE1;t, ch&#xFA;ng ta b&#x1EAF;t &#x111;&#x1EA7;u t&#x1EAD;p trung v&#xE0;o vi&#x1EC7;c l&#xE0;m sao &#x111;&#x1EC3; li&#xEA;n k&#x1EBF;t c&#xE1;c lo&#x1EA1;i t&#xED;n hi&#x1EC7;u l&#x1EA1;i v&#x1EDB;i nhau, gi&#x1ED1;ng nh&#x1B0; c&#xE1;ch c&#xE1;c t&#xED;n hi&#x1EC7;u &#x111;&#x1B0;&#x1EE3;c li&#xEA;n k&#x1EBF;t khi ch&#xFA;ng ta nh&#x1EDB; v&#xE0; l&#xE0;m sao chuy&#x1EC3;n &#x111;&#x1ED5;i t&#x1EEB; t&#xED;n hi&#x1EC7;u n&#xE0;y sang t&#xED;n hi&#x1EC7;u kh&#xE1;c. C&#xE1;c m&#xF4; h&#xEC;nh cho b&#xE0;i b&#xE0;i to&#xE1;n v&#x1EC1; <a href="https://arxiv.org/abs/1406.5679" target="_blank">Embedding, Grounding Image-text</a> ra &#x111;&#x1EDD;i nh&#x1EB1;m t&#xEC;m m&#x1ED1;i li&#xEA;n k&#x1EBF;t gi&#x1EEF;a ng&#xF4;n ng&#x1EEF; v&#xE0; h&#xEC;nh &#x1EA3;nh. &#x110;&#x1ED3;ng th&#x1EDD;i c&#xE1;c m&#xF4; h&#xEC;nh <a href="https://arxiv.org/abs/1409.3215" target="_blank">Sequence to Sequence</a> c&#x169;ng &#x111;&#x1B0;&#x1EE3;c x&#xE2;y d&#x1EF1;ng cho b&#xE0;i to&#xE1;n d&#x1ECB;ch m&#xE1;y hay ph&#xE1;t sinh c&#xE2;u m&#xF4; t&#x1EA3; cho &#x1EA3;nh v&#xE0; video hay th&#x1EAD;m ch&#xED; ng&#x1B0;&#x1EE3;c l&#x1EA1;i, ph&#xE1;t sinh l&#x1EA1;i &#x1EA3;nh t&#x1EEB; c&#xE2;u m&#xF4; t&#x1EA3;. Ch&#xFA;ng ta c&#x169;ng th&#xEA;m v&#xE0;o m&#xF4; h&#xEC;nh t&#x1B0;&#x1A1;ng t&#x1EF1; v&#x1EDB;i s&#x1EF1; t&#x1EAD;p trung c&#x1EE7;a con ng&#x1B0;&#x1EDD;i - Attentional Mechanism - v&#x1EDB;i kh&#x1EA3; n&#x103;ng gi&#x1EEF; l&#x1EA1;i nh&#x1EEF;ng t&#xED;n hi&#x1EC7;u quan tr&#x1ECD;ng v&#xE0; l&#xE0;m y&#x1EBF;u &#x111;i nh&#x1EEF;ng t&#xED;n hi&#x1EC7;u kh&#xF4;ng quan tr&#x1ECD;ng. K&#x1EBF;t qu&#x1EA3; c&#x1EE7;a s&#x1EF1; k&#x1EBF;t h&#x1EE3;p m&#xF4; h&#xEC;nh Attentional Mechanism &#x111;&#xE3; cho ra nhi&#x1EC1;u k&#x1EBF;t qu&#x1EA3; &#x111;&#xE1;ng ng&#x1EA1;c nhi&#xEA;n trong b&#xE0;i to&#xE1;n ph&#xE1;t sinh c&#xE2;u m&#xF4; t&#x1EA3; cho &#x1EA3;nh <a href="https://arxiv.org/abs/1502.03044" target="_blank">(paper)</a>. Kh&#xF4;ng d&#x1EEB;ng l&#x1EA1;i &#x1EDF; &#x111;&#xF3;, ch&#xFA;ng ta c&#x169;ng b&#x1EAF;t &#x111;&#x1EA7;u th&#xEA;m v&#xE0;o b&#x1ED9; nh&#x1EDB; cho c&#xE1;c m&#xF4; h&#xEC;nh &#x111;&#x1EC3; c&#xE1;c m&#xF4; h&#xEC;nh c&#xF3; th&#x1EC3; l&#x1B0;u tr&#x1EEF; th&#xF4;ng tin l&#xE2;u d&#xE0;i h&#x1A1;n ph&#x1EE5;c v&#x1EE5; cho b&#xE0;i to&#xE1;n Question-Answering. Nh&#x1EEF;ng m&#xF4; h&#xEC;nh nh&#x1B0; <a href="https://arxiv.org/abs/1410.3916" target="_blank">Memory Network</a>, <a href="https://arxiv.org/abs/1410.5401" target="_blank">Neural Turing Machine</a> ra &#x111;&#x1EDD;i v&#x1EDB;i ki&#x1EBF;n tr&#xFA;c m&#x1EA1;ng n&#x1A1;-ron k&#x1EBF;t h&#x1EE3;p th&#xEA;m v&#xF9;ng nh&#x1EDB; l&#x1B0;u tr&#x1EEF; th&#xF4;ng tin. C&#xF3; th&#x1EC3; th&#x1EA5;y m&#x1ED9;t qu&#xE1; tr&#xEC;nh ph&#xE1;t tri&#x1EC3;n t&#x1EEB; m&#x1ED9;t t&#x1EBF; b&#xE0;o &#x111;&#x1A1;n l&#x1EBB; cho &#x111;&#x1EBF;n nh&#x1EEF;ng m&#x1ED3; h&#xEC;nh ph&#x1EE9;c t&#x1EA1;p h&#x1A1;n, cao c&#x1EA5;p h&#x1A1;n ph&#x1EE5;c v&#x1EE5; cho c&#xE1;c b&#xE0;i to&#xE1;n kh&#xE1;c nhau. Ch&#xFA;ng ta &#x111;&#xE3; ti&#x1EBF;n r&#x1EA5;t xa tr&#xEA;n con &#x111;&#x1B0;&#x1EDD;ng ph&#xE1;t tri&#x1EC3;n tr&#xED; tu&#x1EC7; nh&#x1EAD;n t&#x1EA1;o. M&#xE1;y t&#xED;nh &#x111;&#xE3; c&#xF3; th&#x1EC3; d&#x1ECB;ch t&#x1EEB; ng&#xF4;n ng&#x1EEF; n&#xE0;y sang ng&#xF4;n ng&#x1EEF; ph&#xE1;t, nh&#x1EAD;n d&#x1EA1;ng &#x111;&#x1B0;&#x1EE3;c v&#x1EAD;t th&#x1EC3;, ph&#xE1;t sinh c&#xE2;u m&#xF4; t&#x1EA3; cho &#x1EA3;nh v&#xE0; video v&#xE0; th&#x1EAD;m ch&#xED; tr&#x1EA3; l&#x1EDD;i nh&#x1EEF;ng c&#xE2;u h&#x1ECF;i t&#x1EEB; nh&#x1EEF;ng d&#x1EEF; ki&#x1EC7;n cho tr&#x1B0;&#x1EDB;c. C&#xF3; th&#x1EC3; th&#x1EA5;y s&#x1EF1; m&#xF4; ph&#x1ECF;ng c&#xE1;ch th&#x1EE9;c con ng&#x1B0;&#x1EDD;i nh&#x1EAD;n th&#x1EE9;c &#x111;&#xE3; &#x111;em l&#x1EA1;i nhi&#x1EC1;u k&#x1EBF;t qu&#x1EA3; &#x111;&#xE1;ng ng&#x1EA1;c nhi&#xEA;n. Tuy nhi&#xEA;n, tr&#xED; n&#xE3;o con ng&#x1B0;&#x1EDD;i v&#x1EAB;n c&#xF2;n r&#x1EA5;t nhi&#x1EC1;u b&#xED; &#x1EA9;n v&#xE0; ch&#xFA;ng ta ch&#x1EC9; m&#x1EDB;i kh&#xE1;m ph&#xE1; m&#x1ED9;t ph&#x1EA7;n nh&#x1ECF; trong &#x111;&#xF3;. Ch&#xFA;ng ta ch&#x1B0;a hi&#x1EC3;u h&#x1EBF;t tr&#xED; n&#xE3;o con ng&#x1B0;&#x1EDD;i n&#xEA;n ch&#x1B0;a th&#x1EC3; m&#xF4; ph&#x1ECF;ng m&#x1ED9;t c&#xE1;ch ho&#xE0;n h&#x1EA3;o. Nh&#x1EEF;ng m&#xF4; h&#xEC;nh v&#x1EAB;n c&#xF2;n nhi&#x1EC1;u h&#x1EA1;n ch&#x1EBF; v&#xE0; tr&#xED; tu&#x1EC7; nh&#xE2;n t&#x1EA1;o v&#x1EAB;n ch&#x1B0;a th&#x1EAD;t s&#x1EF1; ti&#x1EBF;n g&#x1EA7;n v&#x1EDB;i tr&#xED; th&#xF4;ng minh c&#x1EE7;a con ng&#x1B0;&#x1EDD;i. Ch&#xFA;ng ta c&#xF3; th&#x1EC3; &#x111;&#xE3; ti&#x1EBF;n r&#x1EA5;t xa, nh&#x1B0;ng ch&#x1EB7;n &#x111;&#x1B0;&#x1EDD;ng ph&#xED;a tr&#x1B0;&#x1EDB;c v&#x1EAB;n c&#xF2;n xa h&#x1A1;n.</p>
</div></div><div class="post-main post-comment"></div></article><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.css"/><script src="//cdn.bootcss.com/jquery/2.0.3/jquery.min.js"></script><script src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js"></script><script>$(document).ready(function() {
    $(".fancybox").fancybox();
});
</script></body></html>