<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"/><meta content="yes" name="apple-mobile-web-app-capable"/><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"/><meta content="telephone=no" name="format-detection"/><meta name="description"/><title>Bộ ngữ liệu WordNet | Lương Quốc An</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"/><link rel="stylesheet" type="text/css" href="/css/highlight.css"/><link rel="stylesheet" type="text/css" href="/css/font.css"/><link rel="stylesheet" type="text/css" href="/css/noise.css"/><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"/><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"/></head><body><article class="wrapper"><div class="post-main"><div class="nav"><nav class="container"><a class="sidebar-nav-item active" href="/">Home</a><a class="sidebar-nav-item" href="/archives">Archives</a></nav><div class="container post-meta"><div class="post-time">2018-07-21</div></div></div><div class="container post-header"><h1>Bộ ngữ liệu WordNet</h1></div><div class="container post-content"><a id="more"></a>
<h2 id="c&#xE1;c-m&#x1ED1;i-quan-h&#x1EC7;-tr&#xEA;n-&#xFD;-ngh&#x129;a-c&#x1EE7;a-t&#x1EEB;">C&#xE1;c m&#x1ED1;i quan h&#x1EC7; tr&#xEA;n &#xFD; ngh&#x129;a c&#x1EE7;a t&#x1EEB;</h2>
<p>T&#x1EEB; v&#x1ED1;n &#x111;&#x1B0;&#x1EE3;c h&#xEC;nh th&#xE0;nh &#x111;&#x1EC3; ch&#x1EC9; c&#xE1;c kh&#xE1;i nhi&#x1EC7;m. VD: T&#x1EEB; &quot;m&#xE8;o&quot; d&#xF9;ng &#x111;&#x1EC3; ch&#x1EC9; m&#x1ED9;t lo&#xE0;i v&#x1EAD;t c&#xF3; b&#x1ED1;n ch&#xE2;n, &#x103;n chu&#x1ED9;t, nh&#xEC;n r&#xF5; v&#x1EC1; &#x111;&#xEA;m, .... hay t&#x1EEB; &quot;chim&quot; d&#xF9;ng &#x111;&#x1EC3; ch&#x1EC9; lo&#xE0;i v&#x1EAD;t c&#xF3; l&#xF4;ng v&#x169;, bi&#x1EBF;t bay, .... Ng&#x1EEF; ngh&#x129;a kh&#xF4;ng ph&#x1EE5; thu&#x1ED9;c v&#xE0;o ng&#xF4;n ng&#x1EEF;. Ng&#x1B0;&#x1EDD;i Anh, ng&#x1B0;&#x1EDD;i M&#x1EF9;, ng&#x1B0;&#x1EDD;i Trung Qu&#x1ED1;c hay ng&#x1B0;&#x1EDD;i Vi&#x1EC7;t Nam &#x111;&#x1EC1;u c&#xF3; chung kh&#xE1;i ni&#x1EC7;m v&#x1EC1; con m&#xE8;o, ch&#x1EC9; kh&#xE1;c nhau v&#x1EC1; h&#xEC;nh th&#x1EE9;c bi&#x1EC3;u &#x111;&#x1EA1;t (vd trong ti&#x1EBF;ng Anh l&#xE0; &quot;cat&quot;, trong ti&#x1EBF;ng Vi&#x1EC7;t l&#xE0; &quot;m&#xE8;o&quot;). Nh&#x1EDD; s&#x1EF1; gi&#x1ED1;ng nhau trong kh&#xE1;i ni&#x1EC7;m m&#xE0; ta c&#xF3; th&#x1EC3; d&#x1ECB;ch t&#x1EEB; ti&#x1EBF;ng n&#xE0;y sang ti&#x1EBF;ng kh&#xE1;c. M&#x1ED9;t h&#xEC;nh th&#xE1;i c&#x1EE7;a t&#x1EEB; (word form) hay g&#x1ECD;i ng&#x1EAF;n g&#x1ECD;n l&#xE0; t&#x1EEB; c&#xF3; th&#x1EC3; c&#xF3; nhi&#x1EC1;u h&#x1A1;n m&#x1ED9;t &#xFD; ngh&#x129;a bi&#x1EC3;u &#x111;&#x1EA1;t &#x111;&#x1ED3;ng th&#x1EDD;i m&#x1ED9;t ngh&#x129;a c&#xF3; th&#x1EC3; &#x111;&#x1B0;&#x1EE3;c th&#x1EC3; hi&#x1EC7;n b&#x1EB1;ng nhi&#x1EC1;u t&#x1EEB;. Gi&#x1EEF;a c&#xE1;c t&#x1EEB; v&#x1EDB;i nhau c&#x169;ng c&#xF3; m&#x1ED1;i quan h&#x1EC7; v&#x1EC1; ng&#x1EEF; ngh&#x129;a, vd: &quot;ch&#xF3;&quot; l&#xE0; m&#x1ED9;t lo&#xE0;i &quot;&#x111;&#x1ED9;ng v&#x1EAD;t&quot;, &quot;r&#x1EC5;&quot; l&#xE0; m&#x1ED9;t b&#x1ED9; ph&#x1EAD;n c&#x1EE7;a &quot;c&#xE2;y&quot;, .... T&#x1ED5;ng h&#x1EE3;p l&#x1EA1;i, ta c&#xF3; c&#xE1;c d&#x1EA1;ng quan h&#x1EC7; sau: &#x111;&#x1ED3;ng ngh&#x129;a, tr&#xE1;i ngh&#x129;a, &#x111;&#x1ED3;ng &#xE2;m, &#x111;a ngh&#x129;a, h&#x1EA1; danh, th&#x1B0;&#x1EE3;ng danh, b&#x1ED9; ph&#x1EAD;n, bao h&#xE0;m, k&#xE9;o theo, c&#xE1;ch th&#x1EE9;c. <strong>&#x110;&#x1ED3;ng Ngh&#x129;a (Synonymy)</strong>: C&#xE1;c t&#x1EEB; c&#xF3; h&#xEC;nh th&#x1EE9;c bi&#x1EC3;u &#x111;&#x1EA1;t kh&#xE1;c nhau nh&#x1B0;ng c&#xF9;ng ch&#x1EC9; m&#x1ED9;t kh&#xE1;i ni&#x1EC7;m. V&#xED; d&#x1EE5; trong ti&#x1EBF;ng Vi&#x1EC7;t, t&#x1EEB; &quot;l&#x1EE3;n&quot; v&#xE0; t&#x1EEB; &quot;heo&quot; l&#xE0; c&#xE1;c t&#x1EEB; &#x111;&#x1ED3;ng ngh&#x129;a, trong ti&#x1EBF;ng Anh, t&#x1EEB; &quot;chance&quot; v&#xE0; t&#x1EEB; &quot;opportunity&quot; l&#xE0; c&#xE1;c t&#x1EEB; &#x111;&#x1ED3;ng ngh&#x129;a. <strong>Tr&#xE1;i Ngh&#x129;a (Antonym)</strong>: C&#xE1;c t&#x1EEB; ch&#x1EC9; c&#xE1;c kh&#xE1;i ni&#x1EC7;m tr&#xE1;i ng&#x1B0;&#x1EE3;c nhau. T&#x1EEB; &quot;White&quot; tr&#xE1;i ngh&#x129;a v&#x1EDB;i &quot;Black&quot;, &quot;X&#x1EA5;u&quot; tr&#xE1;i ngh&#x129;a v&#x1EDB;i &quot;&#x110;&#x1EB9;p&quot;, &quot;S&#x1ED1;ng&quot; tr&#xE1;i ngh&#x129;a v&#x1EDB;i &quot;Ch&#x1EBF;t&quot;. <strong>&#x110;&#x1ED3;ng &#xC2;m (Homonym)</strong>: Nh&#x1EEF;ng t&#x1EEB; c&#xF3; c&#xF9;ng c&#xE1;ch vi&#x1EBF;t (&#x111;&#x1ECD;c) nh&#x1B0;ng c&#xF3; ngh&#x129;a ho&#xE0;n to&#xE0;n kh&#xE1;c nhau. T&#x1EEB; &quot;bank&quot; c&#xF3; ngh&#x129;a l&#xE0; ng&#xE2;n h&#xE0;ng nh&#x1B0;ng c&#x169;ng c&#xF3; ngh&#x129;a l&#xE0; b&#x1EDD; s&#xF4;ng. N&#xF3;i &#x111;&#xFA;ng h&#x1A1;n l&#xE0; ta c&#xF3; 2 t&#x1EEB; &quot;bank&quot;, m&#x1ED9;t t&#x1EEB; ch&#x1EC9; ng&#xE2;n h&#xE0;ng v&#xE0; m&#x1ED9;t t&#x1EEB; ch&#x1EC9; b&#x1EDD; s&#xF4;ng v&#xE0; hai t&#x1EEB; n&#xE0;y c&#xF3; c&#xE1;ch vi&#x1EBF;t gi&#x1ED1;ng nhau. T&#x1B0;&#x1A1;ng t&#x1EF1; trong ti&#x1EBF;ng Vi&#x1EC7;t ta c&#xF3; &quot;&#x111;&#xF4;ng&quot; c&#xF3; th&#x1EC3; ch&#x1EC9; s&#x1EF1; &#x111;&#xF4;ng &#x111;&#xFA;c, nhi&#x1EC1;u ng&#x1B0;&#x1EDD;i ho&#x1EB7;c ch&#x1EC9; h&#x1B0;&#x1EDB;ng &#x111;&#xF4;ng, ho&#x1EB7;c ch&#x1EC9; m&#xF9;a &#x111;&#xF4;ng. <strong>&#x110;a Ngh&#x129;a (Polysemy)</strong>: C&#xE1;c t&#x1EEB; gi&#x1ED1;ng nhau v&#x1EC1; c&#xE1;ch vi&#x1EBF;t (&#x111;&#x1ECD;c) v&#xE0; ngh&#x129;a c&#xF3; m&#x1ED1;i li&#xEA;n h&#x1EC7; v&#x1EDB;i nhau. V&#xED; d&#x1EE5; trong c&#xE2;y &quot;I work in a company&quot; th&#xEC; &quot;company&quot; ch&#x1EC9; c&#xF4;ng ty c&#xF2;n trong c&#xE2;u &quot;The company sends me an email&quot; th&#xEC; &quot;company&quot; &#xE1;m ch&#x1EC9; ban &#x111;i&#x1EC1;u h&#xE0;nh c&#xF4;ng ty (trong c&#xE2;u n&#xE0;y kh&#xF4;ng th&#x1EC3; l&#xE0; c&#xF4;ng ty v&#xE0; v&#x1EAD;t v&#xF4; tri kh&#xF4;ng th&#x1EC3; g&#x1EED;i email). Ta th&#x1EA5;y c&#xF3; s&#x1EF1; g&#x1EA7;n g&#x169;i gi&#x1EEF;a ngh&#x129;a c&#xF4;ng ty v&#xE0; ban &#x111;i&#x1EC1;u h&#xE0;nh c&#xF4;ng ty. <strong>H&#x1EA1; Danh (Hyponymy)</strong>: T&#x1EEB; X l&#xE0; h&#x1EA1; danh c&#x1EE7;a t&#x1EEB; Y n&#x1EBF;u X l&#xE0; m&#x1ED9;t t&#x1EAD;p con c&#x1EE7;a Y. V&#xED; d&#x1EE5;: t&#x1EA5;t c&#x1EA3; c&#xE1;c con m&#xE8;o &#x111;&#x1EC1;u l&#xE0; &#x111;&#x1ED9;ng v&#x1EAD;t, hay &quot;m&#xE8;o&quot; l&#xE0; t&#x1EAD;p con c&#x1EE7;a t&#x1EAD;p &quot;&#x111;&#x1ED9;ng v&#x1EAD;t&quot; n&#xEA;n &quot;m&#xE8;o&quot; l&#xE0; h&#x1EA1; danh c&#x1EE7;a &quot;&#x111;&#x1ED9;ng v&#x1EAD;t&quot;. <strong>Th&#x1B0;&#x1EE3;ng Danh (Hypernym)</strong>: n&#x1EBF;u X l&#xE0; h&#x1EA1; danh c&#x1EE7;a Y th&#xEC; Y ch&#xED;nh l&#xE0; th&#x1B0;&#x1EE3;ng danh c&#x1EE7;a X. &quot;&#x111;&#x1ED9;ng v&#x1EAD;t&quot; l&#xE0; th&#x1B0;&#x1EE3;ng danh c&#x1EE7;a &quot;m&#xE8;o&quot;, &quot;th&#x1EF1;c v&#x1EAD;t&quot; l&#xE0; th&#x1B0;&#x1EE3;ng danh c&#x1EE7;a &quot;c&#xE2;y xo&#xE0;i&quot;, .... <strong>B&#x1ED9; Ph&#x1EAD;n (Meronymy)</strong>: X l&#xE0; b&#x1ED9; ph&#x1EAD;n c&#x1EE7;a Y c&#xF3; ngh&#x129;a l&#xE0; Y bao g&#x1ED3;m c&#x1EA3; X. V&#xED; d&#x1EE5;: &quot;c&#xE2;y&quot; g&#x1ED3;m r&#x1EC5;, th&#xE2;n, l&#xE1; th&#xEC; &quot;r&#x1EC5;&quot;, &quot;th&#xE2;n&quot;, &quot;l&#xE1;&quot; ch&#xED;nh l&#xE0; b&#x1ED9; ph&#x1EAD;n c&#x1EE7;a &quot;c&#xE2;y&quot;; &quot;b&#xE1;nh xe&quot; l&#xE0; b&#x1ED9; ph&#x1EAD;n c&#x1EE7;a &quot;chi&#x1EBF;c xe&quot;. <strong>Bao H&#xE0;m (Holonym)</strong> X l&#xE0; b&#x1ED9; ph&#x1EAD;n c&#x1EE7;a Y th&#xEC; Y ch&#xED;nh l&#xE0; bao h&#xE0;m c&#x1EE7;a X. &quot;c&#xE2;y&quot; bao h&#xE0;m &quot;r&#x1EC5;&quot;, &quot;th&#xE2;n&quot;, &quot;l&#xE1;&quot;; &quot;chi&#x1EBF;c xe&quot; bao h&#xE0;m &quot;b&#xE1;nh xe&quot;. <strong>K&#xE9;o Theo (Entailment)</strong>: H&#xE0;nh &#x111;&#x1ED9;ng X x&#x1EA3;y ra ngh&#x129;a l&#xE0; h&#xE0;nh &#x111;&#x1ED9;ng Y x&#x1EA3;y ra, hay &#x111;&#x1EC3; x&#x1EA3;y ra X th&#xEC; ph&#x1EA3;i x&#x1EA3;y ra Y. V&#xED; d&#x1EE5;: &quot;ng&#xE1;y&quot; l&#xE0; m&#x1ED9;t k&#xE9;o theo c&#x1EE7;a &quot;ng&#x1EE7;&quot;. <strong>C&#xE1;ch Th&#x1EE9;c (Troponym)</strong>: H&#xE0;nh &#x111;&#x1ED9;ng X l&#xE0; m&#x1ED9;t c&#xE1;ch th&#x1EE9;c x&#x1EA3;y ra c&#x1EE7;a Y. V&#xED; d&#x1EE5; &quot;n&#xF3;i nh&#x1ECF;&quot;, &quot;th&#xEC; th&#x1EA7;m&quot; l&#xE0; m&#x1ED9;t ph&#x1B0;&#x1A1;ng th&#x1EE9;c c&#x1EE7;a &quot;n&#xF3;i&quot; hay &quot;&#x111;i kh&#x1EAD;p khi&#x1EC5;ng&quot; l&#xE0; m&#x1ED9;t ph&#x1B0;&#x1A1;ng th&#x1EE9;c c&#x1EE7;a &quot;&#x111;i&quot;.</p>
<h2 id="m&#x1EA1;ng-ng&#x1EEF;-ngh&#x129;a-wordnet">M&#x1EA1;ng ng&#x1EEF; ngh&#x129;a WordNet</h2>
<p>Ch&#xFA;ng ta nh&#x1EAD;n th&#x1EA5;y r&#x1EB1;ng quan h&#x1EC7; v&#x1EC1; ng&#x1EEF; ngh&#x129;a chia l&#xE0;m hai lo&#x1EA1;i ch&#xED;nh l&#xE0; quan h&#x1EC7; th&#x1EE9; t&#x1EF1; v&#xE0; quan h&#x1EC7; t&#x1B0;&#x1A1;ng &#x111;&#x1B0;&#x1A1;ng. C&#xE1;c t&#x1EEB; &#x111;&#x1ED3;ng ngh&#x129;a, tr&#xE1;i ngh&#x129;a, &#x111;&#x1ED3;ng &#xE2;m, &#x111;a ngh&#x129;a l&#xE0; c&#xE1;c t&#x1EEB; c&#xF3; m&#x1ED1;i quan h&#x1EC7; t&#x1B0;&#x1A1;ng &#x111;&#x1B0;&#x1A1;ng hay quan h&#x1EC7; ngang h&#xE0;ng. T&#x1EEB; A &#x111;&#x1ED3;ng ngh&#x129;a v&#x1EDB;i t&#x1EEB; B th&#xEC; ng&#x1B0;&#x1EE3;c l&#xE0;i t&#x1EEB; B c&#x169;ng &#x111;&#x1ED3;ng ngh&#x129;a v&#x1EDB;i t&#x1EEB; A, t&#x1B0;&#x1A1;ng t&#x1EF1; cho tr&#xE1;i ngh&#x129;a, &#x111;&#x1ED3;ng &#xE2;m, .... C&#xE1;c quan h&#x1EC7; c&#xF2;n l&#x1EA1;i l&#xE0; c&#xE1;c quan h&#x1EC7; th&#x1EE9; t&#x1EF1; v&#xE0; ph&#xE2;n th&#xE0;nh c&#xE1;c c&#x1EB7;p nh&#x1B0; t&#x1EEB; A l&#xE0; <em>th&#x1B0;&#x1EE3;ng danh</em> c&#x1EE7;a t&#x1EEB; B th&#xEC; t&#x1EEB; B s&#x1EBD; l&#xE0; <em>h&#x1EA1; danh</em> c&#x1EE7;a t&#x1EEB; A. Quan h&#x1EC7; th&#x1EE9; t&#x1EF1; n&#xE0;y c&#xF2;n c&#xF3; t&#xED;nh ch&#x1EA5;t b&#x1EAF;t c&#x1EA7;u, n&#x1EBF;u C l&#xE0; h&#x1EA1; danh c&#x1EE7;a B, B l&#xE0; h&#x1EA1; danh c&#x1EE7;a A th&#xEC; C c&#x169;ng l&#xE0; h&#x1EA1; danh c&#x1EE7;a A. V&#xED; d&#x1EE5;: s&#x1EEF;a l&#xE0; m&#x1ED9;t lo&#x1EA1;i &#x111;&#x1ED3; u&#x1ED1;ng, &#x111;&#x1ED3; u&#x1ED1;ng l&#xE0; m&#x1ED9;t lo&#x1EA1;i ch&#x1EA5;t l&#x1ECF;ng th&#xEC; s&#x1EEF;a l&#xE0; m&#x1ED9;t lo&#x1EA1;i ch&#x1EA5;t l&#x1ECF;ng. N&#x1EBF;u ta bi&#x1EC3;u di&#x1EC5;n c&#xE1;c ng&#x1EEF; ngh&#x129;a c&#x1EE7;a t&#x1EEB; th&#xE0;nh m&#x1ED9;t n&#xFA;t v&#xE0; c&#xE1;c quan h&#x1EC7; gi&#x1EEF;a ch&#xFA;ng l&#xE0; c&#xE1;c cung th&#xEC; ta s&#x1EBD; c&#xF3; m&#x1ED9;t m&#x1EA1;ng ng&#x1EEF; ngh&#x129;a v&#x1EDB;i c&#xE1;c t&#x1EEB; c&#xF3; quan h&#x1EC7; t&#x1B0;&#x1A1;ng &#x111;&#x1B0;&#x1A1;ng th&#xEC; s&#x1EBD; n&#x1EB1;m trong m&#x1ED9;t l&#x1EDB;p v&#xE0; c&#xE1;c l&#x1EDB;p n&#xE0;y n&#x1ED1;i v&#x1EDB;i nhau th&#xE0;nh t&#x1EEB;ng t&#x1EA7;ng d&#x1EF1;a theo quan h&#x1EC7; th&#x1EE9; t&#x1EF1;. &#x110;&#xF3; ch&#xED;nh l&#xE0; m&#x1EA1;ng ng&#x1EEF; ngh&#x129;a WordNet. <img src="http://nhiethuyettre.net/wp-content/uploads/2017/02/wordnet-sample-300x163.png" alt="" width="600" height="326" class="alignnone size-medium wp-image-557"> M&#x1EA1;ng ng&#x1EEF; ngh&#x129;a WordNet l&#xE0; m&#x1ED9;t b&#x1ED9; d&#x1EEF; li&#x1EC7;u ng&#x1EEF; ngh&#x129;a &#x1EDF; m&#x1EE9;c t&#x1EEB; v&#x1EF1;ng, th&#x1EC3; hi&#x1EC7;n quan h&#x1EC7; v&#x1EC1; ngh&#x129;a gi&#x1EEF;a c&#xE1;c t&#x1EEB; v&#x1EDB;i nhau. WordNet bao g&#x1ED3;m 3 b&#x1ED9; d&#x1EEF; li&#x1EC7;u ri&#xEA;ng bi&#x1EC7;t, m&#x1ED9;t b&#x1ED9; c&#x1EE7;a danh t&#x1EEB;, m&#x1ED9;t b&#x1ED9; c&#x1EE7;a &#x111;&#x1ED9;ng t&#x1EEB;, m&#x1ED9;t b&#x1ED9; c&#x1EE7;a t&#xED;nh t&#x1EEB; v&#xE0; tr&#x1EA1;ng t&#x1EEB;. T&#xED;nh &#x111;&#x1EBF;n phi&#xEA;n b&#x1EA3;n 3.0, b&#x1ED9; d&#x1EEF; li&#x1EC7;u WordNet d&#xE0;nh cho ti&#x1EBF;ng anh &#x111;&#xE3; c&#xF3; kho&#x1EA3;ng 117000 danh t&#x1EEB;, 11400 &#x111;&#x1ED9;ng t&#x1EEB;, 22000 t&#xED;nh t&#x1EEB; v&#xE0; 4600 tr&#x1EA1;ng t&#x1EEB;. M&#x1EA1;ng WordNet &#x111;&#x1B0;&#x1EE3;c t&#x1ED5; ch&#x1EE9;c theo m&#xF4; h&#xEC;nh c&#xE2;y nh&#x1B0; m&#xF4; t&#x1EA3; &#x1EDF; tr&#xEA;n, m&#x1ED7;i node ch&#x1EE9;a m&#x1ED9;t t&#x1EEB; nguy&#xEA;n m&#x1EAB;u (lemma) c&#xF9;ng v&#x1EDB;i t&#x1EAD;p c&#xE1;c t&#x1EEB; &#x111;&#x1ED3;ng ngh&#x129;a v&#x1EDB;i n&#xF3; (synset). M&#x1EA1;ng WordNet ch&#x1EC9; th&#x1EC3; hi&#x1EC7;n quan h&#x1EC7; v&#x1EC1; ng&#x1EEF; ngh&#x129;a ch&#x1EE9; kh&#xF4;ng th&#x1EC3; hi&#x1EC7;n quan h&#x1EC7; v&#x1EC1; ng&#x1EEF; &#xE2;m hay h&#xEC;nh th&#xE1;i. Trong c&#xE1;c ng&#xF4;n ng&#x1EEF; bi&#x1EBF;n c&#xE1;ch nh&#x1B0; ti&#x1EBF;ng Anh, m&#x1ED9;t t&#x1EEB; c&#xF3; nhi&#x1EC1;u bi&#x1EBF;n th&#x1EC3; theo th&#xEC; (tense), s&#x1ED1; l&#x1B0;&#x1EE3;ng (plural) nh&#x1B0; &quot;eats&quot;, &quot;mice&quot;, &quot;teeth&quot;, .... X&#xE9;t v&#x1EC1; m&#x1EB7;t ng&#x1EEF; ngh&#x129;a th&#xEC; c&#xE1;c t&#x1EEB; n&#xE0;y v&#xE0; c&#xE1;c t&#x1EEB; nguy&#xEA;n m&#x1EAB;u t&#x1B0;&#x1A1;ng &#x1EE9;ng c&#x1EE7;a ch&#xFA;ng n&#xF3;i &#x111;&#x1EBF;n c&#xF9;ng m&#x1ED9;t kh&#xE1;i ni&#x1EC7;m n&#xEA;n trong b&#x1ED9; d&#x1EEF; li&#x1EC7;u WordNet th&#xEC; c&#xE1;c t&#x1EEB; bi&#x1EBF;n c&#xE1;ch &#x111;&#x1B0;&#x1EE3;c g&#x1ED9;p chung v&#xE0;o t&#x1EEB; nguy&#xEA;n m&#x1EAB;u c&#x1EE7;a ch&#xFA;ng v&#xE0; c&#xF9;ng n&#x1EB1;m trong m&#x1ED9;t node. Hi&#x1EC7;n t&#x1EA1;i WordNet kh&#xF4;ng ch&#x1EC9; c&#xF3; b&#x1ED9; d&#x1EEF; li&#x1EC7;u d&#xE0;nh cho ti&#x1EBF;ng Anh m&#xE0; c&#xF2;n c&#xF3; b&#x1ED9; d&#x1EEF; li&#x1EC7;u d&#xE0;nh cho c&#xE1;c th&#x1EE9; ti&#x1EBF;ng kh&#xE1;c nh&#x1B0; ti&#x1EBF;ng Ph&#xE1;p, ti&#x1EBF;ng Trung Qu&#x1ED1;c,... v&#xE0; c&#xF3; c&#x1EA3; b&#x1ED9; d&#x1EEF; li&#x1EC7;u WordNet c&#x1EE7;a ti&#x1EBF;ng Vi&#x1EC7;t.</p>
<h2 id="m&#x1ED9;t-s&#x1ED1;-&#x1EE9;ng-d&#x1EE5;ng-c&#x1EE7;a-b&#x1ED9;-ng&#x1EEF;-li&#x1EC7;u-wordnet">M&#x1ED9;t s&#x1ED1; &#x1EE9;ng d&#x1EE5;ng c&#x1EE7;a b&#x1ED9; ng&#x1EEF; li&#x1EC7;u WordNet</h2>
<h3 id="&#x111;o-kho&#x1EA3;ng-c&#xE1;ch-v&#x1EC1;-ng&#x1EEF;-ngh&#x129;a-c&#x1EE7;a-c&#xE1;c-t&#x1EEB;">&#x110;o kho&#x1EA3;ng c&#xE1;ch v&#x1EC1; ng&#x1EEF; ngh&#x129;a c&#x1EE7;a c&#xE1;c t&#x1EEB;</h3>
<p>Ta c&#xF3; th&#x1EC3; d&#xF9;ng WordNet nh&#x1B0; m&#x1ED9;t &#x111;&#x1ED9; &#x111;o kho&#x1EA3;ng c&#xE1;ch v&#x1EC1; ng&#x1EEF; ngh&#x129;a c&#x1EE7;a c&#xE1;c t&#x1EEB;. Kho&#x1EA3;ng c&#xE1;ch gi&#x1EEF;a c&#xE1;c t&#x1EEB; s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c &#x111;o b&#x1EB1;ng &#x111;&#x1ED9; d&#xE0;i &#x111;&#x1B0;&#x1EDD;ng &#x111;i ng&#x1EAF;n nh&#x1EA5;t trong trong m&#x1EA1;ng WordNet. V&#xED; d&#x1EE5;: Ta c&#xF3; &quot;cat&quot;, &quot;dog&quot; l&#xE0; h&#x1EA1; danh tr&#x1EF1;c ti&#x1EBF;p c&#x1EE7;a &quot;animal&quot;. Nh&#x1B0; v&#x1EAD;y kho&#x1EA3;ng c&#xE1;ch gi&#x1EEF;a &quot;cat&quot; v&#xE0; &quot;animal&quot; l&#xE0; 1 c&#xF2;n kho&#x1EA3;ng c&#xE1;ch t&#x1EEB; &quot;cat&quot; &#x111;&#x1EBF;n &quot;dog&quot; l&#xE0; 2 (cat -&gt; animal -&gt; dog). C&#xE1;c t&#x1EEB; &#x111;&#x1ED3;ng ngh&#x129;a trong WordNet s&#x1EBD; c&#xF3; kho&#x1EA3;ng c&#xE1;ch l&#xE0; 0. Vi&#x1EC7;c x&#xE2;y d&#x1EF1;ng &#x111;&#x1ED9; &#x111;o nh&#x1B0; v&#x1EAD;y c&#xF3; &#xFD; ngh&#x129;a quan tr&#x1ECD;ng trong b&#xE0;i to&#xE1;n t&#xEC;m t&#x1EEB; thay th&#x1EBF; trong v&#x103;n b&#x1EA3;n. V&#xED; d&#x1EE5; cho c&#xE2;u &quot;I have a cat&quot; v&#xE0; c&#x1EA7;n thay t&#x1EEB; &quot;cat&quot; th&#xE0;nh t&#x1EEB; kh&#xE1;c sao cho ngh&#x129;a &#xED;t bi&#x1EBF;n &#x111;&#x1ED5;i nh&#x1EA5;t. Theo &#x111;&#x1ED9; &#x111;o c&#x1EE7;a WordNet th&#xEC; ta th&#x1EA5;y vi&#x1EC7;c thay &quot;cat&quot; th&#xE0;nh &quot;animal&quot; s&#x1EBD; ph&#xF9; h&#x1EE3;p h&#x1A1;n &quot;dog&quot; v&#xEC; &#x111;&#x1ED9; &#x111;o gi&#x1EEF;a &quot;cat&quot; v&#xE0; &quot;animal&quot; ng&#x1EAF;n h&#x1A1;n. Th&#x1EF1;c t&#x1EBF; &#x111;&#xE3; ki&#x1EC3;m nghi&#x1EC7;m &#x111;i&#x1EC1;u &#x111;&#xF3;, r&#xF5; r&#xE0;ng l&#xE0; c&#xE2;u &quot;I have an animal&quot; g&#x1EA7;n ngh&#x129;a v&#x1EDB;i c&#xE2;u &quot;I have a cat&quot; h&#x1A1;n l&#xE0; c&#xE2;u &quot;I have a dog&quot;.</p>
<h3 id="ki&#x1EC3;m-tra-r&#xE0;ng-bu&#x1ED9;c-v&#x1EC1;-ngh&#x129;a-trong-c&#xE2;u">Ki&#x1EC3;m tra r&#xE0;ng bu&#x1ED9;c v&#x1EC1; ngh&#x129;a trong c&#xE2;u</h3>
<p>Ch&#xFA;ng ta &#x111;&#xE3; bi&#x1EBF;t <a href="http://nhiethuyettre.me/khoa-hoc/phan-tich-cu-phap-van-pham-grammar-parse/" target="_blank">ph&#xE2;n t&#xED;ch c&#xFA; ph&#xE1;p v&#x103;n ph&#x1EA1;m</a> cho ta c&#x1EA5;u tr&#xFA;c c&#xFA; ph&#xE1;p c&#x1EE7;a c&#xE2;u. Tuy nhi&#xEA;n ph&#xE2;n t&#xED;ch v&#x103;n ph&#x1EA1;m ch&#x1EC9; c&#xF3; th&#x1EC3; ki&#x1EC3;m tra t&#xED;nh &#x111;&#xFA;ng v&#x1EC1; v&#x103;n ph&#x1EA1;m ch&#x1EE9; kh&#xF4;ng ki&#x1EC3;m tra t&#xED;nh &#x111;&#xFA;ng v&#x1EC1; ng&#x1EEF; ngh&#x129;a. X&#xE9;t c&#xE2;u &quot;the table eats the chicken&quot;, n&#x1EBF;u &#x111;em c&#xE2;u n&#xE0;y &#x111;i ph&#xE2;n t&#xED;ch th&#xEC; ta nh&#x1EAD;n th&#x1EA5;y c&#xE2;u n&#xE0;y ho&#xE0;n to&#xE0;n &#x111;&#xFA;ng v&#x1EC1; ng&#x1EEF; ph&#xE1;p (&quot;the table&quot; l&#xE0; NP &#x111;&#xF3;ng vai tr&#xF2; ch&#x1EE7; ng&#x1EEF;, &quot;eats&quot; l&#xE0; V, &quot;the chicken&quot; l&#xE0; NP &#x111;&#xF3;ng vai tr&#xF2; b&#x1ED5; ngh&#x129;a cho V). Tuy nhi&#xEA;n r&#xF5; r&#xE0;ng l&#xE0; c&#xE1;i b&#xE0;n (table) kh&#xF4;ng th&#x1EC3; &quot;&#x103;n&quot; &#x111;&#x1B0;&#x1EE3;c con g&#xE0; (chicken), thay v&#xE0;o &#x111;&#xF3; n&#x1EBF;u &#x111;&#x1ED5;i th&#xE0;nh &quot;the dog eats the chicken&quot; th&#xEC; s&#x1EBD; h&#x1EE3;p l&#xFD; h&#x1A1;n. V&#x1EAD;y l&#xE0;m sao bi&#x1EBF;t &#x111;&#x1B0;&#x1EE3;c &quot;table&quot; hay &quot;dog&quot; c&#xF3; th&#x1EC3; &quot;eats the chicken&quot;? - B&#x1EB1;ng c&#xE1;ch s&#x1EED; d&#x1EE5;ng quan h&#x1EC7; h&#x1EA1; danh-th&#x1B0;&#x1EE3;ng danh trong WordNet. Gi&#x1EA3; s&#x1EED; ra c&#xF3; m&#x1ED9;t heuristic l&#xE0; ch&#x1EC9; c&#xF3; &quot;animal&quot; m&#x1EDB;i c&#xF3; th&#x1EC3; th&#x1EF1;c hi&#x1EC7;n &#x111;&#x1ED9;ng t&#x1EEB; &quot;eat&quot; (t&#x1EE9;c l&#xE0; ch&#x1EC9; c&#xF3; &#x111;&#x1ED9;ng v&#x1EAD;t m&#x1EDB;i c&#xF3; th&#x1EC3; &#x103;n). Nh&#x1B0; v&#x1EAD;y, &#x111;&#x1EC3; ki&#x1EC3;m tra m&#x1ED9;t v&#x1EAD;t c&#xF3; bi&#x1EBF;t &#x103;n hay kh&#xF4;ng ta s&#x1EBD; ki&#x1EC3;m tra xem n&#xF3; c&#xF3; ph&#x1EA3;i &quot;animal&quot; hay kh&#xF4;ng b&#x1EB1;ng c&#xE1;ch duy&#x1EC7;t c&#xE1;c th&#x1B0;&#x1EE3;ng danh c&#x1EE7;a n&#xF3;. B&#x1EB1;ng c&#xE1;ch duy&#x1EC7;t ng&#x1B0;&#x1EE3;c v&#x1EC1; c&#xE1;c th&#x1B0;&#x1EE3;ng danh, ta d&#x1EC5; d&#xE0;ng ki&#x1EC3;m tra &#x111;&#x1B0;&#x1EE3;c l&#xE0; &quot;dog&quot; c&#xF3; th&#x1EC3; th&#x1EF1;c hi&#x1EC7;n h&#xE0;nh &#x111;&#x1ED9;ng &quot;eat&quot; c&#xF2;n &quot;table&quot; th&#xEC; kh&#xF4;ng th&#x1EC3;. T&#x1B0;&#x1A1;ng t&#x1EF1;, ta c&#xF3; th&#x1EC3; th&#xEA;m c&#xE1;c r&#xE0;ng bu&#x1ED9;c v&#x1EC1; ng&#x1EEF; ngh&#x129;a &#x111;&#x1EC3; ki&#x1EC3;m tra t&#xED;nh &#x111;&#xFA;ng &#x111;&#x1EAF;n v&#x1EC1; ng&#x1EEF; ngh&#x129;a trong c&#xE2;u.</p>
<h2 id="truy-c&#x1EAD;p-wordnet-v&#x1EDB;i-th&#x1B0;-vi&#x1EC7;n-nltk-trong-python">Truy c&#x1EAD;p WordNet v&#x1EDB;i th&#x1B0; vi&#x1EC7;n nltk trong Python</h2>
<p>Th&#x1B0; vi&#x1EC7;n nltk c&#x1EE7;a Python cung c&#x1EA5;p c&#xE1;c ph&#x1B0;&#x1A1;ng th&#x1EE9;c &#x111;&#x1EC3; truy c&#x1EAD;p v&#xE0;o b&#x1ED9; d&#x1EEF; li&#x1EC7;u WordNet ti&#x1EBF;ng Anh m&#x1ED9;t c&#xE1;ch &#x111;&#x1A1;n gi&#x1EA3;n v&#xE0; hi&#x1EC7;u qu&#x1EA3;. &#x110;&#x1EC3; s&#x1EED; d&#x1EE5;ng b&#x1ED9; d&#x1EEF; li&#x1EC7;u WordNet trong nltk, ta c&#x1EA7;n import th&#x1B0; vi&#x1EC7;n nh&#x1B0; sau: <code>&gt;&gt;&gt; from nltk.corpus import wordnet as wn</code> <strong>truy c&#x1EAD;p synset</strong> WordNet cung c&#x1EA5;p ph&#x1B0;&#x1A1;ng th&#x1EE9;c truy c&#x1EAD;p synset c&#x1EE7;a m&#x1ED9;t t&#x1EEB; cho tr&#x1B0;&#x1EDB;c: <code>&gt;&gt;&gt; wn.synsets(&apos;cat&apos;) out: [Synset(&apos;cat.n.01&apos;), Synset(&apos;guy.n.01&apos;), Synset(&apos;cat.n.03&apos;), Synset(&apos;kat.n.01&apos;), Synset(&apos;cat-o&apos;-nine-tails.n.01&apos;), Synset(&apos;caterpillar.n.02&apos;), Synset(&apos;big_cat.n.01&apos;), Synset(&apos;computerized_tomography.n.01&apos;), Synset(&apos;cat.v.01&apos;), Synset(&apos;vomit.v.01&apos;)]</code> <strong>t&#xEC;m ki&#x1EBF;m th&#x1B0;&#x1EE3;ng danh</strong> &#x110;&#x1EC3; ki&#x1EC3;m tra th&#x1B0;&#x1EE3;ng danh c&#x1EE7;a m&#x1ED9;t t&#x1EEB;, ta c&#xF3; th&#x1EC3; l&#xE0;m nh&#x1B0; sau: <code>&gt;&gt;&gt; wn.synset(&apos;cat.n.01&apos;).hypernyms() out: [Synset(&apos;feline.n.01&apos;)]</code> K&#x1EBF;t qu&#x1EA3; n&#xE0;y th&#x1EC3; hi&#x1EC7;n th&#x1B0;&#x1EE3;ng danh tr&#x1EF1;c ti&#x1EBF;p c&#x1EE7;a &quot;cat&quot; l&#xE0; &quot;feline&quot;. Ta c&#x169;ng c&#xF3; th&#x1EC3; duy&#x1EC7;t c&#xE2;y th&#x1B0;&#x1EE3;ng danh nh&#x1B0; sau: <code>&gt;&gt;&gt; wn.synset(&apos;cat.n.01&apos;).hypernym_paths() out: [[Synset(&apos;entity.n.01&apos;), Synset(&apos;physical_entity.n.01&apos;), Synset(&apos;object.n.01&apos;), Synset(&apos;whole.n.02&apos;), Synset(&apos;living_thing.n.01&apos;), Synset(&apos;organism.n.01&apos;), Synset(&apos;animal.n.01&apos;), Synset(&apos;chordate.n.01&apos;), Synset(&apos;vertebrate.n.01&apos;), Synset(&apos;mammal.n.01&apos;), Synset(&apos;placental.n.01&apos;), Synset(&apos;carnivore.n.01&apos;), Synset(&apos;feline.n.01&apos;), Synset(&apos;cat.n.01&apos;)]]</code> Danh s&#xE1;ch k&#x1EBF;t qu&#x1EA3; ch&#xED;nh l&#xE0; c&#xE1;c th&#x1B0;&#x1EE3;ng danh c&#x1EE7;a &quot;cat&quot; &#x111;&#x1B0;&#x1EE3;c x&#x1EBF;p theo th&#x1EE9; t&#x1EF1; v&#x1EDB;i node b&#x1EAF;t &#x111;&#x1EA7;u l&#xE0; &quot;entity&quot; (th&#x1EF1;c th&#x1EC3;). Node n&#xE0;y ch&#xED;nh l&#xE0; m&#x1ED9;t trong nh&#x1EEF;ng node g&#x1ED1;c trong m&#x1EA1;ng wordnet, h&#x1EA7;u h&#x1EBF;t m&#x1ECD;i th&#x1EE9; &#x111;&#x1EC1;u b&#x1EAF;t ngu&#x1ED3;n t&#x1EEB; node n&#xE0;y v&#xEC; &quot;th&#x1EF1;c th&#x1EC3;&quot; l&#xE0; t&#x1EEB; &#xE1;m ch&#x1EC9; chung cho c&#xE1;c kh&#xE1;i ni&#x1EC7;m v&#x1EAD;t ch&#x1EA5;t. Ta c&#x169;ng th&#x1EA5;y trong chu&#x1ED7;i c&#xE1;c th&#x1B0;&#x1EE3;ng danh c&#x1EE7;a &quot;cat&quot; c&#xF3; th&#x1EC3; t&#xEC;m th&#x1EA5;y &quot;animal&quot; v&#xE0; nh&#x1B0; trong &#x111;&#xE3; &#x111;&#x1EC1; c&#x1EAD;p trong b&#xE0;i to&#xE1;n ki&#x1EC3;m tra r&#xE0;ng bu&#x1ED9;c ng&#x1EEF; ngh&#x129;a th&#xEC; ta c&#xF3; th&#x1EC3; d&#xF9;ng c&#xE1;ch n&#xE0;y &#x111;&#x1EC3; x&#xE1;c &#x111;&#x1ECB;nh &quot;cat&quot; c&#xF3; th&#x1EC3; th&#x1EF1;c hi&#x1EC7;n h&#xE0;nh &#x111;&#x1ED9;ng &quot;eat&quot; hay kh&#xF4;ng. <strong>M&#x1ED9;t s&#x1ED1; quan h&#x1EC7; kh&#xE1;c trong WordNet</strong> Quan h&#x1EC7; b&#x1ED9; ph&#x1EAD;n, bao h&#xE0;m c&#x169;ng &#x111;&#x1B0;&#x1EE3;c th&#x1EC3; hi&#x1EC7;n trong WordNet: <code>&gt;&gt;&gt; wn.synset(&apos;tree.n.01&apos;).part_meronyms() out: [Synset(&apos;burl.n.02&apos;), Synset(&apos;crown.n.07&apos;), Synset(&apos;limb.n.02&apos;), Synset(&apos;stump.n.01&apos;), Synset(&apos;trunk.n.01&apos;)]</code> <code>&gt;&gt;&gt; wn.synset(&apos;animal.n.01&apos;).part_meronyms() out: [Synset(&apos;face.n.07&apos;), Synset(&apos;head.n.01&apos;)] </code> <strong>&#x110;&#x1ED9; &#x111;o b&#x1EB1;ng WordNet</strong> <code>&gt;&gt;&gt; wn.synset(&apos;dog.n.01&apos;).path_similarity(wn.synset(&apos;cat.n.01&apos;)) out: 0.2</code> <code>&gt;&gt;&gt; wn.synset(&apos;cat.n.01&apos;).path_similarity(wn.synset(&apos;feline.n.01&apos;)) out: 0.5</code> K&#x1EBF;t qu&#x1EA3; tr&#xEA;n th&#x1EC3; hi&#x1EC7;n &quot;cat&quot; v&#xE0; &quot;feline&quot; g&#x1EA7;n ngh&#x129;a h&#x1A1;n so v&#x1EDB;i &quot;cat&quot; v&#xE0; &quot;dog&quot;.</p>
<p><em>B&#xE0;i vi&#x1EBF;t tham kh&#x1EA3;o t&#x1EEB; c&#xE1;c ngu&#x1ED3;n:</em> <a href="http://www.nltk.org/howto/wordnet.html" target="_blank">http://www.nltk.org/howto/wordnet.html</a> <a href="http://www.nltk.org/book/ch02.html" target="_blank">Ch&#x1B0;&#x1A1;ng 2, cu&#x1ED1;n s&#xE1;ch Natural Language Processing with Python</a> cu&#x1ED1;n s&#xE1;ch Speech and Language Processing An Introduction to Natural Language Processing Computational Linguistics and Speech Recognition]]&gt;</p>
<p>B&#xE0;i vi&#x1EBF;t tham kh&#x1EA3;o t&#x1EEB; c&#xE1;c ngu&#x1ED3;n</p>
<p><a href="https://en.wikipedia.org/wiki/Oja%27s_rule" target="_blank">https://en.wikipedia.org/wiki/Oja%27s_rule</a></p>
<p><a href="https://en.wikipedia.org/wiki/Generalized_Hebbian_Algorithm" target="_blank">https://en.wikipedia.org/wiki/Generalized_Hebbian_Algorithm</a></p>
</div></div><div class="post-main post-comment"></div></article><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.css"/><script src="//cdn.bootcss.com/jquery/2.0.3/jquery.min.js"></script><script src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js"></script><script>$(document).ready(function() {
    $(".fancybox").fancybox();
});
</script></body></html>