<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"/><meta content="yes" name="apple-mobile-web-app-capable"/><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"/><meta content="telephone=no" name="format-detection"/><meta name="description"/><title>Phân tích thành phần phụ thuộc | Lương Quốc An</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"/><link rel="stylesheet" type="text/css" href="/css/highlight.css"/><link rel="stylesheet" type="text/css" href="/css/font.css"/><link rel="stylesheet" type="text/css" href="/css/noise.css"/><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"/><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"/></head><body><article class="wrapper"><div class="post-main"><div class="nav"><nav class="container"><a class="sidebar-nav-item active" href="/">Home</a><a class="sidebar-nav-item" href="/archives">Archives</a></nav><div class="container post-meta"><div class="post-time">2019-03-08</div></div></div><div class="container post-header"><h1>Phân tích thành phần phụ thuộc</h1></div><div class="container post-content"><a id="more"></a>
<h2 id="t&#xED;nh-ph&#x1EE5;-thu&#x1ED9;c-trong-ng&#xF4;n-ng&#x1EEF;">T&#xED;nh ph&#x1EE5; thu&#x1ED9;c trong ng&#xF4;n ng&#x1EEF;</h2>
<p>C&#xE1;c kh&#xE1;i ni&#x1EC7;m trong m&#x1ED9;t c&#xE2;u th&#x1B0;&#x1EDD;ng mang t&#xED;nh ph&#x1EE5; thu&#x1ED9;c v&#xE0; b&#x1ED5; tr&#x1EE3; l&#x1EAB;n nhau. V&#xED; d&#x1EE5; nh&#x1B0; t&#xED;nh t&#x1EEB; b&#x1ED5; ngh&#x129;a cho danh t&#x1EEB;, tr&#x1EA1;ng t&#x1EEB; b&#x1ED5; ngh&#x129;a cho &#x111;&#x1ED9;ng t&#x1EEB;, tr&#x1EA1;ng t&#x1EEB; c&#x169;ng c&#xF3; th&#x1EC3; b&#x1ED5; ngh&#x129;a cho t&#xED;nh t&#x1EEB;, .... Nh&#x1EEF;ng th&#xE0;nh ph&#x1EA7;n n&#xE0;y t&#x1EA1;o n&#xEA;n m&#x1EE9;c &#x111;&#x1ED9; chi ti&#x1EBF;t cho c&#xE2;u v&#xE0; gi&#xFA;p x&#xE1;c &#x111;&#x1ECB;nh ch&#xED;nh x&#xE1;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng, tr&#xE1;nh nh&#x1EAD;p nh&#x1EB1;n. V&#xED; d&#x1EE5; cho c&#xE2;u:</p>
<p align="center">
S = &quot;A(<strong>Det</strong>) brown(<strong>Adj</strong>) dog(<strong>N</strong>) rapidly(<strong>Adv</strong>) chases(<strong>V</strong>) a(<strong>N</strong>) small(<strong>adj</strong>) black(<strong>adj</strong>) cat(<strong>V</strong>).&quot;
</p>
<p>Trong c&#xE2;u tr&#xEA;n c&#xF3; nhi&#x1EC1;u t&#xED;nh t&#x1EEB; m&#xF4; t&#x1EA3; nh&#x1B0; &quot;brown&quot;, &quot;small&quot;, &quot;black&quot; b&#x1ED5; sung th&#xF4;ng tin th&#xEA;m cho c&#xE1;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng &quot;dog&quot;, &quot;cat&quot;. Tr&#x1EA1;ng t&#x1EEB; &quot;rapidly&quot; b&#x1ED5; sung th&#xEA;m th&#xF4;ng tin cho h&#xE0;nh &#x111;&#x1ED9;ng &quot;chases&quot;. C&#xE1;c &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng &quot;dog&quot;, &quot;cat&quot; c&#x169;ng b&#x1ED5; sung th&#xF4;ng tin cho h&#xE0;nh &#x111;&#x1ED9;ng &quot;chases&quot;, l&#xE0;m r&#xF5; ngh&#x129;a &#x111;&#xE2;u l&#xE0; &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng th&#x1EF1;c hi&#x1EC7;n h&#xE0;nh &#x111;&#x1ED9;ng v&#xE0; &#x111;&#xE2;u l&#xE0; &#x111;&#x1ED1;i t&#x1B0;&#x1EE3;ng b&#x1ECB; t&#xE1;c &#x111;&#x1ED9;ng. C&#xF3; th&#x1EC3; th&#x1EA5;y t&#xED;nh ph&#x1EE5; thu&#x1ED9;c trong c&#xE2;u mang t&#xED;nh ph&#xE2;n t&#x1EA7;ng, t&#x1EEB; n&#xE0;y b&#x1ED5; ngh&#x129;a cho t&#x1EEB; kh&#xE1;c v&#xE0; t&#x1EEB; kh&#xE1;c b&#x1ED5; ngh&#x129;a cho t&#x1EEB; kh&#xE1;c n&#x1EEF;a &#x111;&#x1EC3; h&#x1EE3;p th&#xE0;nh th&#xF4;ng tin chung c&#x1EE7;a c&#x1EA3; c&#xE2;u.</p>
<h3 id="bi&#x1EC3;u-di&#x1EC5;n-th&#xE0;nh-ph&#x1EA7;n-ph&#x1EE5;-thu&#x1ED9;c">Bi&#x1EC3;u di&#x1EC5;n th&#xE0;nh ph&#x1EA7;n ph&#x1EE5; thu&#x1ED9;c</h3>
<p>D&#x1EF1;a tr&#xEA;n t&#xED;nh ch&#x1EA5;t ph&#xE2;n t&#x1EA7;ng nh&#x1B0; v&#x1EAD;y, ta th&#x1EA5;y c&#x1EA5;u tr&#xFA;c c&#xE2;y l&#xE0; c&#x1EA5;u tr&#xFA;c ph&#xF9; h&#x1EE3;p cho bi&#x1EC3;u di&#x1EC5;n t&#xED;nh ph&#x1EE5; thu&#x1ED9;c trong m&#x1ED9;t c&#xE2;u. C&#xE2;y ph&#x1EE5; thu&#x1ED9;c c&#x1EE7;a m&#x1ED9;t c&#xE2;u th&#x1EC3; hi&#x1EC7;n m&#x1ED1;i quan h&#x1EC7; b&#x1ED5; ngh&#x129;a trong c&#xE2;u &#x111;&#xF3;, c&#xE1;c n&#xFA;t con b&#x1ED5; sung th&#xF4;ng tin cho n&#xFA;t cha. V&#xED; d&#x1EE5; c&#xE2;y ph&#x1EE5; thu&#x1ED9;c c&#x1EE7;a c&#xE2;u &quot;A brown dog rapidly chases a small black cat.&quot; nh&#x1B0; sau:</p>
<p align="center">
<img src="/images/dependency_tree.png" alt="dependency tree" width="600">
</p>
<p>T&#x1EEB; v&#xED; d&#x1EE5; tr&#xEA;n, ta c&#xF3; th&#x1EC3; th&#x1EA5;y &#x111;&#x1EB7;c t&#xED;nh c&#x1EE7;a c&#xE2;y ph&#x1EE5; thu&#x1ED9;c nh&#x1B0; sau:</p>
<ul>
<li>C&#xE2;y ph&#x1EE5; thu&#x1ED9;c b&#x1EAF;t &#x111;&#x1EA7;u t&#x1EEB; m&#x1ED9;t n&#xFA;t &#x111;&#x1EB7;c bi&#x1EC7;t ROOT l&#xE0;m n&#xFA;t g&#x1ED1;c</li>
<li>M&#x1ED7;i th&#xE0;nh ph&#x1EA7;n ch&#x1EC9; c&#xF3; duy nh&#x1EA5;t m&#x1ED9;t n&#xFA;t cha, hay n&#xF3;i c&#xE1;ch kh&#xE1;c m&#x1ED7;i th&#xE0;nh ph&#x1EA7;n ch&#x1EC9; b&#x1ED5; ngh&#x129;a cho m&#x1ED9;t th&#xE0;nh ph&#x1EA7;n kh&#xE1;c nh&#x1B0;ng m&#x1ED9;t th&#xE0;nh ph&#x1EA7;n c&#xF3; th&#x1EC3; &#x111;&#x1B0;&#x1EE3;c nhi&#x1EC1;u th&#xE0;nh ph&#x1EA7;n kh&#xE1;c b&#x1ED5; ngh&#x129;a cho n&#xF3;</li>
<li>L&#xE0; m&#x1ED9;t &#x111;&#x1ED3; th&#x1ECB; c&#xF3; h&#x1B0;&#x1EDB;ng kh&#xF4;ng chu tr&#xEC;nh (&#x111;&#x1EB7;c t&#xED;nh n&#xE0;y kh&#xE1; r&#xF5; r&#xE0;ng do c&#x1EA5;u tr&#xFA;c c&#xE2;y nh&#x1B0;ng quan tr&#x1ECD;ng n&#x1EBF;u bi&#x1EC3;u di&#x1EC5;n c&#xE2;y nh&#x1B0; m&#x1ED9;t &#x111;&#x1ED3; th&#x1ECB;)</li>
<li>C&#xE1;c quan h&#x1EC7; ph&#x1EE5; thu&#x1ED9;c kh&#xF4;ng &#x111;&#x1B0;&#x1EE3;c c&#x1EAF;t nhau (non-crossing).</li>
</ul>
<p>&#x110;&#x1EB7;c bi&#x1EC7;t, t&#xED;nh ch&#x1EA5;t kh&#xF4;ng &#x111;&#x1B0;&#x1EE3;c c&#x1EAF;t nhau kh&#xE1; quan tr&#x1ECD;ng. T&#xED;nh ch&#x1EA5;t n&#xE0;y l&#xE0; do &#x111;&#x1EB7;c &#x111;i&#x1EC3;m c&#x1EE7;a ng&#xF4;n ng&#x1EEF; l&#xE0; c&#xE1;c th&#xE0;nh ph&#x1EA7;n ph&#x1EE5; thu&#x1ED9;c th&#x1B0;&#x1EDD;ng &#x111;&#x1EE9;ng g&#x1EA7;n nhau v&#xE0; t&#x1EA1;o th&#xE0;nh m&#x1ED9;t c&#x1EE5;m &#x111;&#x1EA7;y &#x111;&#x1EE7; ng&#x1EEF; ngh&#x129;a. Vi&#x1EC7;c xu&#x1EA5;t hi&#x1EC7;n &quot;crossing&quot; t&#x1EE9;c l&#xE0; m&#x1ED9;t c&#x1EE5;m li&#xEA;n t&#x1EE5;c b&#x1ECB; chen v&#xE0;o m&#x1ED9;t th&#xE0;nh ph&#x1EA7;n kh&#xF4;ng li&#xEA;n quan &#x111;&#x1EBF;n c&#x1EE5;m &#x111;&#xF3;. V&#xED; d&#x1EE5; v&#x1EDB;i hai c&#xE2;y ph&#x1EE5; thu&#x1ED9;c thu g&#x1ECD;n sau &#x111;&#xE2;y:</p>
<p align="center">
<img src="/images/non-crossing-dependency.png" alt="dependency tree" width="600">
</p>
<p>&#x1EDE; &#x111;&#xE2;y, &quot;a small black cat&quot; l&#xE0; m&#x1ED9;t c&#x1EE5;m &#x111;&#x1EA7;y &#x111;&#x1EE7; ng&#x1EEF; ngh&#x129;a, vi&#x1EC7;c chen t&#x1EEB; &quot;rapidly&quot; v&#x1ED1;n l&#xE0; t&#x1EEB; b&#x1ED5; ngh&#x129;a cho &#x111;&#x1ED9;ng t&#x1EEB; &quot;chases&quot; v&#xE0;o c&#x1EE5;m &#x111;&#x1EA7;y &#x111;&#x1EE7; n&#xE0;y s&#x1EBD; g&#xE2;y ra crossing. &#x110;&#x1EB7;c th&#xF9; v&#x1EC1; ng&#x1EEF; ph&#xE1;p v&#xE0; t&#xED;nh d&#x1EC5; &#x111;&#x1ECD;c c&#x1EE7;a ng&#xF4;n ng&#x1EEF; &#x111;&#x1EA3;m b&#x1EA3;o cho vi&#x1EC7;c c&#xE1;c t&#x1EEB; b&#x1ED5; sung ng&#x1EEF; ngh&#x129;a cho nhau n&#xEA;n &#x111;&#x1EE9;ng g&#x1EA7;n nhau v&#xE0; c&#xF3; th&#x1EC3; &#x111;&#x1B0;&#x1EE3;c gom th&#xE0;nh m&#x1ED9;t c&#x1EE5;m th&#x1ED1;ng nh&#x1EA5;t. M&#x1ED9;t c&#xE2;u kh&#xF4;ng &#x111;&#x1EA3;m b&#x1EA3;o ng&#x1EEF; ph&#xE1;p v&#xE0; t&#xED;nh d&#x1EC5; &#x111;&#x1ECD;c s&#x1EBD; c&#xF3; th&#x1EC3; g&#xE2;y ra crossing khi ph&#xE2;n t&#xED;ch c&#xE2;y ph&#x1EE5; thu&#x1ED9;c.</p>
<h2 id="ph&#xE2;n-t&#xED;ch-th&#xE0;nh-ph&#x1EA7;n-ph&#x1EE5;-thu&#x1ED9;c">Ph&#xE2;n t&#xED;ch th&#xE0;nh ph&#x1EA7;n ph&#x1EE5; thu&#x1ED9;c</h2>
<p>B&#xE0;i to&#xE1;n &#x111;&#x1EB7;t ra ch&#xED;nh l&#xE0; l&#xE0;m sao &#x111;&#x1EC3; c&#xF3; th&#x1EC3; ph&#xE1;t sinh c&#xE2;y ph&#x1EE5; thu&#x1ED9;c v&#x1EDB;i m&#x1ED9;t c&#xE2;u &#x111;&#x1EA7;u v&#xE0;o cho tr&#x1B0;&#x1EDB;c. C&#xF3; nhi&#x1EC1;u ph&#x1B0;&#x1A1;ng ph&#xE1;p &#x111;&#xE3; &#x111;&#x1B0;&#x1EE3;c &#x111;&#x1EC1; xu&#x1EA5;t &#x111;&#x1EC3; gi&#x1EA3;i b&#xE0;i to&#xE1;n n&#xE0;y. Trong b&#xE0;i vi&#x1EBF;t n&#xE0;y s&#x1EBD; gi&#x1EDB;i thi&#x1EC7;u hai ph&#x1B0;&#x1A1;ng ph&#xE1;p theo h&#x1B0;&#x1EDB;ng d&#x1EF1;a tr&#xEA;n data (data driven).</p>
<h3 id="ph&#xE2;n-t&#xED;ch-d&#x1EF1;a-tr&#xEA;n-ph&#x1B0;&#x1A1;ng-ph&#xE1;p-chuy&#x1EC3;n-d&#x1ECB;ch---transition-base">Ph&#xE2;n t&#xED;ch d&#x1EF1;a tr&#xEA;n ph&#x1B0;&#x1A1;ng ph&#xE1;p chuy&#x1EC3;n d&#x1ECB;ch - transition base</h3>
<p>&#xDD; t&#x1B0;&#x1EDF;ng ch&#xED;nh c&#x1EE7;a ph&#x1B0;&#x1A1;ng ph&#xE1;p chuy&#x1EC3;n d&#x1ECB;ch l&#xE0; xem qu&#xE1; tr&#xEC;nh sinh c&#xE2;y nh&#x1B0; s&#x1EF1; chuy&#x1EC3;n d&#x1ECB;ch trong m&#x1ED9;t m&#xE1;y tr&#x1EA1;ng th&#xE1;i. T&#x1EEB; tr&#x1EA1;ng th&#xE1;i b&#x103;t &#x111;&#x1EA7;u, d&#x1EF1;a tr&#xEA;n c&#xE1;c lu&#x1EAD;t chuy&#x1EC3;n d&#x1ECB;ch &#x111;&#x1EC3; &#x111;&#x1B0;a &#x111;&#x1EBF;n m&#x1ED9;t tr&#x1EA1;ng th&#xE1;i m&#x1EDB;i v&#xE0; cu&#x1ED1;i c&#xF9;ng &#x111;&#x1B0;a &#x111;&#x1EBF;n tr&#x1EA1;ng th&#xE1;i cu&#x1ED1;i c&#xF9;ng l&#xE0; ho&#xE0;n th&#xE0;nh vi&#x1EC7;c sinh c&#xE2;y. M&#x1ED9;t h&#x1EC7; th&#x1ED1;ng chuy&#x1EC3;n d&#x1ECB;ch g&#x1ED3;m c&#xE1;c th&#xE0;nh ph&#x1EA7;n sau:</p>
<ul>
<li>B&#x1ED9; 3 Stack, Buffer, Arc (S, B, A): d&#xF9;ng &#x111;&#x1EC3; bi&#x1EC3;u di&#x1EC5;n m&#x1ED9;t tr&#x1EA1;ng th&#xE1;i. Trong &#x111;&#xF3; Stack d&#xF9;ng &#x111;&#x1EC3; ch&#x1EE9;a c&#xE1;c t&#x1EEB; &#x111;&#xE3; &#x111;&#x1B0;&#x1EE3;c x&#xE9;t &#x111;&#x1EBF;n. Buffer d&#xF9;ng &#x111;&#x1EC3; ch&#x1EE9;a c&#xE1;c t&#x1EEB; ch&#x1B0;a &#x111;&#x1B0;&#x1EE3;c x&#xE9;t &#x111;&#x1EBF;n. Arc d&#xF9;ng &#x111;&#x1EC3; ch&#x1EE9;a c&#xE1;c m&#x1ED1;i quan h&#x1EC7; ph&#x1EE5; thu&#x1ED9;c &#x111;&#x1B0;&#x1EE3;c sinh ra trong qu&#xE1; tr&#xEC;nh chuy&#x1EC3;n d&#x1ECB;ch.</li>
<li>Tr&#x1EA1;ng th&#xE1;i kh&#x1EDF;i &#x111;&#x1EA7;u ([], [<em>w1</em>, <em>w2</em>, <em>w3</em>, ...], []): &#x111;&#x1B0;&#x1EE3;c kh&#x1EDF;i t&#x1EA1;o v&#x1EDB;i Stack v&#xE0; Arc tr&#x1ED1;ng, Buffer s&#x1EBD; ch&#x1EE9;a c&#xE2;u c&#x1EA7;n ph&#xE2;n t&#xED;ch &#x111;&#xE3; &#x111;&#x1B0;&#x1EE3;c chia th&#xE0;nh c&#xE1;c t&#x1EEB; c&#x1EE5; th&#x1EC3; (tokens).</li>
<li>Tr&#x1EA1;ng th&#xE1;i k&#x1EBF;t th&#xFA;c (S, [], A): K&#x1EBF;t th&#xFA;c khi t&#x1EA5;t c&#x1EA3; c&#xE1;c t&#x1EEB; trong Buffer v&#xE0; Stack &#x111;&#xE3; &#x111;&#x1B0;&#x1EE3;c x&#x1EED; l&#xFD;.</li>
<li>C&#xE1;c lu&#x1EAD;t chuy&#x1EC3;n d&#x1ECB;ch tr&#x1EA1;ng th&#xE1;i: d&#x1EF1;a tr&#xEA;n tr&#x1EA1;ng th&#xE1;i hi&#x1EC7;n t&#x1EA1;i, c&#xE1;c lu&#x1EAD;t chuy&#x1EC3;n d&#x1ECB;ch s&#x1EBD; quy&#x1EBF;t &#x111;&#x1ECB;nh tr&#x1EA1;ng th&#xE1;i m&#x1EDB;i c&#xF9;ng v&#x1EDB;i c&#xE1;c m&#x1ED1;i quan h&#x1EC7; ph&#x1EE5; thu&#x1ED9;c &#x111;&#x1B0;&#x1EE3;c sinh ra trong qu&#xE1; tr&#xEC;nh chuy&#x1EC3;n d&#x1ECB;ch.</li>
</ul>
<p>C&#xE1;c thao t&#xE1;c chuy&#x1EC3;n d&#x1ECB;ch bao g&#x1ED3;m: * <strong>Shift</strong> : di chuy&#x1EC3;n t&#x1EEB; &#x111;&#x1EA7;u ti&#xEA;n trong Buffer v&#xE0;o trong stack (S, <em>w</em>|B, A) -&gt; (S|<em>w</em>, B, A). * <strong>Left-arc</strong>: ki&#x1EC3;m tra quan h&#x1EC7; hai t&#x1EEB; trong top c&#x1EE7;a stack, l&#x1EA5;y t&#x1EEB; &quot;b&#xEA;n tr&#xE1;i&quot; (b&#xEA;n d&#x1B0;&#x1EDB;i) ra kh&#x1ECF;i stack v&#xE0; th&#xEA;m quan h&#x1EC7; v&#xE0;o trong Arc (S|<em>w1</em>|<em>w2</em>, B, A) -&gt; (S|<em>w2</em>, B, A + {<em>w1</em> &lt;- <em>w2</em>}) * <strong>Right-arc</strong>: t&#x1B0;&#x1A1;ng t&#x1EF1; nh&#x1B0; left-arc, ki&#x1EC3;m tra quan h&#x1EC7;n hai t&#x1EEB; trong top c&#x1EE7;a stack, l&#x1EA5;y t&#x1EEB; &quot;b&#xEA;n ph&#x1EA3;i&quot; (b&#xEA;n tr&#xEA;n) ra kh&#x1ECF;i stack v&#xE0; th&#xEA;m quan h&#x1EC7; v&#xE0;o trong Arc Arc (S|<em>w1</em>|<em>w2</em>, B, A) -&gt; (S|<em>w1</em>, B, A + {<em>w1</em> -&gt; <em>w2</em>})</p>
<p>Sau m&#x1ED9;t lo&#x1EA1;t c&#xE1;c ph&#xE9;p chuy&#x1EC3;n &#x111;&#x1ED5;i, l&#x1EA7;n l&#x1B0;&#x1EE3;t c&#xE1;c t&#x1EEB; trong Buffer s&#x1EBD; chuy&#x1EC3;n d&#x1EA7;n qua Stack th&#xF4;ng qua thao t&#xE1;c Shift. C&#xE1;c t&#x1EEB; trong Stack s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c x&#x1EED; l&#xFD; &#x111;&#x1EC3; x&#xE1;c &#x111;&#x1ECB;nh m&#x1ED1;i quan h&#x1EC7; v&#xE0; th&#xEA;m v&#xE0;o Arc d&#x1EF1;a tr&#xEA;n c&#xE1;c thao t&#xE1;c left-arc v&#xE0; right-arc. V&#xED; d&#x1EE5; cho qu&#xE1; tr&#xEC;nh sinh c&#xE2;y quan h&#x1EC7; cho c&#xE2;u &quot;A dog chases a small cat.&quot; nh&#x1B0; sau:</p>
<div style="white-space: pre-line;">Action | Stack | Buffer | Arc |
&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;| [ROOT] | [A, dog, chases, a, cat] | A |
Shift | [ROOT, A] | [dog, chases, a, cat] | A |
Shift | [ROOT, A, dog] | [chases, a, cat] | A |
Left-arc | [ROOT, dog] | [chases, a, cat] | A + {A &lt;- dog} |
Shift | [ROOT, dog, chases] | [a, cat] | A |
Left-arc | [ROOT, chases] | [a, cat] | A + {dog &lt;- chases} |
Shift | [ROOT, chases, a] | [cat] | A |
Shift | [ROOT, chases, a, cat] | [] | A |
Left-arc | [ROOT, chases, cat] | [] | A + {a &lt;- cat} |
Right-arc | [ROOT, chases] | [] | A + {chases -&gt; cat} |
Right-arc | [ROOT] | [] | A + {ROOT -&gt; chases} |</div>
<h3 id="ph&#xE2;n-t&#xED;ch-d&#x1EF1;a-tr&#xEA;n-ph&#x1B0;&#x1A1;ng-ph&#xE1;p-&#x111;&#x1ED3;-th&#x1ECB;---graph-base">Ph&#xE2;n t&#xED;ch d&#x1EF1;a tr&#xEA;n ph&#x1B0;&#x1A1;ng ph&#xE1;p &#x111;&#x1ED3; th&#x1ECB; - graph base</h3>
<h2 id="&#xE1;p-d&#x1EE5;ng-c&#xE2;y-ph&#x1EE5;-thu&#x1ED9;c">&#xC1;p d&#x1EE5;ng c&#xE2;y ph&#x1EE5; thu&#x1ED9;c</h2>
<p>B&#xE0;i vi&#x1EBF;t tham kh&#x1EA3;o t&#x1EEB; c&#xE1;c ngu&#x1ED3;n</p>
</div></div><div class="post-main post-comment"><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = 'lqan';
var disqus_identifier = '2019/03/08/dependency-parsing/';
var disqus_title = 'Phân tích thành phần phụ thuộc';
var disqus_url = 'http://yoursite.com/2019/03/08/dependency-parsing/';
(function() {
   var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
   dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
   (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">Blog comments powered by <span class="logo-disqus">Disqus</span></a></div></article><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.css"/><script src="//cdn.bootcss.com/jquery/2.0.3/jquery.min.js"></script><script src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js"></script><script>$(document).ready(function() {
    $(".fancybox").fancybox();
});
</script></body></html>