<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"/><meta content="yes" name="apple-mobile-web-app-capable"/><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"/><meta content="telephone=no" name="format-detection"/><meta name="description"/><title>Căn phòng Trung Hoa | Lương Quốc An</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"/><link rel="stylesheet" type="text/css" href="/css/highlight.css"/><link rel="stylesheet" type="text/css" href="/css/font.css"/><link rel="stylesheet" type="text/css" href="/css/noise.css"/><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"/><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"/></head><body><article class="wrapper"><div class="post-main"><div class="nav"><nav class="container"><a class="sidebar-nav-item active" href="/">Home</a><a class="sidebar-nav-item" href="/archives">Archives</a></nav><div class="container post-meta"><div class="post-time">2018-04-21</div></div></div><div class="container post-header"><h1>Căn phòng Trung Hoa</h1></div><div class="container post-content"><a id="more"></a>
<h2 id="Su-ra-doi-cua-tranh-luan-can-phong-trung-hoa"><a href="#Su-ra-doi-cua-tranh-luan-can-phong-trung-hoa" class="headerlink" title="S&#x1EF1; ra &#x111;&#x1EDD;i c&#x1EE7;a tranh lu&#x1EAD;n c&#x103;n ph&#xF2;ng trung hoa"></a>S&#x1EF1; ra &#x111;&#x1EDD;i c&#x1EE7;a tranh lu&#x1EAD;n c&#x103;n ph&#xF2;ng trung hoa</h2><p>S&#x1EF1; ph&#xE1;t tri&#x1EC3;n m&#x1EA1;nh m&#x1EBD; c&#x1EE7;a m&#xE1;y t&#xED;nh &#x111;&#xE3; k&#xE9;o theo nhi&#x1EC1;u c&#xE2;u h&#x1ECF;i trong gi&#x1EDB;i tri&#x1EBF;t h&#x1ECD;c v&#x1EC1; kh&#x1EA3; n&#x103;ng t&#x1B0; duy c&#x1EE7;a m&#xE1;y t&#xED;nh. N&#x103;m 1980, trong b&#xE0;i b&#xE1;o &#x201C;Minds, Brains and Programs&#x201C;, John Searle &#x111;&#xE3; tr&#xEC;nh b&#xE0;y v&#x1EC1; tranh lu&#x1EAD;n C&#x103;n Ph&#xF2;ng Trung Hoa. Tranh lu&#x1EAD;n n&#xE0;y nhanh ch&#xF3;ng t&#x1EA1;o n&#xEA;n s&#x1EE9;c &#x1EA3;nh h&#x1B0;&#x1EDF;ng. R&#x1EA5;t nhi&#x1EC1;u ph&#x1EA3;n h&#x1ED3;i b&#xE0;n lu&#x1EAD;n v&#x1EC1; v&#x1EA5;n &#x111;&#x1EC1; n&#xE0;y &#x111;&#x1B0;&#x1EE3;c g&#x1EED;i &#x111;&#x1EBF;n Searle khi&#x1EBF;n &#xF4;ng ph&#x1EA3;i vi&#x1EBF;t th&#xEA;m nhi&#x1EC1;u b&#xE0;i vi&#x1EBF;t &#x111;&#x1EC3; b&#x1EA3;o v&#x1EC7; &#xFD; ki&#x1EBF;n c&#x1EE7;a m&#xEC;nh. Tranh lu&#x1EAD;n n&#xE0;y v&#x1EAB;n c&#xF2;n &#x111;ang l&#xE0; m&#x1ED9;t th&#x1EED; th&#xE1;ch trong l&#x129;nh v&#x1EF1;c tr&#xED; tu&#x1EC7; nh&#xE2;n t&#x1EA1;o.</p>
<h2 id="Noi-dung-cua-Can-Phong-Trung-Hoa"><a href="#Noi-dung-cua-Can-Phong-Trung-Hoa" class="headerlink" title="N&#x1ED9;i dung c&#x1EE7;a C&#x103;n Ph&#xF2;ng Trung Hoa"></a>N&#x1ED9;i dung c&#x1EE7;a C&#x103;n Ph&#xF2;ng Trung Hoa</h2><p>&#xDD; t&#x1B0;&#x1EDF;ng v&#x1EC1; C&#x103;n Ph&#xF2;ng Trung Hoa c&#x1EE7;a Searle &#x111;&#x1B0;&#x1EE3;c m&#xF4; t&#x1EA3; nh&#x1B0; sau: gi&#x1EA3; s&#x1EED; r&#x1EB1;ng c&#xF3; m&#x1ED9;t c&#x103;n ph&#xF2;ng k&#xED;n, b&#xEA;n trong &#x111;&#xF3; c&#xF3; m&#x1ED9;t ng&#x1B0;&#x1EDD;i. C&#x103;n ph&#xF2;ng ch&#x1EC9; g&#x1ED3;m m&#x1ED9;t khe &#x111;&#x1EA7;u v&#xE0;o v&#xE0; m&#x1ED9;t khe &#x111;&#x1EA7;u ra. M&#x1ED9;t ng&#x1B0;&#x1EDD;i n&#xE0;o &#x111;&#xF3; &#x1EDF; ngo&#xE0;i c&#x103;n ph&#xF2;ng s&#x1EBD; &#x111;&#x1B0;a m&#x1ED9;t m&#x1EA9;u gi&#x1EA5;y ghi m&#x1ED9;t c&#xE2;u h&#x1ECF;i b&#x1EB1;ng ti&#x1EBF;ng Trung v&#xE0;o khe &#x111;&#x1EA7;u v&#xE0;o cho ng&#x1B0;&#x1EDD;i b&#xEA;n trong. Ng&#x1B0;&#x1EDD;i b&#xEA;n trong s&#x1EBD; tr&#x1EA3; l&#x1EDD;i c&#xE2;u h&#x1ECF;i &#x111;&#xF3; v&#xE0; &#x111;&#x1B0;a m&#x1EA9;u gi&#x1EA5;y ch&#x1EE9;a c&#xE2;u tr&#x1EA3; l&#x1EDD;i c&#x169;ng b&#x1EB1;ng ti&#x1EBF;ng Trung ra khe &#x111;&#x1EA7;u ra. Searle gi&#x1EA3; s&#x1EED; r&#x1EB1;ng k&#x1EBF;t qu&#x1EA3; c&#x1EE7;a c&#xE2;u tr&#x1EA3; l&#x1EDD;i c&#x1EE7;a C&#x103;n Ph&#xF2;ng Trung Hoa v&#x1B0;&#x1EE3;t qua &#x111;&#x1B0;&#x1EE3;c ph&#xE9;p th&#x1EED; Turing. R&#xF5; r&#xE0;ng r&#x1EB1;ng ch&#xFA;ng ta s&#x1EBD; ngh&#x129; r&#x1EB1;ng ng&#x1B0;&#x1EDD;i trong c&#x103;n ph&#xF2;ng &#x111;&#xF3; bi&#x1EBF;t ti&#x1EBF;ng Trung. Nh&#x1B0;ng v&#xED; d&#x1EE5; c&#x1EE7;a Searle n&#xEA;u ra r&#x1EB1;ng trong c&#x103;n ph&#xF2;ng &#x111;&#xF3; l&#xE0; m&#x1ED9;t ng&#x1B0;&#x1EDD;i kh&#xF4;ng bi&#x1EBF;t g&#xEC; v&#x1EC1; ti&#x1EBF;ng Trung v&#xE0; m&#x1ED9;t cu&#x1ED1;n c&#x1EA9;m nang tra c&#x1EE9;u ti&#x1EBF;ng Trung. Cu&#x1ED1;n c&#x1EA9;m nang n&#xE0;y kh&#xF4;ng ph&#x1EA3;i nh&#x1B0; m&#x1ED9;t cu&#x1ED1;n t&#x1EEB; &#x111;i&#x1EC3;n m&#xE0; &#x111;&#x1A1;n thu&#x1EA7;n ch&#x1EC9; l&#xE0; nh&#x1EEF;ng ch&#x1EC9; d&#x1EAB;n l&#x1EAF;p gh&#xE9;p c&#xE1;c k&#xFD; t&#x1EF1; ti&#x1EBF;ng Trung m&#xE0; th&#xF4;i.</p>
<p><img src="/images/c-room.gif" alt="The chiese room"></p>
<p>C&#xF3; th&#x1EC3; l&#x1EA5;y m&#x1ED9;t v&#xED; d&#x1EE5; &#x111;&#x1A1;n gi&#x1EA3;n nh&#x1B0; sau:&#x201D;B&#xEA;n ngo&#xE0;i c&#x103;n ph&#xF2;ng &#x111;&#x1B0;a v&#xE0;o c&#xE2;u h&#x1ECF;i &#x201C;&#x4F60;&#x597D;&#x55CE;?&#x201D;. Ng&#x1B0;&#x1EDD;i b&#xEA;n trong kh&#xF4;ng hi&#x1EC3;u g&#xEC; v&#x1EC1; c&#xE2;u h&#x1ECF;i n&#xE0;y c&#x1EA3; nh&#x1B0;ng anh ta c&#xF3; &#x111;&#x1B0;&#x1EE3;c ch&#x1EC9; d&#x1EAB;n trong cu&#x1ED1;n c&#x1EA9;m nang r&#x1EB1;ng n&#x1EBF;u th&#x1EA5;y c&#xE2;u h&#x1ECF;i &#x201C;&#x4F60;&#x597D;&#x55CE;?&#x201D; th&#xEC; h&#xE3;y tr&#x1EA3; l&#x1EDD;i &#x201C;&#x6211;&#x5F88;&#x597D;&#x201D;. Ng&#x1B0;&#x1EDD;i trong c&#x103;n ph&#xF2;ng c&#x1EE9; th&#x1EBF; l&#xE0;m theo h&#x1B0;&#x1EDB;ng d&#x1EAB;n v&#xE0; c&#xE2;u tr&#x1EA3; l&#x1EDD;i &#x111;&#x1B0;&#x1EE3;c &#x111;&#x1B0;a ra cho ng&#x1B0;&#x1EDD;i b&#xEA;n ngo&#xE0;i m&#x1EB7;c d&#xF9; anh ta kh&#xF4;ng h&#x1EC1; bi&#x1EBF;t r&#x1EB1;ng c&#x1EB7;p c&#xE2;u n&#xE0;y &#x111;&#x1A1;n gi&#x1EA3;n ch&#x1EC9; l&#xE0; &#x201C;b&#x1EA1;n c&#xF3; kh&#x1ECF;e kh&#xF4;ng?&#x201D; v&#xE0; &#x201C;t&#xF4;i v&#x1EAB;n kh&#x1ECF;e&#x201D;. V&#x1EDB;i c&#xE1;ch l&#xE0;m nh&#x1B0; v&#x1EAD;y, ng&#x1B0;&#x1EDD;i trong c&#x103;n ph&#xF2;ng kh&#xF4;ng c&#x1EA7;n bi&#x1EBF;t ti&#x1EBF;ng Trung v&#x1EAB;n c&#xF3; th&#x1EC3; tr&#x1EA3; l&#x1EDD;i c&#xE1;c c&#xE2;u h&#x1ECF;i. &#x110;&#x1ED9; ch&#xED;nh x&#xE1;c c&#x1EE7;a c&#xE2;u tr&#x1EA3; l&#x1EDD;i ch&#x1EC9; ph&#x1EE5; thu&#x1ED9;c v&#xE0;o &#x111;&#x1ED9; chi ti&#x1EBF;t c&#x1EE7;a cu&#x1ED1;n c&#x1EA9;m nang m&#xE0; th&#xF4;i.</p>
<h2 id="Tranh-Luan"><a href="#Tranh-Luan" class="headerlink" title="Tranh Lu&#x1EAD;n"></a>Tranh Lu&#x1EAD;n</h2><p>M&#xF4; h&#xEC;nh c&#x103;n ph&#xF2;ng trung hoa ch&#xED;nh l&#xE0; s&#x1EF1; m&#xF4; ph&#x1ECF;ng l&#x1EA1;i c&#x1EE7;a m&#x1ED9;t m&#xE1;y t&#xED;nh (c&#x103;n ph&#xF2;ng) v&#xE0; ch&#x1B0;&#x1A1;ng tr&#xEC;nh (cu&#x1ED1;n c&#x1EA9;m nang). V&#x1EAD;y th&#x1EAD;t s&#x1EF1; m&#x1ED9;t m&#xE1;y t&#xED;nh &#x111;&#x1B0;&#x1EE3;c l&#x1EAD;p tr&#xEC;nh t&#x1ED1;t &#x111;&#x1EC3; &#x111;&#x1B0;a ra nh&#x1EEF;ng ph&#x1EA3;n h&#x1ED3;i hay c&#xF3; th&#x1EC3; xem l&#xE0; c&#xF3; nh&#x1EAD;n th&#x1EE9;c v&#xE0; t&#x1B0; duy? &#x110;&#x1ED1;i v&#x1EDB;i C&#x103;n Ph&#xF2;ng Trung Hoa th&#xEC; r&#xF5; r&#xE0;ng l&#xE0; kh&#xF4;ng. Ch&#xFA;ng ta th&#x1EA5;y r&#x1EB1;ng ng&#x1B0;&#x1EDD;i trong c&#x103;n ph&#xF2;ng kh&#xF4;ng h&#x1EC1; c&#xF3; m&#x1ED9;t nh&#x1EAD;n th&#x1EE9;c n&#xE0;o v&#x1EC1; ti&#x1EBF;ng Trung, anh ta &#x111;&#x1A1;n thu&#x1EA7;n l&#xE0; l&#xE0;m theo c&#xE1;c h&#x1B0;&#x1EDB;ng d&#x1EAB;n. Thu&#x1EAD;t to&#xE1;n ch&#xED;nh l&#xE0; c&#xE1;c h&#x1B0;&#x1EDB;ng d&#x1EAB;n v&#xE0; m&#xE1;y t&#xED;nh ch&#xED;nh l&#xE0; ng&#x1B0;&#x1EDD;i th&#x1EF1;c hi&#x1EC7;n theo c&#xE1;c h&#x1B0;&#x1EDB;ng d&#x1EAB;n. Nh&#x1B0; v&#x1EAD;y, m&#x1ED9;t m&#xE1;y t&#xED;nh ch&#x1EE9;a m&#x1ED9;t ph&#x1EA7;n m&#x1EC1;m t&#x1ED1;t kh&#xF4;ng th&#x1EC3; &#x111;&#x1B0;&#x1EE3;c xem nh&#x1B0; l&#xE0; c&#xF3; nh&#x1EAD;n th&#x1EE9;c v&#xE0; t&#x1B0; duy &#x111;&#x1B0;&#x1EE3;c m&#xE0; ch&#x1EC9; l&#xE0; m&#x1ED9;t s&#x1EF1; m&#xF4; ph&#x1ECF;ng s&#x1EF1; nh&#x1EAD;n th&#x1EE9;c v&#xE0; t&#x1B0; duy. R&#xF5; r&#xE0;ng r&#x1EB1;ng m&#x1ED9;t ph&#x1EA7;n m&#x1EC1;m d&#xF9; c&#xF3; th&#xF4;ng minh &#x111;&#x1EBF;n &#x111;&#xE2;u nh&#x1B0;ng v&#x1EC1; c&#x1A1; b&#x1EA3;n v&#x1EAB;n kh&#xE1;c xa so v&#x1EDB;i tr&#xED; th&#xF4;ng minh c&#x1EE7;a con ng&#x1B0;&#x1EDD;i.</p>
<p>Qua b&#xE0;i b&#xE1;o c&#x1EE7;a m&#xEC;nh, Searle c&#x169;ng ch&#x1EC9; ra kh&#xE1;i ni&#x1EC7;m v&#x1EC1; Tr&#xED; Tu&#x1EC7; Nh&#xE2;n T&#x1EA1;o M&#x1EA1;nh (Strong AI) v&#xE0; Tr&#xED; Tu&#x1EC7; Nh&#xE2;n T&#x1EA1;o Y&#x1EBF;u (Weak AI). Tr&#xED; Tu&#x1EC7; Nh&#xE2;n T&#x1EA1;o Y&#x1EBF;u ch&#x1EC9; &#x111;&#x1A1;n thu&#x1EA7;n l&#xE0; m&#x1ED9;t m&#xF4; h&#xEC;nh m&#xF4; ph&#x1ECF;ng t&#xE2;m tr&#xED;, hay ch&#x1EC9; l&#xE0; c&#xE1;i v&#x1ECF; c&#x1EE7;a t&#xE2;m tr&#xED;. Trong khi &#x111;&#xF3;, Tr&#xED; Tu&#x1EC7; Nh&#xE2;n T&#x1EA1;o M&#x1EA1;nh l&#xE0; s&#x1EF1; m&#xF4; ph&#x1ECF;ng ho&#xE0;n thi&#x1EC7;n c&#x1EE7;a t&#xE2;m tr&#xED; v&#x1EDB;i kh&#x1EA3; n&#x103;ng nh&#x1EAD;n th&#x1EE9;c v&#xE0; t&#x1B0; duy.</p>
<h2 id="may-tinh-co-the-co-tam-tri-nhu-o-nguoi"><a href="#may-tinh-co-the-co-tam-tri-nhu-o-nguoi" class="headerlink" title="m&#xE1;y t&#xED;nh c&#xF3; th&#x1EC3; c&#xF3; t&#xE2;m tr&#xED; nh&#x1B0; &#x1EDF; ng&#x1B0;&#x1EDD;i?"></a>m&#xE1;y t&#xED;nh c&#xF3; th&#x1EC3; c&#xF3; t&#xE2;m tr&#xED; nh&#x1B0; &#x1EDF; ng&#x1B0;&#x1EDD;i?</h2><p>C&#x103;n ph&#xF2;ng Trung Hoa &#x111;&#xE3; m&#x1EDF; ra nhi&#x1EC1;u c&#xE2;u h&#x1ECF;i cho l&#x129;nh v&#x1EF1;c Tr&#xED; Tu&#x1EC7; Nh&#xE2;n T&#x1EA1;o, v&#xE0; c&#x169;ng ch&#x1EC9; ra m&#x1ED9;t ti&#xEA;u chu&#x1EA9;n m&#x1EDB;i cho m&#xE1;y t&#xED;nh c&#xF3; s&#x1EF1; th&#xF4;ng minh th&#x1EF1;c th&#x1EE5;. Nh&#x1B0;ng li&#x1EC7;u m&#xE1;y t&#xED;nh c&#xF3; th&#x1EC3; &#x111;&#x1EA1;t &#x111;&#x1B0;&#x1EE3;c &#x111;i&#x1EC1;u &#x111;&#xF3; hay &#x111;&#x1A1;n thu&#x1EA7;n ch&#x1EC9; l&#xE0; m&#x1ED9;t c&#x103;n ph&#xF2;ng v&#xE0; m&#x1ED9;t cu&#x1ED1;n c&#x1EA9;m nang? &#x110;i&#x1EC1;u m&#xE0; ch&#xFA;ng ta ch&#x1EAF;c ch&#x1EAF;n bi&#x1EBF;t r&#x1EB1;ng l&#xE0; ch&#xFA;ng ta, nh&#x1EEF;ng sinh v&#x1EAD;t tr&#xED; tu&#x1EC7;, &#x111;&#x1EC1;u &#x111;&#x1B0;&#x1EE3;c h&#xEC;nh th&#xE0;nh t&#x1EEB; v&#x1EAD;t ch&#x1EA5;t v&#xE0; hi&#x1EC3;n nhi&#xEA;n c&#x1EA3; b&#x1ED9; n&#xE3;o, n&#x1A1;i ch&#x1EE9;a t&#xE2;m tr&#xED;, c&#x169;ng kh&#xF4;ng ngo&#x1EA1;i l&#x1EC7;. &#x110;i&#x1EC1;u &#x111;&#xF3; c&#xF3; ngh&#x129;a l&#xE0; c&#xF3; th&#x1EC3; t&#xE2;m tr&#xED; c&#x1EE7;a ch&#xFA;ng ta c&#x169;ng ho&#x1EA1;t &#x111;&#x1ED9;ng d&#x1EF1;a tr&#xEA;n c&#x1EA5;u tr&#xFA;c c&#x1EE7;a n&#xE3;o b&#x1ED9;. Trong t&#x1B0;&#x1A1;ng lai, n&#x1EBF;u ch&#xFA;ng ta c&#xF3; th&#x1EC3; khai m&#x1EDF; &#x111;&#x1B0;&#x1EE3;c b&#xED; &#x1EA9;n v&#x1EC1; tr&#xED; &#xF3;c lo&#xE0;i ng&#x1B0;&#x1EDD;i, th&#xEC; c&#x169;ng c&#xF3; th&#x1EC3; m&#x1ED9;t h&#x1EC7; th&#x1ED1;ng m&#xE1;y t&#xED;nh c&#xF3; t&#x1B0; duy s&#x1EBD; ra &#x111;&#x1EDD;i.</p>
</div></div><div class="post-main post-comment"></div></article><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.css"/><script src="//cdn.bootcss.com/jquery/2.0.3/jquery.min.js"></script><script src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js"></script><script>$(document).ready(function() {
    $(".fancybox").fancybox();
});
</script></body></html>