<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"/><meta content="yes" name="apple-mobile-web-app-capable"/><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"/><meta content="telephone=no" name="format-detection"/><meta name="description"/><title>Phân tích cú pháp văn phạm | Lương Quốc An</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"/><link rel="stylesheet" type="text/css" href="/css/highlight.css"/><link rel="stylesheet" type="text/css" href="/css/font.css"/><link rel="stylesheet" type="text/css" href="/css/noise.css"/><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"/><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"/></head><body><article class="wrapper"><div class="post-main"><div class="nav"><nav class="container"><a class="sidebar-nav-item active" href="/">Home</a><a class="sidebar-nav-item" href="/archives">Archives</a></nav><div class="container post-meta"><div class="post-time">2019-02-13</div></div></div><div class="container post-header"><h1>Phân tích cú pháp văn phạm</h1></div><div class="container post-content"><a id="more"></a>
<h2 id="bi&#x1EC3;u-di&#x1EC5;n-c&#xFA;-ph&#xE1;p-cho-v&#x103;n-b&#x1EA3;n">Bi&#x1EC3;u di&#x1EC5;n c&#xFA; ph&#xE1;p cho v&#x103;n b&#x1EA3;n</h2>
<p>V&#x103;n ph&#x1EA1;m trong ng&#xF4;n ng&#x1EEF; t&#x1EF1; nhi&#xEA;n l&#xE0; quy t&#x1EAF;c ch&#x1EE7; y&#x1EBF;u trong c&#x1EA5;u tr&#xFA;c ng&#xF4;n ng&#x1EEF;. C&#xE1;c t&#x1EEB; trong m&#x1ED9;t c&#xE2;u &#x111;u&#x1EE3;c gh&#xE9;p n&#x1ED1;i v&#x1EDB;i nhau d&#x1EF1;a tr&#xEA;n v&#x103;n ph&#x1EA1;m &#x111;&#x1EC3; h&#xEC;nh th&#xE0;nh n&#xEA;n c&#xE2;u c&#xF3; ngh&#x129;a v&#xE0; th&#xF4;ng qua &#x111;&#xF3; th&#x1EC3; hi&#x1EC7;n vai tr&#xF2; c&#x1EE7;a t&#x1EEB; trong ng&#x1EEF; ngh&#x129;a c&#x1EE7;a c&#xE2;u. Trong &#x111;a s&#x1ED1; ng&#xF4;n ng&#x1EEF;, c&#xE2;u c&#xF3; th&#x1EC3; chia l&#xE0;m hai ph&#x1EA7;n ch&#xED;nh l&#xE0; ch&#x1EE7; ng&#x1EEF; v&#xE0; v&#x1ECB; ng&#x1EEF;. Trong ch&#x1EE7; ng&#x1EEF; l&#x1EA1;i c&#xF3; th&#x1EC3; bao g&#x1ED3;m danh t&#x1EEB;, c&#x1EE5;m danh t&#x1EEB;, &#x111;&#x1EA1;i t&#x1EEB;, m&#x1EC7;nh &#x111;&#x1EC1;, ... v&#xE0; trong v&#x1ECB; ng&#x1EEF; c&#xF3; th&#x1EC3; c&#xF3; &#x111;&#x1ED9;ng t&#x1EEB; ch&#xED;nh, tr&#x1EA1;ng t&#x1EEB;, b&#x1ED5; t&#xFA;c t&#x1EEB;, .... X&#xE9;t nh&#x1ECF; h&#x1A1;n n&#x1EEF;a c&#xF3; th&#x1EC3; chia ti&#x1EBF;p c&#x1EE5;m danh t&#x1EEB;, m&#x1EC7;nh &#x111;&#x1EC1; th&#xE0;nh c&#xE1;c th&#xE0;nh ph&#x1EA7;n nh&#x1ECF; h&#x1A1;n v&#xE0; cho &#x111;&#x1EBF;n khi ch&#x1EC9; c&#xF2;n l&#x1EA1;i t&#x1EEB; v&#xE0; t&#x1EEB; lo&#x1EA1;i c&#x1EE7;a n&#xF3; (kh&#xF4;ng th&#x1EC3; chia c&#xFA; ph&#xE1;p &#x111;u&#x1EE3;c n&#x1EEF;a). D&#x1EF1;a v&#xE0;o c&#xE1;ch ph&#xE2;n t&#xED;ch c&#xFA; ph&#xE1;p trong ng&#xF4;n ng&#x1EEF; t&#x1EF1; nhi&#xEA;n n&#xE0;y ta nh&#x1EAD;n th&#x1EA5;y c&#x1EA5;u tr&#xFA;c c&#xE2;y ph&#xF9; h&#x1EE3;p &#x111;&#x1EC3; bi&#x1EC3;u di&#x1EC5;n c&#xFA; ph&#xE1;p v&#x103;n ph&#x1EA1;m cho m&#x1ED9;t c&#xE2;u.</p>
<p align="center">
</p><p>S = &quot;a(<strong>Det</strong>) quick(<strong>Adj</strong>) brown(<strong>Adj</strong>) fox(<strong>N</strong>) jumps(<strong>V</strong>) over(<strong>P</strong>) the(<strong>Det</strong>) lazy(<strong>Adj</strong>) dog(<strong>N</strong>)&quot;</p>
<em>a quick brown fox jumps over the lazy dog</em>
<p></p>
<p>D&#x1EF1;a v&#xE0;o ki&#x1EBF;n th&#x1EE9;c ng&#xF4;n ng&#x1EEF;, ta c&#xF3; c&#xE2;y c&#xFA; ph&#xE1;p c&#x1EE7;a c&#xE2;u S nh&#x1B0; sau:</p>
<p align="center">
</p><p><img src="/images/ParsedTree.jpg" alt="" width="800"></p>
C&#xE2;y c&#xFA; ph&#xE1;p.
<p></p>
<p>D&#x1EF1;a v&#xE0;o c&#xE2;y c&#xFA; ph&#xE1;p bi&#x1EC3;u di&#x1EC5;n nh&#x1B0; tr&#xEA;n, ta d&#x1EC5; d&#xE0;ng r&#xFA;t tr&#xED;ch ra ch&#x1EE7; th&#x1EC3; h&#xE0;nh &#x111;&#x1ED9;ng l&#xE0; &quot;the quick brown fox&quot; trong &#x111;&#xF3; &quot;fox&quot; l&#xE0; danh t&#x1EEB; ch&#xED;nh &#x111;&#x1B0;&#x1EE3;c b&#x1ED5; ngh&#x129;a b&#x1EDF;i c&#xE1;c t&#xED;nh t&#x1EEB; &quot;brown&quot; v&#xE0; &quot;quick&quot;; v&#xE0; &#x111;&#x1ED9;ng t&#x1EEB; ch&#xED;nh c&#x1EE7;a c&#xE2;u l&#xE0; &quot;jumps&quot;. C&#xE2;y c&#xFA; ph&#xE1;p l&#xE0; c&#x1EA5;u tr&#xFA;c c&#xE2;y v&#x1EDB;i n&#xFA;t g&#x1ED1;c l&#xE0; n&#xFA;t b&#x1EAF;t &#x111;&#x1EA7;u (__S__entence), t&#x1EEB; n&#xFA;t g&#x1ED1;c s&#x1EBD; chia ra th&#xE0;nh c&#xE1;c nh&#xE1;nh l&#xE0; c&#xE1;c th&#xE0;nh ph&#x1EA7;n ch&#xED;nh c&#x1EE7;a c&#xE2;u (Ch&#x1EE7; ng&#x1EEF; - NP, V&#x1ECB; ng&#x1EEF; - VP). C&#xE1;c th&#xE0;nh ph&#x1EA7;n n&#xE0;y l&#x1EA1;i ti&#x1EBF;p t&#x1EE5;c &#x111;&#x1EC7; quy &#x111;&#x1EC3; sinh ra c&#xE1;c nh&#xE1;nh l&#xE0; c&#xE1;c th&#xE0;nh ph&#x1EA7;n kh&#xE1;c ch&#x1EE9;a trong n&#xF3;. Qu&#xE1; tr&#xEC;nh &#x111;&#x1EC7; quy s&#x1EBD; d&#x1EEB;ng l&#x1EA1;i khi &#x111;&#x1EBF;n n&#xFA;t l&#xE1; l&#xE0; c&#xE1;c t&#x1EEB; c&#x1EE5; th&#x1EC3; v&#x1EDB;i lo&#x1EA1;i t&#x1EEB; c&#x1EE5; th&#x1EC3; v&#xE0; kh&#xF4;ng th&#x1EC3; ph&#xE2;n chia &#x111;&#x1B0;&#x1EE3;c n&#x1EEF;a. T&#x1EEB; c&#xE2;y c&#xFA; ph&#xE1;p &#x111;&#x1EC3; &#x111;&#x1ECD;c l&#x1EA1;i th&#xE0;nh c&#xE2;u ho&#xE0;n ch&#x1EC9;nh ch&#x1EC9; c&#x1EA7;n duy&#x1EC7;t c&#xE2;y t&#x1EEB; tr&#xE1;i sang ph&#x1EA3;i th&#xEC; ta s&#x1EBD; l&#x1EA1;i c&#xF3; &#x111;&#x1B0;&#x1EE3;c v&#x103;n b&#x1EA3;n ho&#xE0;n ch&#x1EC9;nh.</p>
<h2 id="nh&#x1EAD;p-nh&#x1EB1;n-trong-bi&#x1EC3;u-di&#x1EC5;n-c&#xFA;-ph&#xE1;p">Nh&#x1EAD;p nh&#x1EB1;n trong bi&#x1EC3;u di&#x1EC5;n c&#xFA; ph&#xE1;p</h2>
<p>M&#x1ED9;t trong nh&#x1EEF;ng v&#x1EA5;n &#x111;&#x1EC1; kh&#xF3; kh&#x103;n trong x&#x1EED; l&#xFD; ng&#xF4;n ng&#x1EEF; t&#x1EF1; nhi&#xEA;n ch&#xED;nh l&#xE0; nh&#x1EAD;p nh&#x1EB1;n, nh&#x1EAD;p nh&#x1EB1;n trong c&#x1EA3; h&#xEC;nh th&#x1EE9;c l&#x1EAB;n ng&#x1EEF; ngh&#x129;a. X&#xE9;t m&#x1ED9;t v&#xED; d&#x1EE5; sau &#x111;&#xE2;y:</p>
<p align="center">
</p><p>S = &quot;I/<strong>Pro</strong> shot/<strong>V</strong> an/<strong>Det</strong> elephant/<strong>N</strong> in/<strong>P</strong> my/<strong>Det</strong> pajamas/<strong>N</strong>&quot;</p>
<em>I shot an elephant in my pajamas</em>
<p></p>
<p>Ph&#xE2;n t&#xED;ch c&#xFA; ph&#xE1;p v&#xED; d&#x1EE5; tr&#xEA;n cho ta hai c&#xE2;y c&#xFA; ph&#xE1;p sau:</p>
<p align="center">
<img src="/images/Ambiguity1.jpg" alt="" height="218"> <img src="/images/Ambiguity2.jpg" alt="" height="218">
</p>
<p>T&#x1EA1;i sao l&#x1EA1;i c&#xF3; nh&#x1EEF;ng hai c&#xE2;y c&#xFA; ph&#xE1;p? Th&#x1EF1;c t&#x1EBF; th&#xEC; trong ng&#xF4;n ng&#x1EEF; t&#x1EF1; nhi&#xEA;n c&#xE2;u v&#xED; d&#x1EE5; tr&#xEA;n c&#xF3; t&#x1EDB;i hai c&#xE1;ch hi&#x1EC3;u n&#xEA;n s&#x1EBD; c&#xF3; t&#x1EDB;i hai c&#xE2;y c&#xFA; ph&#xE1;p t&#x1B0;&#x1A1;ng &#x1EE9;ng. C&#xE2;y c&#xFA; ph&#xE1;p th&#x1EE9; nh&#x1EA5;t (b&#xEA;n tr&#xE1;i) th&#x1EC3; hi&#x1EC7;n &#xFD; ngh&#x129;a ch&#x1EE7; ng&#x1EEF; l&#xE0; &quot;I&quot;, th&#x1EF1;c hi&#x1EC7;n h&#xE0;nh &#x111;&#x1ED9;ng l&#xE0; &quot;shot&quot;, v&#xE0; tr&#x1EA1;ng ng&#x1EEF; &quot;in my pajamas&quot; b&#x1ED5; ngh&#x129;a cho ch&#x1EE7; ng&#x1EEF; &quot;I&quot; (D&#x1ECB;ch ra ti&#x1EBF;ng Vi&#x1EC7;t th&#xEC; c&#xF3; th&#x1EC3; hi&#x1EC3;u l&#xE0; t&#xF4;i b&#x1EAF;n con voi trong l&#xFA;c (t&#xF4;i) b&#x1EAD;n b&#x1ED9; pajamas). C&#xE2;y c&#xFA; ph&#xE1;p th&#x1EE9; hai (b&#xEA;n ph&#x1EA3;i) l&#x1EA1;i th&#x1EC3; hi&#x1EC7;n &#xFD; ngh&#x129;a kh&#xE1;c v&#xEC; l&#xFA;c n&#xE0;y &quot;in my pajamas&quot; kh&#xF4;ng b&#x1ED5; ngh&#x129;a cho &quot;I&quot; m&#xE0; b&#x1ED5; ngh&#x129;a cho &quot;the elephant&quot; (Hay hi&#x1EC3;u trong ti&#x1EBF;ng Vi&#x1EC7;t l&#xE0; t&#xF4;i b&#x1EAF;n con voi trong l&#xFA;c con voi &#x111;ang &#x1EDF; trong b&#x1ED9; pajamas c&#x1EE7;a t&#xF4;i). &#x110;&#x1ED1;i v&#x1EDB;i con ng&#x1B0;&#x1EDD;i vi&#x1EC7;c ph&#xE2;n &#x111;&#x1ECB;nh &#x111;&#xE2;u l&#xE0; c&#x1EA5;u tr&#xFA;c &#x111;&#xFA;ng r&#x1EA5;t &#x111;&#x1A1;n gi&#x1EA3;n v&#xEC; con ng&#x1B0;&#x1EDD;i hi&#x1EC3;u ng&#x1EEF; ngh&#x129;a c&#x1EE7;a c&#xE2;u v&#xE0; c&#xF3; tri th&#x1EE9;c v&#x1EC1; &#xFD; ngh&#x129;a &#x111;&#xF3; (con voi kh&#xF4;ng th&#x1EC3; &#x1EDF; trong b&#x1ED9; pajamas &#x111;&#x1B0;&#x1EE3;c hay &#xED;t nh&#x1EA5;t th&#xEC; c&#xF3; v&#x1EBB; vi&#x1EC7;c &quot;I&quot; &#x111;i v&#x1EDB;i &quot;pajamas&quot; c&#xF3; v&#x1EBB; h&#x1EE3;p l&#xFD; h&#x1A1;n). Tuy nhi&#xEA;n, &#x111;i&#x1EC1;u n&#xE0;y l&#x1EA1;i tr&#x1EDF; n&#xEA;n kh&#xF3; kh&#x103;n &#x111;&#x1ED1;i v&#x1EDB;i m&#xE1;y t&#xED;nh v&#xEC; m&#xE1;y t&#xED;nh kh&#xF4;ng hi&#x1EC3;u ng&#x1EEF; ngh&#x129;a c&#x1EE7;a c&#xE2;u v&#xE0; l&#x1EA1;i c&#xE0;ng kh&#xF4;ng bi&#x1EBF;t r&#x1EB1;ng con ng&#x1B0;&#x1EDD;i &#x111;i v&#x1EDB;i pajamas s&#x1EBD; h&#x1EE3;p l&#xFD; h&#x1A1;n con voi. &#x110;&#x1ED1;i v&#x1EDB;i m&#xE1;y t&#xED;nh th&#xEC; c&#x1EA3; hai c&#xE1;ch ph&#xE2;n t&#xED;ch n&#xE0;y &#x111;&#x1EC1;u &#x111;&#xFA;ng v&#xE0; ch&#xFA;ng ch&#x1EC9; &#x111;&#x1A1;n thu&#x1EA7;n bi&#x1EBF;t r&#x1EB1;ng c&#xE2;u tr&#xEA;n cho ra hai c&#xE1;ch ph&#xE2;n t&#xED;ch c&#xFA; ph&#xE1;p. &#x110;&#xF4;i khi s&#x1EF1; nh&#x1EAD;p nh&#x1EB1;n c&#x169;ng kh&#xF3; ph&#xE2;n &#x111;&#x1ECB;nh trong th&#x1EF1;c t&#x1EBF;. V&#xED; d&#x1EE5; v&#x1EDB;i m&#x1ED9;t c&#xE2;u ti&#x1EBF;ng Vi&#x1EC7;t &#x111;i&#x1EC3;n h&#xEC;nh s&#x1EED; d&#x1EE5;ng ph&#xE9;p ch&#x1A1;i ch&#x1EEF; &quot;H&#x1ED5; mang b&#xF2; l&#xEA;n n&#xFA;i&quot;. C&#xE2;u n&#xE0;y c&#xF3; th&#x1EC3; hi&#x1EC3;u ch&#x1EE7; ng&#x1EEF; l&#xE0; &quot;H&#x1ED5; mang&quot;, &#x111;&#x1ED9;ng t&#x1EEB; l&#xE0; &quot;b&#xF2;&quot; ho&#x1EB7;c ch&#x1EE7; ng&#x1EEF; l&#xE0; &quot;H&#x1ED5;&quot;, &#x111;&#x1ED9;ng t&#x1EEB; l&#xE0; &quot;mang&quot; v&#xE0; c&#xE1;ch hi&#x1EC3;u n&#xE0;o trong th&#x1EF1;c t&#x1EBF; &#x111;&#x1EC1;u c&#x169;ng h&#x1EE3;p l&#xFD;. &#x110;&#x1EC3; gi&#x1EA3;i quy&#x1EBF;t nh&#x1EAD;p nh&#x1EB1;n n&#xE0;y ta l&#x1EA1;i ph&#x1EA3;i x&#xE9;t th&#xEA;m ng&#x1EEF; c&#x1EA3;nh, &#x111;o&#x1EA1;n v&#x103;n, ... v&#xE0; nh&#x1B0; v&#x1EAD;y l&#x1EA1;i c&#xE0;ng kh&#xF3; cho m&#xE1;y t&#xED;nh. M&#x1ED9;t tin t&#x1ED1;t l&#xE0; nh&#x1EEF;ng c&#xE2;u nh&#x1B0; v&#x1EAD;y kh&#xF4;ng xu&#x1EA5;t hi&#x1EC7;n qu&#xE1; th&#x1B0;&#x1EDD;ng xuy&#xEA;n trong v&#x103;n b&#x1EA3;n h&#xE0;ng ng&#xE0;y m&#xE0; th&#x1B0;&#x1EDD;ng ch&#x1EC9; xu&#x1EA5;t hi&#x1EC7;n khi ng&#x1B0;&#x1EDD;i d&#xF9;ng c&#x1ED1; t&#xEC;nh &#x111;&#x1EC3; t&#x1EA1;o ra nh&#x1EEF;ng c&#xE1;ch ch&#x1A1;i ch&#x1EEF; trong ng&#xF4;n ng&#x1EEF;. Ch&#xFA;ng ta c&#x169;ng kh&#xF4;ng c&#x1EA7;n qu&#xE1; ch&#xFA; tr&#x1ECD;ng gi&#x1EA3;i quy&#x1EBF;t nh&#x1EAD;p nh&#x1EB1;n v&#xEC; ch&#xED;nh ch&#xFA;ng ta c&#x169;ng kh&#xF4;ng gi&#x1EA3;i quy&#x1EBF;t &#x111;&#x1B0;&#x1EE3;c v&#xE0; h&#x1A1;n n&#x1EEF;a vi&#x1EC7;c m&#xE1;y t&#xED;nh ph&#xE1;t hi&#x1EC7;n ra nh&#x1EAD;p nh&#x1EB1;n &#x111;&#xF4;i khi l&#x1EA1;i d&#x1EAB;n &#x111;&#x1EBF;n m&#x1ED9;t c&#xE1;ch hi&#x1EC3;u m&#x1EDB;i cho v&#x103;n b&#x1EA3;n m&#xE0; ta ch&#x1B0;a nh&#xEC;n ra. D&#xF9; v&#x1EAD;y, nh&#x1EAD;p nh&#x1EB1;n v&#x1EAB;n l&#xE0; m&#x1ED9;t v&#x1EA5;n &#x111;&#x1EC1; c&#x1EA7;n l&#x1B0;u &#xFD; khi ph&#xE2;n t&#xED;ch c&#xFA; ph&#xE1;p cho c&#xE2;u &#x111;&#x1EC3; t&#x103;ng &#x111;&#x1ED9; ch&#xED;nh x&#xE1;c cho m&#xF4; h&#xEC;nh ph&#xE2;n t&#xED;ch c&#x1EE7;a ch&#xFA;ng ta.</p>
<h2 id="v&#x103;n-ph&#x1EA1;m-phi-ng&#x1EEF;-c&#x1EA3;nh---context-free-grammar-cfg">V&#x103;n ph&#x1EA1;m phi ng&#x1EEF; c&#x1EA3;nh - Context Free Grammar (CFG)</h2>
<p>V&#x103;n ph&#x1EA1;m c&#x1EE7;a m&#x1ED9;t ng&#xF4;n ng&#x1EEF; ch&#xED;nh l&#xE0; t&#x1EAD;p c&#xE1;c quy t&#x1EAF;c &#x111;&#x1EC3; n&#x1ED1;i gh&#xE9;p c&#xE1;c t&#x1EEB; trong ng&#xF4;n ng&#x1EEF; &#x111;&#xF3;. &#x110;&#x1EC3; ph&#xE2;n t&#xED;ch th&#xE0;nh ph&#x1EA7;n c&#x1EE7;a c&#xE2;u ch&#xFA;ng ta c&#x1EA7;n c&#xF3; v&#x103;n ph&#x1EA1;m c&#x1EE7;a ng&#xF4;n ng&#x1EEF; t&#x1B0;&#x1A1;ng &#x1EE9;ng. V&#xED; d&#x1EE5;: trong ti&#x1EBF;ng Vi&#x1EC7;t t&#xED;nh t&#x1EEB; &#x111;&#x1EE9;ng sau danh t&#x1EEB; (qu&#x1EA3; t&#xE1;o &#x111;&#x1ECF;), trong ti&#x1EBF;ng Anh t&#xED;nh t&#x1EEB; l&#x1EA1;i &#x111;&#x1EE9;ng tr&#x1B0;&#x1EDB;c danh t&#x1EEB; (red apple) n&#xEA;n kh&#xF4;ng th&#x1EC3; &#xE1;p d&#x1EE5;ng v&#x103;n ph&#x1EA1;m ti&#x1EBF;ng Anh &#x111;&#x1EC3; ph&#xE2;n t&#xED;ch ti&#x1EBF;ng Vi&#x1EC7;t. V&#x103;n ph&#x1EA1;m phi ng&#x1EEF; c&#x1EA3;nh l&#xE0; v&#x103;n ph&#x1EA1;m ch&#x1EC9; x&#xE9;t tr&#xEA;n ph&#x1EA1;m vi d&#x1EEF; li&#x1EC7;u v&#x103;n b&#x1EA3;n, kh&#xF4;ng x&#xE9;t y&#x1EBF;u t&#x1ED1; ng&#x1EEF; c&#x1EA3;nh. V&#xED; d&#x1EE5; c&#xE2;u &quot;K&#xEC;a!&quot; n&#x1EBF;u x&#xE9;t trong m&#x1ED9;t ng&#x1EEF; c&#x1EA3;nh c&#x1EE5; th&#x1EC3; th&#xEC; n&#xF3; c&#xF3; ngh&#x129;a nh&#x1B0;ng n&#x1EBF;u lo&#x1EA1;i b&#x1ECF; &#x111;i ng&#x1EEF; c&#x1EA3;nh th&#xEC; c&#xE2;u n&#xE0;y tr&#x1EDF; n&#xEA;n v&#xF4; ngh&#x129;a. Nh&#x1B0; v&#x1EAD;y, v&#x103;n ph&#x1EA1;m phi ng&#x1EEF; c&#x1EA3;nh c&#xF3; th&#x1EC3; hi&#x1EC3;u l&#xE0; t&#x1EAD;p c&#xE1;c lu&#x1EAD;t d&#xF9;ng &#x111;&#x1EC3; h&#xEC;nh th&#xE0;nh c&#xE2;u m&#xE0; kh&#xF4;ng c&#x1EA7;n &#x111;&#x1EBF;n y&#x1EBF;u t&#x1ED1; ng&#x1EEF; c&#x1EA3;nh. &#x110;&#x1EC3; bi&#x1EC3;u di&#x1EC5;n v&#x103;n ph&#x1EA1;m phi ng&#x1EEF; c&#x1EA3;nh, ta c&#xF3; th&#x1EC3; bi&#x1EC3;u di&#x1EC5;n theo c&#xE1;ch sau:</p>
<p>S -&gt; NP VP</p>
<p>NP -&gt; det NP | Adj NP | pro | n</p>
<p>VP -&gt; v NP | v NP PP | v PP</p>
<p>PP -&gt; v NP</p>
<p>...</p>
<p>Tr&#xEA;n l&#xE0; nh&#x1EEF;ng lu&#x1EAD;t c&#x1EE7;a m&#x1ED9;t v&#x103;n ph&#x1EA1;m. C&#xE1;c lu&#x1EAD;t &#x111;&#xF3; c&#xF3; &#xFD; ngh&#x129;a: c&#xE2;u (S) c&#xF3; th&#x1EC3; chia th&#xE0;nh 2 th&#xE0;nh ph&#x1EA7;n NP (noun phrase) v&#xE0; VP (verb phrase); NP c&#xF3; th&#x1EC3; t&#x1EA1;o th&#xE0;nh t&#x1EEB; m&#x1ED9;t m&#x1EA1;o t&#x1EEB; (det) k&#x1EBF;t h&#x1EE3;p v&#x1EDB;i m&#x1ED9;t NP kh&#xE1;c, ho&#x1EB7;c t&#x1EEB; m&#x1ED9;t t&#xED;nh t&#x1EEB; (Adj) k&#x1EBF;t h&#x1EE3;p v&#x1EDB;i m&#x1ED9;t NP kh&#xE1;c ho&#x1EB7;c ch&#x1EC9; &#x111;&#x1A1;n gi&#x1EA3;n NP l&#xE0; m&#x1ED9;t danh t&#x1EEB; (n) ho&#x1EB7;c &#x111;&#x1EA1;i t&#x1EEB; (pro); VP c&#xF3; th&#x1EC3; bao g&#x1ED3;m &#x111;&#x1ED9;ng t&#x1EEB; (v) k&#x1EBF;t h&#x1EE3;p v&#x1EDB;i m&#x1ED9;t NP, ho&#x1EB7;c m&#x1ED9;t PP, ho&#x1EB7;c c&#x1EA3; NP v&#xE0; PP. Ta c&#xF3; th&#x1EC3; d&#xF9;ng v&#x103;n ph&#x1EA1;m tr&#xEA;n &#x111;&#x1EC3; ph&#xE2;n t&#xED;ch m&#x1ED9;t c&#xE2;u m&#xE0; kh&#xF4;ng c&#x1EA7;n &#x111;&#x1EBF;n ng&#x1EEF; c&#x1EA3;nh. L&#x1EA5;y v&#xED; d&#x1EE5; cho c&#xE2;u &quot;I eat a big turkey&quot;, ta c&#xF3; c&#xE2;y c&#xFA; ph&#xE1;p nh&#x1B0; sau:</p>
<p align="center">
<img src="/images/GrammarParser.jpg" alt="" width="450">
</p>
<p>Trong c&#xE2;y c&#xFA; ph&#xE1;p tr&#xEA;n, ta th&#x1EA5;y lu&#x1EAD;t &#x111;&#xE3; &#x111;&#x1B0;&#x1EE3;c &#xE1;p d&#x1EE5;ng &#x111;&#x1EC3; ch&#x1EC9; ra r&#x1EB1;ng NP c&#x1EE7;a c&#xE2;u l&#xE0; &apos;I&apos; (pro), VP l&#xE0; &apos;eat a big turkey&apos; bao g&#x1ED3;m &apos;eat&apos; (v) v&#xE0; m&#x1ED9;t NP kh&#xE1;c. N&#x1EBF;u ch&#xFA;ng ta d&#xF9;ng lu&#x1EAD;t tr&#xEA;n &#x111;&#x1EC3; ph&#xE2;n t&#xED;ch c&#xE2;u &quot;Eat a I turkey big&quot;, m&#xF4; h&#xEC;nh ph&#xE2;n t&#xED;ch c&#xF3; th&#x1EC3; ph&#xE1;t hi&#x1EC7;n c&#xE2;u tr&#xEA;n l&#xE0; m&#x1ED9;t c&#xE2;u sai v&#xEC; kh&#xF4;ng c&#xF3; lu&#x1EAD;t th&#x1ECF;a c&#xE2;u &quot;Eat a I turkey big&quot;. M&#x1ED7;i ng&#xF4;n ng&#x1EEF; &#x111;&#x1EC1;u c&#xF3; m&#x1ED9;t v&#x103;n ph&#x1EA1;m v&#xE0; n&#x1EBF;u ta x&#xE2;y d&#x1EF1;ng &#x111;&#x1B0;&#x1EE3;c b&#x1ED9; v&#x103;n ph&#x1EA1;m &#x111;&#x1EA7;y &#x111;&#x1EE7; c&#x1EE7;a ng&#xF4;n ng&#x1EEF; &#x111;&#xF3; th&#xEC; ta c&#xF3; th&#x1EC3; ph&#xE2;n t&#xED;ch c&#xFA; ph&#xE1;p v&#x103;n ph&#x1EA1;m c&#x1EE7;a m&#x1ED9;t c&#xE2;u b&#x1EA5;t k&#x1EF3; thu&#x1ED9;c ng&#xF4;n ng&#x1EEF; &#x111;&#xF3; (kh&#xF4;ng ph&#x1EE5; thu&#x1ED9;c v&#xE0;o ng&#x1EEF; c&#x1EA3;nh). Trong v&#x103;n ph&#x1EA1;m phi ng&#x1EEF; c&#x1EA3;nh, c&#xE1;c th&#xE0;nh ph&#x1EA7;n c&#x1EE7;a c&#xE2;u c&#xF3; th&#x1EC3; chia l&#xE0; hai nh&#xF3;m ch&#xED;nh: Terminal (th&#xE0;nh ph&#x1EA7;n k&#x1EBF;t th&#xFA;c) v&#xE0; Non-terminal (th&#xE0;nh ph&#x1EA7;n ch&#x1B0;a k&#x1EBF;t th&#xFA;c). C&#xE1;c th&#xE0;nh ph&#x1EA7;n k&#x1EBF;t th&#xFA;c l&#xE0; nh&#x1EEF;ng th&#xE0;nh ph&#x1EA7;n m&#xE0; kh&#xF4;ng th&#x1EC3; ph&#xE2;n gi&#x1EA3;i ra n&#x1EEF;a v&#xE0; ng&#x1B0;&#x1EE3;c l&#x1EA1;i, c&#xE1;c th&#xE0;nh ph&#x1EA7;n k&#x1EBF;t th&#xFA;c l&#xE0; c&#xE1;c th&#xE0;nh ph&#x1EA7;n v&#x1EAB;n c&#xF3; th&#x1EC3; ti&#x1EBF;p t&#x1EE5;c ph&#xE2;n gi&#x1EA3;i. Nh&#x1B0; v&#x1EAD;y khi ph&#xE2;n t&#xED;ch c&#xE2;u, k&#x1EBF;t qu&#x1EA3; cu&#x1ED1;i c&#xF9;ng c&#x1EE7;a qu&#xE1; tr&#xEC;nh ph&#xE2;n t&#xED;ch (t&#x1EE9;c n&#xFA;t l&#xE1; c&#x1EE7;a c&#xE2;y c&#xFA; ph&#xE1;p) ch&#x1EC9; bao g&#x1ED3;m c&#xE1;c th&#xE0;nh ph&#x1EA7;n k&#x1EBF;t th&#xFA;c, c&#x169;ng ch&#xED;nh l&#xE0; c&#xE1;c nh&#xE3;n t&#x1EEB; lo&#x1EA1;i c&#x1EE7;a c&#xE2;u. C&#xE1;c th&#xE0;nh ph&#x1EA7;n k&#x1EBF;t th&#xFA;c n&#xE0;y (non-terminal) l&#xE0; ch&#xEC;a kh&#xF3;a quan tr&#x1ECD;ng cho c&#xE1;c m&#xF4; h&#xEC;nh ph&#xE2;n t&#xED;ch v&#xEC; v&#x1EAD;y &#x111;i k&#xE8;m v&#x1EDB;i b&#x1ED9; lu&#x1EAD;t v&#x103;n ph&#x1EA1;m ch&#xFA;ng ta c&#x169;ng c&#x1EA7;n &#x111;&#xE1;nh nh&#xE3;n t&#x1EEB; lo&#x1EA1;i cho d&#x1EEF; li&#x1EC7;u.</p>
<h2 id="m&#x1ED9;t-s&#x1ED1;-m&#xF4;-h&#xEC;nh-ph&#xE2;n-t&#xED;ch-v&#x103;n-ph&#x1EA1;m-d&#x1EF1;a-tr&#xEA;n-cfg">M&#x1ED9;t s&#x1ED1; m&#xF4; h&#xEC;nh ph&#xE2;n t&#xED;ch v&#x103;n ph&#x1EA1;m d&#x1EF1;a tr&#xEA;n CFG</h2>
<h3 id="m&#xF4;-h&#xEC;nh-ph&#xE2;n-t&#xED;ch-top-down">M&#xF4; h&#xEC;nh ph&#xE2;n t&#xED;ch Top-down</h3>
<p>&#xDD; t&#x1B0;&#x1EDF;ng c&#x1A1; b&#x1EA3;n c&#x1EE7;a m&#xF4; h&#xEC;nh n&#xE0;y ch&#xED;nh l&#xE0; d&#x1EF1;a tr&#xEA;n lu&#x1EAD;t sinh ra m&#x1ED9;t m&#xF4; h&#xEC;nh c&#xE2;y r&#x1ED3;i &#x111;&#x1ED1;i s&#xE1;nh v&#x1EDB;i v&#x103;n b&#x1EA3;n &#x111;&#x1EA7;u v&#xE0;o. N&#xF3;i &#x111;&#x1A1;n gi&#x1EA3;n ch&#xED;nh l&#xE0; &#x111;i t&#x1EEB; lu&#x1EAD;t &#x111;&#x1EBF;n v&#x103;n b&#x1EA3;n. Recursive Descent Parser (thu&#x1EAD;t to&#xE1;n duy&#x1EC7;t xu&#x1ED1;ng c&#xF3; &#x111;&#x1EC7; quy) l&#xE0; m&#x1ED9;t trong nh&#x1EEF;ng thu&#x1EAD;t to&#xE1;n &#x111;i&#x1EC3;n h&#xEC;nh cho m&#xF4; h&#xEC;nh n&#xE0;y. Thu&#x1EAD;t to&#xE1;n &#x111;i t&#x1EEB; n&#xFA;t g&#x1ED1;c S v&#xE0; duy&#x1EC7;t qua t&#x1EAD;p lu&#x1EAD;t &#x111;&#x1EC3; t&#xEC;m nh&#x1EEF;ng lu&#x1EAD;t c&#xF3; th&#x1EC3; m&#x1EDF; r&#x1ED9;ng c&#xE2;y t&#x1EEB; n&#xFA;t S v&#xE0; th&#xEA;m c&#xE1;c th&#xE0;nh ph&#x1EA7;n &#x111;&#x1B0;&#x1EE3;c sinh ra t&#x1EEB; S (vd nh&#x1B0; NP, VP) v&#xE0;o c&#xE2;y. Sau &#x111;&#xF3; &#x111;i sang nh&#xE1;nh tr&#xE1;i v&#xE0; ti&#x1EBF;p t&#x1EE5;c m&#x1EDF; r&#x1ED9;ng c&#xE2;y (vd: NP s&#x1EBD; th&#xEA;m v&#xE0;o c&#xE2;y n&#xFA;t Det, N) cho &#x111;&#x1EBF;n khi &#x111;&#x1EBF;n m&#x1ED9;t n&#xFA;t l&#xE0; th&#xE0;nh ph&#x1EA7;n k&#x1EBF;t th&#xFA;c th&#xEC; s&#x1EBD; so kh&#x1EDB;p nh&#xE3;n t&#x1EEB; lo&#x1EA1;i n&#xE0;y v&#x1EDB;i t&#x1EEB; lo&#x1EA1;i c&#x1EE7;a t&#x1EEB; t&#x1B0;&#x1A1;ng &#x1EE9;ng trong c&#xE2;u (m&#xF4; h&#xEC;nh duy&#x1EC7;t c&#xE2;y &#x111;i t&#x1EEB; tr&#xE1;i sang ph&#x1EA3;i n&#xEA;n t&#x1EEB; t&#x1B0;&#x1A1;ng &#x1EE9;ng c&#x169;ng theo th&#x1EE9; t&#x1EF1; tr&#xE1;i sang ph&#x1EA3;i - ph&#xF9; h&#x1EE3;p c&#xE1;ch &#x111;&#x1ECD;c th&#xF4;ng th&#x1B0;&#x1EDD;ng c&#x1EE7;a con ng&#x1B0;&#x1EDD;i). N&#x1EBF;u kh&#x1EDB;p th&#xEC; ti&#x1EBF;p t&#x1EE5;c sinh c&#xE2;y t&#x1EEB; lu&#x1EAD;t c&#xF2;n n&#x1EBF;u kh&#xF4;ng kh&#x1EDB;p th&#xEC; lo&#x1EA1;i b&#x1ECF; c&#xE2;y &#x111;&#xF3;. Sau qu&#xE1; tr&#xEC;nh duy&#x1EC7;t h&#x1EBF;t m&#x1ED9;t c&#xE2;y (k&#x1EC3; c&#x1EA3; ph&#xE2;n t&#xED;ch th&#xE0;nh c&#xF4;ng ho&#x1EB7;c h&#x1EE7;y c&#xE2;y gi&#x1EEF;a ch&#x1EEB;ng) m&#xF4; h&#xEC;nh s&#x1EBD; &#x111;&#x1EC7; quy hay truy h&#x1ED3;i ng&#x1B0;&#x1EE3;c l&#x1EA1;i &#x111;&#x1EC3; th&#x1EED; &#xE1;p d&#x1EE5;ng c&#xE1;c lu&#x1EAD;t kh&#xE1;c v&#xE0; sinh c&#xE2;y kh&#xE1;c. Vi&#x1EC7;c truy h&#x1ED3;i nh&#x1B0; v&#x1EAD;y l&#xE0; &#x111;&#x1EC3; cho tr&#x1B0;&#x1EDD;ng h&#x1EE3;p m&#x1ED9;t c&#xE2;u c&#xF3; th&#x1EC3; c&#xF3; hai c&#xE1;ch ph&#xE2;n t&#xED;ch nh&#x1B0; n&#xF3;i &#x1EDF; tr&#xEA;n. H&#x1EA1;n ch&#x1EBF; c&#x1EE7;a m&#xF4; h&#xEC;nh top-down l&#xE0; kh&#xF4;ng b&#xE1;m s&#xE1;t v&#x103;n ph&#x1EA1;m m&#xE0; s&#xED;nh c&#xE2;y tr&#x1B0;&#x1EDB;c. Th&#x1EE9; t&#x1EF1; ch&#x1ECD;n lu&#x1EAD;t sinh c&#xE2;y c&#xF3; th&#x1EC3; &#x1EA3;nh h&#x1B0;&#x1EDF;ng &#x111;&#x1EBF;n vi&#x1EC7;c c&#xF3; ph&#xE2;n t&#xED;ch &#x111;&#x1B0;&#x1EE3;c c&#xFA; ph&#xE1;p ho&#xE0;n ch&#x1EC9;nh hay kh&#xF4;ng, &#x111;&#x1ED3;ng th&#x1EDD;i ph&#x1EA3;i duy&#x1EC7;t qua c&#xE1;c c&#x1EA5;u tr&#xFA;c th&#x1EEB;a. H&#x1A1;n n&#x1EEF;a trong nhi&#x1EC1;u ng&#xF4;n ng&#x1EEF;, lu&#x1EAD;t v&#x103;n ph&#x1EA1;m c&#xF3; mang t&#xED;nh &#x111;&#x1EC7; quy (vd NP -&gt; det NP) s&#x1EBD; d&#x1EAB;n &#x111;&#x1EBF;n vi&#x1EC7;c sinh c&#xE2;y r&#x1A1;i v&#xE0;o c&#xE1;c nh&#xE1;nh c&#xF3; &#x111;&#x1ED9; s&#xE2;u v&#xF4; h&#x1EA1;n.</p>
<p align="center">
</p><p><img src="images/reparser.jpg" width="450"></p>
<em>recursice descent parser</em>
<p></p>
<h3 id="m&#xF4;-h&#xEC;nh-ph&#xE2;n-t&#xED;ch-bottom-up">M&#xF4; h&#xEC;nh ph&#xE2;n t&#xED;ch Bottom-up</h3>
<p>Tr&#xE1;nh nh&#x1EEF;ng sai l&#x1EA7;m c&#x1EE7;a m&#xF4; h&#xEC;nh top-down, m&#xF4; h&#xEC;nh bottom-up c&#xF3; h&#x1B0;&#x1EDB;ng ti&#x1EBF;p c&#x1EAD;n ng&#x1B0;&#x1EE3;c l&#x1EA1;i: &#x111;i t&#x1EEB; v&#x103;n b&#x1EA3;n &#x111;&#x1EBF;n lu&#x1EAD;t. &#x110;i&#x1EC3;n h&#xEC;nh cho m&#xF4; h&#xEC;nh n&#xE0;y l&#xE0; thu&#x1EAD;t to&#xE1;n Shift-Reduce Parser (thu&#x1EAD;t to&#xE1;n d&#x1ECB;ch chuy&#x1EC3;n v&#xE0; gom c&#x1EE5;m). Thu&#x1EAD;t to&#xE1;n b&#x1EAF;t &#x111;&#x1EA7;u v&#x1EDB;i v&#x103;n b&#x1EA3;n &#x111;&#x1EA7;u v&#xE0;o, l&#x1EA7;n l&#x1B0;&#x1EE3;t d&#x1ECB;ch chuy&#x1EC3;n c&#xE1;c t&#x1EEB; v&#x1EDB;i nh&#xE3;n t&#x1EEB; lo&#x1EA1;i c&#x1EE7;a n&#xF3;, c&#x169;ng ch&#xED;nh l&#xE0; c&#xE1;c th&#xE0;nh ph&#x1EA7;n k&#x1EBF;t th&#xFA;c (terminal), v&#xE0;o h&#xE0;ng &#x111;&#x1EE3;i. N&#x1EBF;u t&#x1ED3;n t&#x1EA1;i c&#xE1;ch g&#x1ED9;p c&#xE1;c th&#xE0;nh ph&#x1EA7;n hi&#x1EC7;n c&#xF3; trong h&#xE0;ng &#x111;&#x1EE3;i th&#xE0;nh m&#x1ED9;t th&#xE0;nh ph&#x1EA7;n ch&#x1B0;a k&#x1EBF;t th&#xFA;c (non-terminal) d&#x1EF1;a theo lu&#x1EAD;t th&#xEC; gom l&#x1EA1;i v&#xE0; thay th&#x1EBF; th&#xE0;nh non-terminal &#x111;&#xF3;. T&#xF3;m t&#x1EAF;t l&#x1EA1;i l&#xE0; l&#x1EA7;n l&#x1B0;&#x1EE3;t t&#x1EEB;ng t&#x1EEB; s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c b&#x1ECF; v&#xE0;o h&#xE0;ng &#x111;&#x1EE3;i v&#xE0; k&#x1EBF;t h&#x1EE3;p v&#x1EDB;i nhau th&#xE0;nh m&#x1ED9;t th&#xE0;nh ph&#x1EA7;n l&#x1EDB;n h&#x1A1;n. Vi&#x1EC7;c g&#x1ED9;p s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c l&#x1EB7;p cho &#x111;&#x1EBF;n khi ch&#x1EC9; c&#xF2;n l&#x1EA1;i th&#xE0;nh ph&#x1EA7;n cao nh&#x1EA5;t l&#xE0; S (n&#xFA;t c&#x1EE7;a c&#xE2;y c&#xFA; ph&#xE1;p). Vd: c&#xE2;u &quot;The man saw a dog&quot; th&#xEC; t&#x1EEB; &quot;The&quot; s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c &#x111;&#x1B0;a v&#xE0;o h&#xE0;ng &#x111;&#x1EE3;i tr&#x1B0;&#x1EDB;c, sau &#x111;&#xF3; &#x111;&#x1EBF;n t&#x1EEB; &quot;man&quot;, l&#xFA;c n&#xE0;y ta c&#xF3; lu&#x1EAD;t &quot;NP -&gt; det n&quot; ph&#xF9; h&#x1EE3;p n&#xEA;n hai t&#x1EEB; &quot;The&quot;, &quot;man&quot; s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c g&#x1ED9;p th&#xE0;nh m&#x1ED9;t th&#xE0;nh ph&#x1EA7;n NP. C&#xE1;c t&#x1EEB; &quot;saw&quot;, &quot;a&quot;, &quot;dog&quot; c&#x1EE9; th&#x1EBF; ti&#x1EBF;p t&#x1EE5;c v&#xE0;o h&#xE0;ng &#x111;&#x1EE3;i v&#xE0; g&#x1ED9;p th&#xE0;nh nh&#xF3;m.</p>
<p align="center">
<img src="images/srparser1.jpg" alt="srparser1" height="200"> <img src="images/srparser2.jpg" height="200">
</p>
<p>C&#xE1;ch ti&#x1EBF;p c&#x1EAD;n n&#xE0;y gi&#xFA;p c&#xE2;u ph&#xE2;n t&#xED;ch s&#xE1;t v&#x1EDB;i v&#x103;n b&#x1EA3;n, kh&#xF4;ng ph&#x1EA3;i duy&#x1EC7;t qua c&#xE1;c c&#x1EA5;u tr&#xFA;c th&#x1EEB;a &#x111;&#x1ED3;ng th&#x1EDD;i tr&#xE1;nh l&#x1EB7;p v&#xF4; h&#x1EA1;n v&#x1EDB;i c&#xE1;c lu&#x1EAD;t &#x111;&#x1EC7; quy. Tuy nhi&#xEA;n, vi&#x1EC7;c gom nh&#xF3;m s&#x1EDB;m c&#xF3; th&#x1EC3; d&#x1EAB;n &#x111;&#x1EBF;n vi&#x1EC7;c t&#x1EA1;o th&#xE0;nh c&#xE1;c th&#xE0;nh ph&#x1EA7;n m&#x1EDB;i qu&#xE1; s&#x1EDB;m v&#xE0; kh&#xF4;ng ph&#xF9; h&#x1EE3;p v&#x1EDB;i c&#xE1;ch ph&#xE2;n t&#xED;ch th&#x1EAD;t trong khi &#x111;&#xE1;ng l&#x1EBD; ph&#x1EA3;i ch&#x1EDD; m&#x1ED9;t hay hai t&#x1EEB; n&#x1EEF;a &#x111;&#x1EC3; gom nh&#xF3;m (vd: c&#xF3; hai lu&#x1EAD;t VP -&gt; v NP v&#xE0; VP -&gt; v NP PP th&#xEC; ch&#x1B0;a ch&#x1EDD; PP v&#xE0;o m&#xF4; h&#xEC;nh g&#x1ED9;p ngay v NP th&#xE0;nh VP khi&#x1EBF;n cho c&#x1EA3; c&#x1EE5;m &quot;saw a dog in the park&quot; v&#x1ED1;n l&#xE0; m&#x1ED9;t VP b&#x1ECB; c&#x1EAF;t th&#xE0;nh &quot;see the dog&quot; l&#xE0; VP v&#xE0; &quot;in the park&quot; b&#x1ECB; lo&#x1EA1;i b&#x1ECF;).</p>
<p align="center">
</p><p><img src="images/srparser3.jpg" alt="srparser-error" width="600"></p>
<em>tr&#x1B0;&#x1EDD;ng h&#x1EE3;p l&#x1ED7;i c&#x1EE7;a m&#xF4; h&#xEC;nh shift-reduce parser</em>
<p></p>
<p>Vi&#x1EC7;c ph&#x1EA1;m sai l&#x1EA7;m nh&#x1B0; v&#x1EAD;y &#x111;&#xF4;i khi c&#xF2;n d&#x1EAB;n &#x111;&#x1EBF;n nh&#x1EEF;ng nh&#xE1;nh c&#x1EE5;t (dead end) v&#xE0; khi&#x1EBF;n cho kh&#xF4;ng ph&#xE2;n t&#xED;ch &#x111;&#x1B0;&#x1EE3;c d&#xF9; cho c&#xE2;u ho&#xE0;n to&#xE0;n &#x111;&#xFA;ng theo lu&#x1EAD;t. Cho n&#xEA;n c&#x169;ng ph&#x1EA3;i c&#xE2;n nh&#x1EAF;c khi l&#x1EF1;a ch&#x1ECD;n m&#xF4; h&#xEC;nh ho&#x1EB7;c k&#x1EBF;t h&#x1EE3;p c&#x1EA3; top-down v&#xE0; bottom-up &#x111;&#x1EC3; t&#x103;ng &#x111;&#x1ED9; ch&#xED;nh x&#xE1;c.</p>
<p>B&#xE0;i vi&#x1EBF;t tham kh&#x1EA3;o t&#x1EEB; c&#xE1;c ngu&#x1ED3;n</p>
<p><a href="http://www.nltk.org/book_1ed/ch08.html" target="_blank">Ch&#x1B0;&#x1A1;ng 8, cu&#x1ED1;n s&#xE1;ch <em>Natural Language Processing with Python</em></a></p>
</div></div><div class="post-main post-comment"><div id="disqus_thread"></div><script type="text/javascript">
var disqus_shortname = 'lqan';
var disqus_identifier = '2019/02/13/constituency-parsing/';
var disqus_title = 'Phân tích cú pháp văn phạm';
var disqus_url = 'http://yoursite.com/2019/02/13/constituency-parsing/';
(function() {
   var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
   dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
   (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">Blog comments powered by <span class="logo-disqus">Disqus</span></a></div></article><link rel="stylesheet" type="text/css" href="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.css"/><script src="//cdn.bootcss.com/jquery/2.0.3/jquery.min.js"></script><script src="//cdn.bootcss.com/fancybox/2.1.5/jquery.fancybox.pack.js"></script><script>$(document).ready(function() {
    $(".fancybox").fancybox();
});
</script></body></html>